Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/Resources.*.resx
Languages: fr, tr, zh_hant

# XA4312
source: Referencing the Android Wear application project '{0}' from an Android application project is deprecated and will no longer be supported in a future version of .NET for Android. Remove the Android Wear application project reference from the Android application project and distribute the Wear application as a standalone application instead.
fr: Le référencement du projet d’application Android Wear «{0}» à partir d’un projet d’application Android est déconseillé et ne sera plus pris en charge dans une future version de .NET pour Android. Supprimez la référence du projet d’application Android Wear du projet d’application Android et distribuez l’application Wear en tant qu’application autonome à la place.
tr: Bir Android uygulama projesinden Android Wear uygulama projesine '{0}' başvurmak artık kullanımdan kaldırıldı ve Android için .NET'in gelecekteki bir sürümünde artık desteklenmeyecek. Android Wear uygulama projesi referansını Android uygulama projesinden kaldırın ve bunun yerine Wear uygulamasını bağımsız bir uygulama olarak dağıtın.
zh_hant: 從 Android 應用程式專案參考 Android Wear 應用程式專案 '{0}' 的功能已淘汰，且日後的 Android 版 .NET 將不再予以支援。從 Android 應用程式專案移除 Android Wear 應用程式專案參考，並將 Wear 應用程式改為以獨立應用程式發佈。

# XA4313
source: The built-in '{0}' reference has been deprecated. Remove the '{0}' reference from your project and add the '{1}' NuGet package instead.
fr: La référence de '{0}' intégrée est déconseillée. Supprimez la référence de '{0}' de votre projet et ajoutez plutôt le '{1}'.package NuGet
tr: Yerleşik '{0}' başvurusu kullanımdan kaldırıldı. Projenizden '{0}' başvurusunu kaldırın ve yerine '{1}' NuGet paketini ekleyin.
zh_hant: 已取代內建 '{0}' 參考。 從您的專案移除 '{0}' 參考，並改為新增 '{1}' NuGet 封裝。

# XA4314
source: `{0}` is empty. A value for `{0}` should be provided.
fr: `{0}` est vide. Une valeur doit être fournie pour `{0}`.
tr: `{0}` boş. `{0}` için bir değer sağlanmlıdır.
zh_hant: '{0}' 是空的。應該提供 '{0}' 的值。

# XA5101
source: Missing Android NDK toolchains directory '{0}'. Please install the Android NDK.
fr: Répertoire de chaînes d'outils du kit Android NDK manquant '{0}'. Installez le kit Android NDK.
tr: '{0}' Android NDK araç zincirleri dizini eksik. Lütfen Android NDK'yi yükleyin.
zh_hant: 缺少 Android NDK 工具鏈目錄 '{0}'。請安裝 Android NDK。

# XA5101_C_Compiler
source: C compiler for target {0} was not found. Tried paths: "{1}"
fr: Le compilateur C pour la cible {0} est introuvable. Chemins tentés : "{1}"
tr: {0} hedefi için C derleyicisi bulunamadı. Denenen yollar: "{1}"
zh_hant: 找不到目標 {0} 的 C 編譯器。已嘗試的路徑: "{1}"

# XA5101_Toolchain
source: Toolchain directory for target {0} was not found.
fr: Le répertoire de chaîne d'outils pour la cible {0} est introuvable.
tr: {0} hedefi için araç zinciri dizini bulunamadı.
zh_hant: 找不到目標 {0} 的工具鏈目錄。

# XA5102
source: Conversion from assembly to native code failed. Exit code {0}
fr: Échec de la conversion de l'assembly en code natif. Code de sortie : {0}
tr: Bütünleştirilmiş koddan yerel koda dönüştürülemedi. Çıkış kodu {0}
zh_hant: 從組件到機器碼的轉換失敗。結束代碼 {0}

# XA5103
source: NDK C compiler exited with an error. Exit code {0}
fr: Arrêt du compilateur NDK C à la suite d'une erreur. Code de sortie : {0}
tr: NDK C derleyicisi bir hatayla çıkış yaptı. Çıkış kodu {0}
zh_hant: NDK C 編譯器結束，但發生錯誤。結束代碼 {0}

# XA5104
source: Could not locate the Android NDK. Please make sure the Android NDK is installed in the Android SDK Manager, or if using a custom NDK path, please ensure the $(AndroidNdkDirectory) MSBuild property is set to the custom path.
fr: Impossible de localiser le kit Android NDK. Vérifiez que le kit Android NDK est installé dans le Gestionnaire SDK Android, ou si vous utilisez un chemin de kit NDK personnalisé, vérifiez que la propriété MSBuild $(AndroidNdkDirectory) a la valeur du chemin personnalisé.
tr: Android NDK bulunamadı. Lütfen Android NDK'nin Android SDK Yöneticisi'nde yüklü olduğundan veya özel bir NDK yolu kullandığından emin olun. Lütfen $(AndroidNdkDirectory) MSBuild özelliğinin özel yola ayarlandığından emin olun.
zh_hant: 找不到 Android NDK。請確認 Android NDK 已安裝在 Android SDK 管理員中，若使用自訂的 NDK 路徑，請確認 $(AndroidNdkDirectory) MSBuild 屬性已設定為自訂路徑。

# XA5105
source: Toolchain utility '{0}' for target {1} was not found. Tried in path: "{2}"
fr: L'utilitaire de chaîne d'outils '{0}' pour la cible {1} est introuvable. Chemin tenté : "{2}"
tr: {1} hedefi için '{0}' araç zinciri yardımcı programı bulunamadı. "{2}" yolunda denendi
zh_hant: 找不到目標 {1} 的工具鏈公用程式 '{0}'。已在下列路徑中嘗試: "{2}"

# XA5201
source: NDK linker exited with an error. Exit code {0}
fr: Arrêt de l'éditeur de liens NDK C à la suite d'une erreur. Code de sortie : {0}
tr: NDK bağlayıcısı bir hatayla çıkış yaptı. Çıkış kodu {0}
zh_hant: NDK 連結器結束，但發生錯誤。結束代碼 {0}

# XA5205
source: Cannot find `{0}`. Please install the Android SDK Build-Tools package with the `{1}{2}tools{2}{3}` program.
fr: '{0}' est introuvable. Installez le package Android SDK Build-Tools avec le programme '{1}{2}Tools{2}{3}'.
tr: `{0}` bulunamıyor. Lütfen `{1}{2}tools{2}{3}` programıyla Android SDK Build-Tools paketini yükleyin.
zh_hant: 找不到 `{0}`。請使用 `{1}{2}tools{2}{3}` 程式安裝 Android SDK Build-Tools 套件。

# XA5205_Lint
source: Cannot find `{0}` in the Android SDK. Please set its path via /p:LintToolPath.
fr: '{0}' est introuvable dans le kit Android SDK. Définissez son chemin avec /p:LintToolPath.
tr: Android SDK'sında `{0}` bulunamıyor. Lütfen yolunu /p:LintToolPath ile ayarlayın.
zh_hant: 在 Android SDK 中找不到 '{0}'。請透過 /p:LintToolPath 設定其路徑。

# XA5207
source: Could not find android.jar for API level {0}. This means the Android SDK platform for API level {0} is not installed; it was expected to be in `{1}`. {2} See https://aka.ms/xa5207 for more details.
fr: Android.jar introuvable pour le niveau d’API {0}. Cela signifie que la plateforme Android SDK pour le niveau d’API {0} n’est pas installée ; il était attendu dans «{1}». {2} Pour plus d’informations, consultez https://aka.ms/xa5207.
tr: {0} API düzeyi için android.jar bulunamadı . Bu, {0} API düzeyi için Android SDK platformunun kurulu olmadığı anlamına gelir; `{1}`de olması bekleniyordu. {2} Daha fazla ayrıntı için https://aka.ms/xa5207 adresine bakın.
zh_hant: 找不到 API 層級 {0} 的 android.jar。這表示未安裝 API 層級的 Android SDK {0}; 該平台應位於 `{1}` 中。 {2} 如需詳細資料，請參閱 https://aka.ms/xa5207。

# XA5207_SDK_Manager_Windows
source: Either install it in the Android SDK Manager (Tools > Android > Android SDK Manager...), or change the .NET for Android project to target an API version that is installed.
fr: Installez-le dans le Gestionnaire SDK Android (Outils > Android > Gestionnaire SDK Android...), ou modifiez le projet .NET pour Android pour cibler une version d’API installée.
tr: Bunu Android SDK Yöneticisi'ne yükleyin (Araçlar > Android > Android SDK Yöneticisi...) veya Android için .NET projesini, yüklü bir API sürümünü hedefleyecek şekilde değiştirin.
zh_hant: 請將其安裝在 Android SDK 管理員中 (工具 > Android > Android SDK 管理員...)，或將 適用於 Android 專案的 .NET 變更為以已安裝的 API 版本為目標。

# XA5207_SDK_Manager_CLI
source: You can install the missing API level by running `dotnet build -t:InstallAndroidDependencies -f {0} "-p:AndroidSdkDirectory={1}"`, or change the project to target an API version that is installed.
fr: Vous pouvez installer le niveau d’API manquant en exécutant « dotnet build -t :InstallAndroidDependencies -f {0} « -p :AndroidSdkDirectory={1}« », ou modifiez le projet pour cibler une version d’API installée.
tr: Eksik API düzeyini `dotnet build -t:InstallAndroidDependegency -f {0} "-p:AndroidSdkDirectory={1}"` komutunu çalıştırarak yükleyebilir veya yüklü olan bir API sürümünü hedefleyecek şekilde projeyi değiştirebilirsiniz.
zh_hant: 您可以執行 `dotnet build -t:InstallAndroidDependencies -f {0} "-p:AndroidSdkDirectory={1}"` 來安裝遺失的 API 層級，或將專案變更為針對已安裝的 API 版本為目標。

# XA5211
source: Embedded Wear app package name differs from handheld app package name ({0} != {1}).
fr: Le nom du package d'application Wear embarqué diffère du nom du package d'application du terminal portable ({0} != {1}).
tr: Eklenmiş Wear uygulama paketi adı, el bilgisayarı uygulama paketi adından farklı ({0} != {1}).
zh_hant: 內嵌 Wear 應用程式套件名稱與手持功能應用程式套件名稱不同 ({0} != {1})。

# XA5213
source: java.lang.OutOfMemoryError. Consider increasing the value of $(JavaMaximumHeapSize). Java ran out of memory while executing '{0} {1}'
fr: java.lang.OutOfMemoryError. Augmentez la valeur de $(JavaMaximumHeapSize). Mémoire insuffisante pour Java durant l'exécution de '{0} {1}'
tr: java.lang.OutOfMemoryError. $(JavaMaximumHeapSize) değerini artırmayı deneyin. '{0} {1}' yürütülürken Java'da yeterli bellek kalmadı
zh_hant: java.lang.OutOfMemoryError。請考慮提高 $(JavaMaximumHeapSize) 的值。執行 '{0} {1}' 時，Java 記憶體不足

# XA5300_Android_Platforms
source: No Android platforms installed at '{0}'. Please install an SDK Platform with the `{1}{2}tools{2}{3}` program.
fr: Aucune plateforme Android installée dans '{0}'. Installez une SDK Platform avec le programme '{1}{2}Tools{2}{3}'.
tr: '{0}' konumunda yüklü Android platformu yok. Lütfen `{1}{2}tools{2}{3}` programıyla bir SDK Platform yükleyin.
zh_hant: '{0}' 中未安裝任何 Android 平台。請使用 `{1}{2}tools{2}{3}` 程式安裝 SDK Platform。

# XA5300_Android_SDK
source: The Android SDK directory could not be found. Install the Android SDK by following the instructions at: https://aka.ms/dotnet-android-install-sdk To use a custom SDK path for a command line build, set the 'AndroidSdkDirectory' MSBuild property to the custom path.
fr: Le répertoire Android SDK est introuvable. Installez le Android SDK en suivant les instructions fournies à l’adresse suivante : https://aka.ms/dotnet-android-install-sdk Pour utiliser un chemin d’accès SDK personnalisé pour une build de ligne de commande, définissez la propriété MSBuild « AndroidSdkDirectory » sur le chemin personnalisé.
tr: Android SDK dizini bulunamadı. https://aka.ms/dotnet-android-install-sdk adresindeki yönergeleri izleyerek Android SDK’yi yükleyin. Bir komut satırı derlemesi için özel bir SDK yolu kullanmak için 'AndroidSdkDirectory' MSBuild özelliğini özel yola ayarlayın.
zh_hant: 找不到 Android SDK 目錄。請遵循下列指示安裝 Android SDK: https://aka.ms/dotnet-android-install-sdk 若要在命令列組建中使用自訂 SDK 路徑，請將 'AndroidSdkDirectory' MSBuild 屬性設定為自訂路徑。

# XA5300_Java_SDK
source: The Java SDK directory could not be found. Install the Java SDK by following the instructions at: https://aka.ms/dotnet-android-install-sdk To use a custom JDK path for a command line build, set the 'JavaSdkDirectory' MSBuild property to the custom path.
fr: Le répertoire du Kit de développement logiciel (SDK) Java est introuvable. Installez le Kit de développement logiciel (SDK) Java en suivant les instructions fournies dans : https://aka.ms/dotnet-android-install-sdk Pour utiliser un chemin JDK personnalisé pour une build de ligne de commande, définissez la propriété MSBuild « JavaSdkDirectory » sur le chemin personnalisé.
tr: Java SDK dizini bulunamadı. https://aka.ms/dotnet-android-install-sdk adresindeki yönergeleri izleyerek Java SDK’yi yükleyin. Bir komut satırı derlemesi için özel bir SDK yolu kullanmak için 'JavaSdkDirectory' MSBuild özelliğini özel yola ayarlayın.
zh_hant: 找不到 JAVA SDK 目錄。請遵循下列指示安裝 JAVA SDK: https://aka.ms/dotnet-android-install-sdk 若要在命令列組建中使用自訂 JDK 路徑，請將 'JavaSdkDirectory' MSBuild 屬性設定為自訂路徑。

# XA5301
source: Failed to generate Java type for class: {0} due to MAX_PATH: {1}
fr: Échec de la génération du type Java pour la classe {0} en raison de MAX_PATH : {1}
tr: {0} sınıfı için MAX_PATH nedeniyle Java türü oluşturulamadı: {1}
zh_hant: 因為 MAX_PATH，所以無法為類別 {0} 產生 Java 類型: {1}

# XA5302
source: Two processes may be building this project at once. Lock file exists at path: {0}
fr: Deux processus génèrent peut-être ce projet en même temps. Il existe un fichier de verrouillage dans le chemin suivant : {0}
tr: Bu proje aynı anda iki işlemde derleniyor olabilir. Yolda kilit dosyası var: {0}
zh_hant: 可能有兩個處理序正在同時建置此專案。鎖定檔案存在於下列路徑: {0}

# XA_Manifest_AutoGenerated_Header
source: This code was generated by a tool. It was generated from {0} Changes to this file may cause incorrect behavior and will be lost if the contents are regenerated.
fr: Ce code a été généré par un outil. Il a été généré à partir de {0} Les changements apportés à ce fichier peuvent provoquer un comportement incorrect et seront perdus si le contenu est regénéré.
tr: Bu kod, bir araç tarafından oluşturuldu. {0} dosyasından oluşturuldu Bu dosyada yapılan değişiklikler, içerik yeniden oluşturulursa yanlış davranışlara yol açabilir ve kaybolabilir.
zh_hant: 這段程式碼已由工具產生。 其從 {0} 所產生 變更此檔案可能會導致不正確的行為，而且如果重新產生內容， 變更將會遺失。

# XA4233
source: The <AndroidNamespaceReplacement> for '{0}' does not specify a 'Replacement' attribute.
fr: Le <AndroidNamespaceReplacement> de '{0}' ne spécifie pas d’attribut « Replacement ».
tr: '{0}' için <AndroidNamespaceReplacement> bir 'Replacement' özniteliği belirtmiyor.
zh_hant: '{0}' 的 <AndroidNamespaceReplacement> 未指定 'Replacement' 屬性。

# XA_Directory_Is_From
source: Directory '{0}' is from '{1}'.
fr: Le '{0}' d’annuaire provient de '{1}'.
tr: '{0}' dizininin kaynağı '{1}'.
zh_hant: 目錄 '{0}' 是來自 '{1}'。

# XA8000
source: Could not find Android Resource '{0}'. Please update @(AndroidResource) to add the missing resource.
fr: Ressource Android '{0}' introuvable. Mettez à jour @(AndroidResource) pour ajouter la ressource manquante.
tr: '{0}' Android Kaynağı bulunamadı. Lütfen eksik kaynağı eklemek için @(AndroidResource) kaynağını güncelleştirin.
zh_hant: 找不到 Android 資源'{0}'。請更新 @(AndroidResource) 以新增缺少的資源。

# XA4234
source: '<{0}>' item '{1}' is missing required attribute '{2}'.
fr: « <{0}> » l’élément « {1} » n’a pas l’attribut requis « {2} ».
tr: '<{0}>', '{1} öğesinde gereken '{2}' özniteliği eksik.
zh_hant: '<{0}>' 項目 '{1}' 缺少必要屬性 '{2}'。

# XA4235
source: Maven artifact specification '{0}' is invalid. The correct format is 'group_id:artifact_id'.
fr: La spécification d’artefact Maven '{0}' n’est pas valide. Le format correct est « group_id :artifact_id ».
tr: Maven yapıt belirtimi '{0}' geçersiz. Doğru biçim: 'group_id:artifact_id'.
zh_hant: Maven 成品規格 '{0}' 無效。正確格式為 'group_id:artifact_id'。

# XA4236
source: Cannot download Maven artifact '{0}:{1}'. - {2}: {3} - {4}: {5}
fr: Impossible de télécharger l’artefact Maven '{0}:{1}'. - {2}: {3} - {4}: {5}
tr: '{0}:{1}' Maven yapıtı indirilemiyor. - {2}: {3} - {4}: {5}
zh_hant: 無法下載 Maven 成品 '{0}:{1}'。 - {2}: {3} - {4}: {5}

# XA4237
source: Cannot download POM file for Maven artifact '{0}'. - {1}
fr: Impossible de télécharger le fichier POM pour l’artefact Maven « {0} ». - {1}
tr: '{0}' Maven yapıtı için POM dosyası indirilemiyor. - {1}
zh_hant: 無法下載 Maven 成品 '{0}' 的 POM 檔案。 - {1}

# XA4239
source: Unknown Maven repository: '{0}'.
fr: Référentiel Maven inconnu : '{0}'.
tr: Bilinmeyen Maven deposu: '{0}'.
zh_hant: 未知的 Maven 存放庫: '{0}'。

# XA1037
source: The '{0}' MSBuild property is deprecated and will be removed in .NET {1}. See https://aka.ms/net-android-deprecations for more details.
fr: La propriété MSBuild « {0} » est déconseillée et sera supprimée dans .NET {1}. Pour plus d’informations, consultez https://aka.ms/net-android-deprecations.
tr: Bu '{0}' MSBuild özelliği kullanım dışı bırakıldı ve .NET’ten kaldırılacak {1}. Daha fazla ayrıntı için bkz. https://aka.ms/net-android-deprecations için ayrıntılara bakın.
zh_hant: 已取代 '{0}' MSBuild 屬性，並將在 .NET {1} 中移除。如需更多詳細資料，請參閲 https://aka.ms/net-android-deprecations。

# XA1039
source: The Android Support libraries are not supported in .NET 9 and later, please migrate to AndroidX. See https://aka.ms/net-android/androidx for more details.
fr: Les bibliothèques Android Support ne sont pas prises en charge dans .NET 9 et les versions ultérieures. Veuillez migrer vers AndroidX. Pour en savoir plus, consultez https://aka.ms/net-android/androidx.
tr: Android Support kitaplıkları .NET 9 ve sonraki sürümlerde desteklenmiyor, lütfen AndroidX'e geçin. Daha fazla ayrıntı için bkz. https://aka.ms/net-android/androidx.
zh_hant: .NET 9 及更新版本不支援 Android 支援程式庫，請移轉至 AndroidX。如需詳細資料，請參閲 https://aka.ms/net-android/androidx。

# XA4241
source: Java dependency '{0}' is not satisfied.
fr: La dépendance Java « {0} » n’est pas satisfaite.
tr: '{0}' Java bağımlılığı karşılanmadı.
zh_hant: 無法滿足 JAVA 相依性 '{0}'。

# XA4242
source: Java dependency '{0}' is not satisfied. Microsoft maintains the NuGet package '{1}' that could fulfill this dependency.
fr: La dépendance Java « {0} » n’est pas satisfaite. Microsoft gère le package NuGet « {1} » qui pourrait satisfaire cette dépendance.
tr: '{0}' Java bağımlılığı karşılanmadı. Microsoft, bu bağımlılığı karşılayan '{1}' NuGet paketini korur.
zh_hant: 無法滿足 JAVA 相依性 '{0}'。Microsoft 會維護可以滿足此相依性的 NuGet 套件 '{1}'。

# XA4243
source: Attribute '{0}' is required when using '{1}' for '{2}' item '{3}'.
fr: Un attribut « {0} » est requis lors de l’utilisation de « {1} » pour l’élément « {2} » « {3} ».
tr: '{0}' özniteliği '{2}', '{3}' öğesi için '{1}' kullanılırken gereklidir.
zh_hant: 為 '{2}' 項目 '{3}' 使用 '{1}' 時，需要屬性 '{0}'。

# XA4244
source: Attribute '{0}' cannot be empty for '{1}' item '{2}'.
fr: L’attribut « {0} » ne peut pas être vide pour « {1} », élément « {2} ».
tr: '{0}' özniteliği '{1}', '{2}' öğesi için boş olamaz.
zh_hant: '{1}' 項目 '{2}' 的屬性 '{0}' 不能空白。

# XA4245
source: Specified POM file '{0}' does not exist.
fr: Le fichier POM « {0} » spécifié n’existe pas.
tr: Belirtilen '{0}' POM dosyası yok.
zh_hant: 指定的 POM 檔案 '{0}' 不存在。

# XA4246
source: Could not parse POM file '{0}'. - {1}
fr: Impossible d’analyser le fichier POM « {0} ». - {1}
tr: '{0}' POM dosyası ayrıştırılamadı. - {1}
zh_hant: 無法剖析 POM 檔案 '{0}'。 - {1}

# XA4247
source: Could not resolve POM file for artifact '{0}'.
fr: Impossible de résoudre le fichier POM pour l'artefact « {0} ».
tr: '{0}' yapıt kimliği için POM dosyası çözümlenemedi.
zh_hant: 無法解析成品 '{0}' 的 POM 檔案。

# XA4248
source: Could not find NuGet package '{0}' version '{1}' in lock file. Ensure NuGet Restore has run since this <PackageReference> was added.
fr: Package NuGet « {0} » version « {1} » introuvable dans le fichier de verrouillage. Vérifiez que la restauration NuGet s’est exécutée depuis l’ajout de ce <PackageReference>.
tr: '{0}' NuGet paketi '{1}' sürümü kilit dosyasında bulunamadı. Bu <PackageReference> eklendikten sonra NuGet Geri Yükleme'nin çalıştırıldığından emin olun.
zh_hant: 在鎖定檔案中找不到 NuGet 套件 '{0}' 版本 '{1}'。請確認自新增此 <PackageReference> 後，已執行 NuGet 還原。

# XA0141
source: NuGet package '{0}' version '{1}' contains a shared library '{2}' which is not correctly aligned. See https://developer.android.com/guide/practices/page-sizes for more details
fr: Le paquet NuGet « {0} » version « {1} » contient une bibliothèque partagée « {2} » qui n'est pas correctement alignée. Pour plus d’informations, consultez https://developer.android.com/guide/practices/page-sizes
tr: '{0}' NuGet paketi '{1}' sürümü düzgün uyumlanmamış '{2}' paylaşılan kitaplığını içeriyor. Daha fazla ayrıntı için https://developer.android.com/guide/practices/page-sizes sayfasına bakın
zh_hant: NuGet 套件 '{0}' 版本 '{1}' 包含未正確對齊的共用程式庫 '{2}'。如需更多詳細資料，請參閱 https://developer.android.com/guide/practices/page-sizes
