Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/Resources.*.resx
Languages: fr, tr, zh_hant

# AAPTManifestError
source: {0}. This error is likely caused by an issue with the AndroidManifest.xml file or an Android manifest generation attribute in a source code file.
fr: {0}. Cette erreur est probablement due à un problème avec le fichier AndroidManifest.xml ou à un attribut de génération de manifeste Android dans un fichier de code source.
tr: {0}. Bu hata, büyük olasılıkla AndroidManifest.xml dosyasında veya kaynak kod dosyasındaki Android bildirim oluşturma özniteliğinde karşılaşılan bir sorundan kaynaklanıyor.
zh_hant: {0}。 發生此錯誤的原因，可能是因為原始程式碼檔中的 AndroidManifest.xml 檔案或 Android 資訊清單產生屬性所導致。

# APT0001
source: Unknown option `{0}`. Please check `$(AndroidAapt2CompileExtraArgs)` and `$(AndroidAapt2LinkExtraArgs)` to see if they include any `aapt` command line arguments that are no longer valid for `aapt2` and ensure that all other arguments are valid for `aapt2`.
fr: Option '{0}' inconnue. Examinez '$(AndroidAapt2CompileExtraArgs)' et '$(AndroidAapt2LinkExtraArgs)' pour voir s'ils comportent des arguments de ligne de commande 'aapt' qui ne sont plus valides pour 'aapt2', et pour vérifier si tous les autres arguments sont valides pour 'aapt2'.
tr: `{0}` seçeneği bilinmiyor. `aapt2` için artık geçerli olmayan `aapt` komut satırı bağımsız değişkenlerini içerip içermediklerini görmek ve diğer tüm bağımsız değişkenlerin `aapt2` için geçerli olduğundan emin olmak için lütfen `$(AndroidAapt2CompileExtraArgs)` ve `$(AndroidAapt2LinkExtraArgs)` özelliklerini denetleyin.
zh_hant: 未知的選項 `{0}`。請檢查 `$(AndroidAapt2CompileExtraArgs)` 與 `$(AndroidAapt2LinkExtraArgs)`，確認其是否包含任何對 `aapt2` 不再有效的 `aapt` 命令列引數，並確定所有其他引數對 `aapt2` 皆有效。

# APT0002
source: Invalid file name: It must contain only {0}.
fr: Nom de fichier non valide : il doit contenir uniquement {0}.
tr: Dosya adı geçersiz: Yalnızca {0} içermesi gerekir.
zh_hant: 檔案名稱無效: 其只能包含 {0}。

# APT0003
source: Invalid file name: It must contain only {0}.
fr: Nom de fichier non valide : il doit contenir uniquement {0}.
tr: Dosya adı geçersiz: Yalnızca {0} içermesi gerekir.
zh_hant: 檔案名稱無效: 其只能包含 {0}。

# APT0004
source: Invalid file name: It must start with A-z or a-z or an underscore.
fr: Nom de fichier non valide : il doit commencer par A-z, a-z ou un trait de soulignement.
tr: Geçersiz dosya adı: A-z ya da a-z veya alt çizgi ile başlamalıdır.
zh_hant: 無效檔案名稱: 必須以 A-z、a-z 或底線開頭。

# XA0000_API_for_TargetFrameworkVersion
source: Could not determine API level for $(TargetFrameworkVersion) of '{0}'.
fr: Impossible de déterminer le niveau d'API pour $(TargetFrameworkVersion) '{0}'.
tr: '{0}' değerine sahip $(TargetFrameworkVersion) için API düzeyi belirlenemedi.
zh_hant: 無法判斷 '{0}' 的 $(TargetFrameworkVersion) API 層級。

# XA0000_API_or_TargetFrameworkVersion_Fail
source: Could not determine $(AndroidApiLevel) or $(TargetFrameworkVersion); should not be reached.
fr: Impossible de déterminer $(AndroidApiLevel) ou $(TargetFrameworkVersion) ; erreur inattendue.
tr: $(AndroidApiLevel) veya $(TargetFrameworkVersion) belirlenemedi. Ulaşılmamalıdır.
zh_hant: 無法判斷 $(AndroidApiLevel) 或 $(TargetFrameworkVersion); 不應送達。

# XA0000_Exception
source: Unhandled exception: {0}
fr: Exception non prise en charge : {0}
tr: İşlenmeyen özel durum: {0}
zh_hant: 未處理的例外狀況: {0}

# XA0000_TargetFrameworkVersion_for_API
source: Could not determine $(TargetFrameworkVersion) for API level '{0}.'
fr: Impossible de déterminer $(TargetFrameworkVersion) pour le niveau d'API '{0}'.
tr: API düzeyi '{0}' için $(TargetFrameworkVersion) belirlenemedi.
zh_hant: 無法判斷 API 層級 '{0}' 的 $(TargetFrameworkVersion)。

# XA0001
source: Unsupported or invalid $(TargetFrameworkVersion) value of '{0}'. Please update your Project Options.
fr: Valeur '{0}' non prise en charge ou non valide pour $(TargetFrameworkVersion). Mettez à jour les options du projet.
tr: '{0}' $(TargetFrameworkVersion) değeri desteklenmiyor veya geçersiz. Lütfen Proje Seçeneklerinizi güncelleştirin.
zh_hant: $(TargetFrameworkVersion) 值 '{0}' 不受支援或無效。請更新您的專案選項。

# XA0002
source: Could not find mono.android.jar
fr: Fichier mono.android.jar introuvable
tr: mono.android.jar bulunamadı
zh_hant: 找不到 mono.android.jar

# XA0003
source: Invalid `android:versionCode` value `{0}` in `AndroidManifest.xml`. It must be an integer value.
fr: Valeur '{0}' de 'android:versionCode' non valide dans 'AndroidManifest.xml'. Il doit s'agir d'une valeur entière.
tr: `AndroidManifest.xml` içindeki `android:versionCode` `{0}` değeri geçersiz. Değer bir tamsayı olmalıdır.
zh_hant: `AndroidManifest.xml` 中的 `android:versionCode` 值 `{0}` 無效。其必須為整數值。

# XA0004
source: Invalid `android:versionCode` value `{0}` in `AndroidManifest.xml`. The value must be in the range of 0 to {1}.
fr: Valeur '{0}' de 'android:versionCode' non valide dans 'AndroidManifest.xml'. La valeur doit être comprise entre 0 et {1}.
tr: `AndroidManifest.xml` içindeki `android:versionCode` `{0}` değeri geçersiz. Değer, 0 - {1} aralığında olmalıdır.
zh_hant: `AndroidManifest.xml` 中的 `android:versionCode` 值 `{0}` 無效。該值必須介於 0 到 {1} 之間。

# XA0030
source: Building with JDK version `{0}` is not supported. Please install JDK version `{1}`. See https://aka.ms/xamarin/jdk9-errors
fr: La génération avec la version '{0}' du kit JDK n'est pas prise en charge. Installez le kit JDK version '{1}'. Consultez https://aka.ms/xamarin/jdk9-errors
tr: JDK `{0}` sürümü ile derleme desteklenmiyor. Lütfen JDK `{1}` sürümünü yükleyin. Bkz. https://aka.ms/xamarin/jdk9-errors
zh_hant: 不支援使用 JDK 版本 `{0}` 建置。請安裝 JDK 版本 `{1}`。請參閱 https://aka.ms/xamarin/jdk9-errors

# XA0031
source: Java SDK {0} or above is required when using {1}. Download the latest JDK at: https://aka.ms/msopenjdk Note: the Android Designer is incompatible with Java SDK 11.0: https://aka.ms/vs2019-and-jdk-11
fr: Le Kit de développement logiciel (SDK) Java {0} ou une version ultérieure est requis lors de l’utilisation de {1}. Téléchargez le dernier JDK à l’adresse : https://aka.ms/msopenjdk Remarque : le Android Designer est incompatible avec le Kit de développement logiciel (SDK) Java 11.0 : https://aka.ms/vs2019-and-jdk-11
tr: {1} kullanılırken Java SDK {0} veya üzeri gerekir. En son JDK'yi şu konumdan indirin: https://aka.ms/msopenjdk Not: Android Designer, Java SDK 11.0 ile uyumsuzdur: https://aka.ms/vs2019-and-jdk-11
zh_hant: 使用 {1} 時需要 JAVA SDK {0} 或更新版本。 於下列位置下載最新的 JDK: https://aka.ms/msopenjdk 注意: Android Designer 與 JAVA SDK 11.0 不相容: https://aka.ms/vs2019-and-jdk-11

# XA0031_NET
source: Java SDK {0} or above is required when using .NET 6 or higher. Download the latest JDK at: https://aka.ms/msopenjdk
fr: Le Kit de développement logiciel (SDK) Java {0} ou une version ultérieure est requis lors de l’utilisation de .NET 6 ou d’une version ultérieure. Téléchargez le dernier JDK à l’adresse : https://aka.ms/msopenjdk.
tr: .NET 6 veya üzeri kullanılırken Java SDK {0} veya üzeri gerekir. En son JDK'yi şuradan indirin: https://aka.ms/msopenjdk
zh_hant: 使用 .NET 6 或更新版本時，需要 JAVA SDK {0} 或更新版本。於下列位置下載最新版 JDK: https://aka.ms/msopenjdk

# XA0032
source: Java SDK {0} or above is required when using Android SDK Build-Tools {1}.
fr: Le kit Java SDK {0} ou une version ultérieure est obligatoire pour l'utilisation de Android SDK Build-Tools {1}.
tr: Android SDK Derleme Araçları {1} kullanılırken Java SDK {0} veya üzeri bir sürüm gerekir.
zh_hant: 使用 Android SDK Build-Tools {1} 時，需要 Java SDK {0} 或更高版本。

# XA0033
source: Failed to get the Java SDK version because the returned value does not appear to contain a valid version number. `{0} -version` returned: ```{1}```
fr: Échec de l'obtention de la version du Kit Java SDK, car la valeur retournée ne semble pas contenir de numéro de version valide. `{0} -version` a retourné : ```{1}```
tr: Döndürülen değer geçerli bir sürüm numarası içermediğinden Java SDK sürümü alınamadı. `{0} -version` şunu döndürdü: ```{1}```
zh_hant: 因為傳回的值似乎未包含有效的版本號碼，所以無法取得 Java SDK 版本。`{0} -version` 傳回了: ```{1}```

# XA0034
source: Failed to get the Java SDK version. Please ensure you have Java {0} or above installed.
fr: Échec de l'obtention de la version du Kit Java SDK. Vérifiez que Java {0} (ou une version ultérieure) est installé.
tr: Java SDK sürümü alınamadı. Lütfen Java {0} veya üzeri bir sürümün yüklü olduğundan emin olun.
zh_hant: 無法取得 Java SDK 版本。請確認您已安裝 Java {0} 或更新版本。

# XA0035
source: Unable to determine the Android ABI from the value '{0}'. Edit the project file in a text editor and set the 'RuntimeIdentifiers' MSBuild property to contain only valid identifiers for the Android platform.
fr: Impossible de déterminer l'ABI Android à partir de la valeur '{0}'. Modifiez le fichier projet dans un éditeur de texte, puis définissez la propriété MSBuild 'RuntimeIdentifiers' afin qu'elle contienne uniquement des identificateurs valides pour la plateforme Android.
tr: Android ABI'si, '{0}' değerinden belirlenemiyor. Proje dosyasını bir metin düzenleyicisinde düzenleyin ve 'RuntimeIdentifiers' MSBuild özelliğini yalnızca Android platformu için geçerli tanımlayıcıları içerecek şekilde ayarlayın.
zh_hant: 無法從值 '{0}' 判斷 Android ABI。請在文字編輯器中編輯專案檔，並將 'RuntimeIdentifiers' MSBuild 屬性設定為只包含對 Android 平台有效的識別碼。

# XA0036
source: The 'AndroidSupportedAbis' MSBuild property is no longer supported. Edit the project file in a text editor, remove any uses of 'AndroidSupportedAbis', and use the 'RuntimeIdentifiers' MSBuild property instead.
fr: La propriété MSBuild 'AndroidSupportedAbis' n'est plus prise en charge. Modifiez le fichier projet dans un éditeur de texte, supprimez les utilisations de 'AndroidSupportedAbis', et utilisez à la place la propriété MSBuild 'RuntimeIdentifiers'.
tr: 'AndroidSupportedAbis' MSBuild özelliği artık desteklenmiyor. Proje dosyasını bir metin düzenleyicisinde düzenleyin, tüm 'AndroidSupportedAbis' kullanımlarını kaldırın ve bunun yerine 'RuntimeIdentifiers' MSBuild özelliğini kullanın.
zh_hant: 已不再支援 'AndroidSupportedAbis' MSBuild 屬性。請在文字編輯器中編輯專案檔、移除使用的任何 'AndroidSupportedAbis'，並改為使用 'RuntimeIdentifiers' MSBuild 屬性。

# XA0100
source: EmbeddedNativeLibrary '{0}' is invalid in Android Application projects. Please use AndroidNativeLibrary instead.
fr: EmbeddedNativeLibrary '{0}' est non valide dans les projets d'application Android. Utilisez AndroidNativeLibrary à la place.
tr: Android Uygulama projelerinde '{0}' EmbeddedNativeLibrary geçersiz. Lütfen bunun yerine AndroidNativeLibrary kullanın.
zh_hant: EmbeddedNativeLibrary '{0}' 在 Android 應用程式專案中無效。請改用 AndroidNativeLibrary。

# XA0104
source: Invalid value for `$(AndroidSequencePointsMode)`: {0}
fr: Valeur non valide pour '$(AndroidSequencePointsMode)' : {0}
tr: `$(AndroidSequencePointsMode)` için geçersiz değer: {0}
zh_hant: `$(AndroidSequencePointsMode)` 的值無效: {0}

# XA0105
source: The $(TargetFrameworkVersion) for {0} ({1}) is greater than the $(TargetFrameworkVersion) for the application project ({2}). Please increase the $(TargetFrameworkVersion) for the application project.
fr: Le $(TargetFrameworkVersion) de {0} ({1}) est supérieur au $(TargetFrameworkVersion) du projet d'application ({2}). Augmentez le $(TargetFrameworkVersion) du projet d'application.
tr: {0} ({1}) için $(TargetFrameworkVersion), uygulama projesinin ({2}) $(TargetFrameworkVersion) değerinden daha büyük. Lütfen uygulama projesi için $(TargetFrameworkVersion) değerini artırın.
zh_hant: {0} ({1}) 的 $(TargetFrameworkVersion) 大於應用程式專案 ({2}) 的 $(TargetFrameworkVersion)。請提高應用程式專案的 $(TargetFrameworkVersion)。

# XA0107
source: {0} is a Reference Assembly.
fr: {0} est un assembly de référence.
tr: {0} bir Başvuru Bütünleştirilmiş Kodudur.
zh_hant: {0} 為參考組件。

# XA0107_Ignoring
source: Ignoring Reference Assembly `{0}`.
fr: L'assembly de référence '{0}' est ignoré.
tr: `{0}` Başvuru Bütünleştirilmiş Kodu yoksayılıyor.
zh_hant: 正在忽略參考組件 `{0}`。

# XA0108
source: Could not get version from '{0}'. Defaulting to 1.0
fr: Impossible d'obtenir la version de '{0}'. Affectation par défaut de la valeur 1.0
tr: '{0}' aracından sürüm alınamadı. 1.0 varsayılan olarak ayarlanıyor
zh_hant: 無法從 '{0}' 取得版本。預設為 1.0

# XA0111
source: Unsupported version of AAPT2 found at path '{0}'. Open the project file in a text editor and remove the 'Aapt2ToolPath' MSBuild property or ensure it is set to a valid location.
fr: Version d'AAPT2 non prise en charge sur le chemin '{0}'. Ouvrez le fichier projet dans un éditeur de texte et supprimez la propriété MSBuild 'Aapt2ToolPath', ou vérifiez qu'elle est définie sur un emplacement valide.
tr: '{0}' yolunda desteklenmeyen AAPT2 sürümü bulundu. Proje dosyasını bir metin düzenleyicisinde açıp 'Aapt2ToolPath' MSBuild özelliğini kaldırın veya özelliğin geçerli bir konuma ayarlandığından emin olun.
zh_hant: 在路徑 '{0}' 找到不支援的 AAPT2 版本。請在文字編輯器中開啟專案檔，並移除 'Aapt2ToolPath' MSBuild 屬性，或確定其已設定為有效的位置。

# XA0112
source: AAPT2 was not found at path '{0}'. Open the project file in a text editor and remove the 'Aapt2ToolPath' MSBuild property or ensure it is set to a valid location.
fr: AAPT2 introuvable sur le chemin '{0}'. Ouvrez le fichier projet dans un éditeur de texte et supprimez la propriété MSBuild 'Aapt2ToolPath', ou vérifiez qu'elle est définie sur un emplacement valide.
tr: AAPT2, '{0}' yolunda bulunamadı. Proje dosyasını bir metin düzenleyicisinde açıp 'Aapt2ToolPath' MSBuild özelliğini kaldırın veya özelliğin geçerli bir konuma ayarlandığından emin olun.
zh_hant: 在路徑 '{0}' 找不到 AAPT2。請在文字編輯器中開啟專案檔，並移除 'Aapt2ToolPath' MSBuild 屬性，或確定其已設定為有效的位置。

# XA0113
source: Google Play requires that new applications and updates must use a TargetFrameworkVersion of {0} (API level {1}) or above. You are currently targeting {2} (API level {3}).
fr: Google Play impose aux nouvelles applications et aux mises à jour d'utiliser le TargetFrameworkVersion version {0} (niveau d'API {1}) ou une version ultérieure. Vous ciblez {2} (niveau d'API {3}).
tr: Google Play, yeni uygulamaların ve güncelleştirmelerin {0} (API düzeyi {1}) veya üzeri bir TargetFrameworkVersion kullanmasını gerektiriyor. Şu anda hedeflediğiniz: {2} (API düzeyi {3}).
zh_hant: Google Play 要求新的應用程式與更新，必須使用版本為 {0} 或更新版的 TargetFrameworkVersion (API 層級 {1})。但您目前的目標為 {2} (API 層級 {3})。

# XA0116
source: Unable to find `EmbeddedResource` named `{0}`.
fr: 'EmbeddedResource' nommé '{0}' introuvable.
tr: `{0}` adlı `EmbeddedResource` bulunamıyor.
zh_hant: 找不到名為 `{0}` 的 `EmbeddedResource`。

# XA0117
source: The TargetFrameworkVersion {0} is deprecated. Please update it to be v5.0 or higher.
fr: Le TargetFrameworkVersion {0} est déprécié. Mettez-le à jour vers la version 5.0 ou une version ultérieure.
tr: TargetFrameworkVersion {0} kullanım dışı. Lütfen bu sürümü v5.0 veya üzeri olacak şekilde güncelleştirin.
zh_hant: TargetFrameworkVersion {0} 已淘汰。請將其更新為 v5.0 或更高版本。

# XA0118_Parse
source: Could not parse '{0}'
fr: Impossible d'analyser '{0}'
tr: '{0}' ayrıştırılamadı
zh_hant: 無法剖析 '{0}'

# XA0118_Target
source: Could not resolve `target` in lock file for '{0}'
fr: Impossible de résoudre 'target' dans le fichier de verrouillage pour '{0}'
tr: '{0}' için kilit dosyasında `target` çözümlenemedi
zh_hant: 無法解析 '{0}' 鎖定檔案中的 `target`

# XA0119_AAB
source: Using Fast Deployment and Android App Bundles at the same time is not currently supported. Use Fast Deployment for Debug configurations and Android App Bundles for Release configurations.
fr: L'utilisation simultanée du déploiement rapide et des bundles d'applications Android n'est pas prise en charge actuellement. Utilisez le déploiement rapide pour les configurations de débogage et les bundles d'applications Android pour les configurations de mise en production.
tr: Hızlı Dağıtım ve Android Uygulama Paketlerinin aynı anda kullanılması şu anda desteklenmiyor. Hata Ayıklama yapılandırmaları için Hızlı Dağıtımı, Sürüm yapılandırmaları için Android Uygulama Paketlerini kullanın.
zh_hant: 目前不支援同時使用快速部署及 Android App Bundles。請將快速部署用於偵錯組態; 將 Android App Bundles 用於發行組態。

# XA0119_AOT
source: Using fast deployment and AOT at the same time is not recommended. Use fast deployment for Debug configurations and AOT for Release configurations.
fr: Il n'est pas recommandé d'utiliser le déploiement rapide et la compilation AOT en même temps. Utilisez le déploiement rapide pour les configurations Debug et la compilation AOT pour les configurations Release.
tr: Hızlı dağıtımın ve AOT'nin aynı anda kullanılması önerilmez. Hata ayıklama yapılandırmaları için hızlı dağıtımı, Yayın yapılandırmaları için AOT'yi kullanın.
zh_hant: 不建議同時使用快速部署和 AOT。請將快速部署用於偵錯組態; 將 AOT 用於發行組態。

# XA0119_LinkMode
source: Using fast deployment and the linker at the same time is not recommended. Use fast deployment for Debug configurations and the linker for Release configurations.
fr: Il n'est pas recommandé d'utiliser le déploiement rapide et l'éditeur de liens en même temps. Utilisez le déploiement rapide pour les configurations Debug et l'éditeur de liens pour les configurations Release.
tr: Hızlı dağıtımın ve bağlayıcının aynı anda kullanılması önerilmez. Hata Ayıklama yapılandırmaları için hızlı dağıtımı, Yayın yapılandırmaları için bağlayıcıyı kullanın.
zh_hant: 不建議同時使用快速部署和連結器。請將快速部署用於偵錯組態; 將連結器用於發行組態。

# XA0119_LinkTool
source: Using fast deployment and a code shrinker at the same time is not recommended. Use fast deployment for Debug configurations and a code shrinker for Release configurations.
fr: Il n'est pas recommandé d'utiliser le déploiement rapide et un réducteur de code en même temps. Utilisez le déploiement rapide pour les configurations Debug et un réducteur de code pour les configurations Release.
tr: Hızlı dağıtımın ve kod küçültücünün aynı anda kullanılması önerilmez. Hata ayıklama yapılandırmaları için hızlı dağıtımı, Yayın yapılandırmaları için kod küçültücüyü kullanın.
zh_hant: 不建議同時使用快速部署和程式碼壓縮程式。請將快速部署用於偵錯組態; 將程式碼壓縮程式用於發行組態。

# XA0119_Interpreter
source: Disabling the interpreter; using the interpreter and AOT at the same time is not supported. Use the interpreter for hot reload support in Debug configurations and AOT for Release configurations.
fr: Désactivation de l’interpréteur; l’utilisation simultanée de l’interpréteur et d’AOT n’est pas prise en charge. Utilisez l’interpréteur pour la prise en charge du rechargement à chaud dans les configurations de débogage et AOT pour les configurations de mise en production.
tr: Yorumlayıcı devre dışı bırakılıyor. Yorumlayıcıyı ve AOT'yi aynı anda kullanma desteklenmemektdir. Yorumlayıcıyı Hata Ayıklama yapılandırmalarında ve Yayınlama için AOT yapılandırmalarında yeniden yükleme desteği için kullanın.
zh_hant: 正在停用解譯器; 不支援同時使用解譯器與 AOT。使用直譯器以在 Debug 設定中取得熱重新載入支援，使用 AOT 取得 Release 設定。

# XA0121
source: Assembly '{0}' is using '[assembly: {1}]', which is no longer supported. Use a newer version of this NuGet package or notify the library author.
fr: L'assembly '{0}' utilise '[assembly : {1}]', qui n'est plus pris en charge. Utilisez une version plus récente de ce package NuGet ou notifiez l'auteur de la bibliothèque.
tr: '{0}' bütünleştirilmiş kodu artık desteklenmeyen '[assembly: {1}]' kullanıyor. Bu NuGet paketinin daha yeni bir sürümünü kullanın veya bu durumu kitaplık yazarına bildirin.
zh_hant: 組件 '{0}' 正在使用不再受到支援的 '[assembly: {1}]'。請使用此 NuGet 套件的較新版本，或通知程式庫作者。

# XA0122
source: Assembly '{0}' is using a deprecated attribute '[assembly: {1}]'. Use a newer version of this NuGet package or notify the library author.
fr: L'assembly '{0}' utilise un attribut déprécié '[assembly : {1}]'. Utilisez une version plus récente de ce package NuGet ou notifiez l'auteur de la bibliothèque.
tr: '{0}' bütünleştirilmiş kodu, kullanım dışı '[assembly: {1}]' özniteliğini kullanıyor. Bu NuGet paketinin daha yeni bir sürümünü kullanın veya bu durumu kitaplık yazarına bildirin.
zh_hant: 組件 '{0}' 正在使用已取代的屬性 '[assembly: {1}]'。請使用此 NuGet 套件的較新版本，或通知程式庫作者。

# XA0123
source: Removing {0} from {1}. Lint {2} does not support this check.
fr: Suppression de {0} dans {1}. La validation lint {2} ne prend pas en charge cette vérification.
tr: {0}, {1} özelliğinden kaldırılıyor. Lint {2} bu denetimi desteklemiyor.
zh_hant: 正在從 {1} 移除 {0}。此檢查不支援 Lint {2}。

# XA0125
source: '{0}' is using a deprecated debug information level. Set the debugging information to Portable in the Visual Studio project property pages or edit the project file in a text editor and set the 'DebugType' MSBuild property to 'portable' to use the newer, cross-platform debug information level. If this file comes from a NuGet package, update to a newer version of the NuGet package or notify the library author.
fr: '{0}' utilise un niveau d'informations de débogage déprécié. Affectez la valeur Portable aux informations de débogage dans les pages de propriétés de Visual Studio, ou modifiez le fichier projet dans un éditeur de texte, puis affectez la valeur 'portable' à la propriété MSBuild 'DebugType' pour utiliser un niveau d'informations de débogage plus récent et multiplateforme. Si ce fichier provient d'un package NuGet, effectuez une mise à jour vers une version plus récente du package NuGet, ou notifiez l'auteur de la bibliothèque.
tr: '{0}', kullanım dışı bir hata ayıklama bilgileri düzeyini kullanıyor. Hata ayıklama bilgilerini Visual Studio projesi özellik sayfalarında Taşınabilir olarak ayarlayın veya bir metin düzenleyicisinde proje dosyasını düzenleyerek daha yeni, platformlar arası hata ayıklama bilgileri düzeyini kullanmak için 'DebugType' MSBuild özelliğini 'portable' olarak ayarlayın. Bu dosya bir NuGet paketinden geliyorsa NuGet paketinin daha yeni bir sürümüne güncelleştirin veya kitaplık yazarına bildirin.
zh_hant: '{0}' 使用的是已淘汰的偵錯資訊層級。 請將 Visual Studio 專案屬性頁面中的偵錯資訊，設定為 [可攜式]，或在文字編輯器中編輯此專案檔，將 'DebugType' MSBuild 屬性設定為 [可攜式]，以使用較新的跨平台偵錯資訊層級。 如果此檔案來自 NuGet 套件，請更新為較新版本的 NuGet 套件，或通知該程式庫作者。

# XA0138
source: %(AndroidAsset.AssetPack) and %(AndroidAsset.AssetPack) item metadata are only supported when `$(AndroidApplication)` is `true`.
fr: Les métadonnées des éléments %(AndroidAsset.AssetPack) et %(AndroidAsset.AssetPack) sont uniquement prises en charge lorsque `$(AndroidApplication)` est `true`.
tr: %(AndroidAsset.AssetPack) ve %(AndroidAsset.AssetPack) öğe meta verileri yalnızca `$(AndroidApplication)` değeri `true` olduğunda desteklenir.
zh_hant: 只有在 '$(AndroidApplication)' 為 'true' 時，才支援 %(AndroidAsset.AssetPack) 與 %(AndroidAsset.AssetPack) 項目中繼資料。

# XA0139
source: `@(AndroidAsset)` `{0}` has an invalid `DeliveryType` metadata of `{1}`. Supported values are `installtime`, `ondemand` or `fastfollow`.
fr: `@(AndroidAsset)`{0}` a une métadonnée `DeliveryType` invalide de `{1}`. Les valeurs prises en charge sont `installtime`, `ondemand` ou `fastfollow`.
tr: `@(AndroidAsset)` `{0}` geçersiz `DeliveryType` `{1}` meta verisini içeriyor. Desteklenen değerler şunlardır: `installtime`, `ondemand` veya `fastfollow`.
zh_hant: '@(AndroidAsset)' '{0}' 的 'DeliveryType' 中繼資料 '{1}' 無效。支援的值為 'installtime'、'ondemand' 或 'fastfollow'。

# XA0140
source: The AssetPack value defined for `{0}` has invalid characters. `{1}` should only contain A-z, a-z, 0-9 or an underscore.
fr: La valeur AssetPack définie pour `{0}` contient des caractères non valides. `{1}` doit contenir uniquement A-z, a-z, 0-9 ou un trait de soulignement.
tr: `{0}` için tanımlanan AssetPack geçersiz karakterler içeriyor. `{1}` yalnızca A-z, a-z, 0-9 veya alt çizgi içermelidir.
zh_hant: 為 `{0}` 定義的 AssetPack 值包含無效字元。`{1}` 只能包含 A-z、a-z、0-9 或底線。

# XA1000
source: There was a problem parsing {0}. This is likely due to incomplete or invalid XML. Exception: {1}
fr: Un problème s'est produit durant l'analyse de {0}. Cela est probablement dû à du code XML incomplet ou non valide. Exception : {1}
tr: {0} ayrıştırılırken bir sorun oluştu. Bunun nedeni büyük olasılıkla tamamlanmamış veya geçersiz XML olabilir. Özel durum: {1}
zh_hant: 剖析 {0} 時發生問題。此情況可能是 XML 不完整或無效所致。例外狀況: {1}
