Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/Resources.*.resx
Languages: fr, tr, zh_hant

# XA1036
source: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}' does not match the $(SupportedOSPlatformVersion) value '{1}' in the project file (if there is no $(SupportedOSPlatformVersion) value in the project file, then a default value has been assumed). Either change the value in the AndroidManifest.xml to match the $(SupportedOSPlatformVersion) value, or remove the value in the AndroidManifest.xml (and add a $(SupportedOSPlatformVersion) value to the project file if it doesn't already exist).
fr: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}' ne correspond pas à la valeur $(SupportedOSPlatformVersion) '{1}' dans le fichier de projet (s’il n’y a pas de valeur $(SupportedOSPlatformVersion) dans le fichier de projet, une valeur par défaut a été prise). Modifiez la valeur dans AndroidManifest.xml pour qu’elle corresponde à la valeur $(SupportedOSPlatformVersion), ou supprimez la valeur dans AndroidManifest.xml (et ajoutez une valeur $(SupportedOSPlatformVersion) au fichier de projet si elle n’existe pas déjà).
tr: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}', proje dosyasındaki $(SupportedOSPlatformVersion) değeri '{1}' ile eşleşmiyor. Eğer proje dosyasında $(SupportedOSPlatformVersion) değeri yoksa bir varsayılan değer alınır. AndroidManifest.xml dosyasındaki değeri $(SupportedOSPlatformVersion) değeriyle eşleşecek şekilde değiştirin veya AndroidManifest.xml dosyasındaki değeri kaldırın ve yoksa, proje dosyasına bir $(SupportedOSPlatformVersion) değeri ekleyin.
zh_hant: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}' 與專案檔中的 $(SupportedOSPlatformVersion) 值 '{1}' 不符 (如果專案檔中沒有 $(SupportedOSPlatformVersion) 值，則假設為預設值)。 請變更 AndroidManifest.xml 中的值以符合 $(SupportedOSPlatformVersion) 值，或移除 AndroidManifest.xml 中的值 (如果該值不存在，則將 $(SupportedOSPlatformVersion) 值新增至專案檔)。

# XA2000
source: Use of AppDomain.CreateDomain() detected in assembly: {0}. .NET 6 and higher will only support a single AppDomain, so this API will no longer be available in .NET for Android once .NET 6 is released.
fr: Utilisation d’AppDomain.CreateDomain() détectée dans l’assembly : {0}. .NET 6 et versions ultérieures ne prennent en charge qu’un seul AppDomain. Cette API ne sera donc plus disponible dans .NET pour Android une fois .NET 6 publié.
tr: Derlemede AppDomain.CreateDomain() kullanımı algılandı: {0}. .NET 6 ve üzeri yalnızca tek bir AppDomain'i destekleyeceğinden, .NET 6 yayımlandıktan sonra bu API artık Android için .NET'te kullanılamayacaktır.
zh_hant: 在下列組件中偵測到使用 AppDomain.CreateDomain(): {0}。.NET 6 及更新版本只支援單一 AppDomain，因此在 .NET 6 發行之後，此 API 就無法再於 Android 版 .NET 中使用。

# XA2000_gcParams_bridgeImpl
source: Support for the 'MONO_GC_PARAMS=bridge-implementation=old' value will be removed in .NET 7.
fr: La prise en charge de la valeur 'MONO_GC_PARAMS=bridge-implementation=old' sera supprimée dans .NET 7.
tr: 'MONO_GC_PARAMS=bridge-implementation=old' değeri için destek .NET 7'de kaldırılacaktır.
zh_hant: .NET 7 中會移除 'MONO_GC_PARAMS=bridge-implementation=old' 值的支援。

# XA2001
source: Source file '{0}' could not be found.
fr: Fichier source '{0}' introuvable.
tr: '{0}' kaynak dosyası bulunamadı.
zh_hant: 找不到原始程式檔 '{0}'。

# XA2002_Framework
source: Can not resolve reference: `{0}`, referenced by {1}. Perhaps it doesn't exist in the Mono for Android profile?
fr: Impossible de résoudre la référence '{0}', référencée par {1}. Peut-être qu'elle n'existe pas dans le profil Mono pour Android ?
tr: {1} tarafından başvurulan `{0}` başvurusu çözümlenemiyor. Mono for Android profilinde bulunmuyor olabilir.
zh_hant: 無法解析參考: '{0}'，參考者: {1}。Mono for Android 設定檔中沒有該項參考嗎?

# XA2002_NuGet
source: Can not resolve reference: `{0}`, referenced by {1}. Please add a NuGet package or assembly reference for `{0}`, or remove the reference to `{2}`.
fr: Impossible de résoudre la référence '{0}', référencée par {1}. Ajoutez un paquet NuGet ou une référence d'assembly pour '{0}', ou supprimez la référence à '{2}'.
tr: {1} tarafından başvurulan `{0}` başvurusu çözümlenemiyor. Lütfen `{0}` için bir NuGet paketi veya bütünleştirilmiş kod başvurusu ekleyin ya da `{2}` başvurusunu kaldırın.
zh_hant: 無法解析參考: `{0}`，參考方為 {1}。請為 `{0}` 新增 NuGet 套件或組件參考，或移除對 `{2}` 的參考。

# XA2006
source: Could not resolve reference to '{0}' (defined in assembly '{1}') with scope '{2}'. When the scope is different from the defining assembly, it usually means that the type is forwarded.
fr: Impossible de résoudre la référence à '{0}' (définie dans l'assembly '{1}') avec l'étendue '{2}'. Quand l'étendue est différente de l'assembly de définition, cela signifie généralement que le type est transmis.
tr: '{2}' kapsamına sahip ('{1}' bütünleştirilmiş kodunda tanımlanan) '{0}' başvurusu çözümlenemedi. Kapsam, tanımlayan bütünleştirilmiş koddan farklı olduğunda, bu durum genellikle türün iletildiğini gösterir.
zh_hant: 無法解析範圍為 '{2}' 的 '{0}' 參考 (在組件 '{1}' 中定義)。當範圍與定義組件不同時，通常表示已轉寄類型。

# XA2007
source: Exception while loading assemblies: {0}
fr: Exception durant le chargement des assemblys : {0}
tr: Bütünleştirilmiş kodlar yüklenirken özel durum oluştu: {0}
zh_hant: 載入組件時發生例外狀況: {0}

# XA2008
source: In referenced assembly {0}, Java.Interop.DoNotPackageAttribute requires non-null file name.
fr: Dans l'assembly référencé {0}, Java.Interop.DoNotPackageAttribute nécessite un nom de fichier non null.
tr: Başvurulan {0} bütünleştirilmiş kodundaki Java.Interop.DoNotPackageAttribute, null olmayan dosya adı gerektiriyor.
zh_hant: 在參考的組件 {0} 中，Java.Interop.DoNotPackageAttribute 需要非 Null 的檔案名稱。

# APT2264
source: This could be caused by the project exceeding the Windows maximum path length limitation. See https://learn.microsoft.com/dotnet/android/messages/apt2264 for details.
fr: Cela peut être dû au fait que le projet dépasse la limite de longueur maximale du chemin d’accès Windows. Pour en savoir plus, consultez https://learn.microsoft.com/dotnet/android/messages/apt2264.
tr: Bunun nedeni, projenin Windows yol uzunluğu üst sınırını aşması olabilir. Ayrıntılar için bkz. https://learn.microsoft.com/dotnet/android/messages/apt2264.
zh_hant: 這可能是因為專案超過 Windows 最大路徑長度限制所造成。如需詳細資訊，請參閱 https://learn.microsoft.com/dotnet/android/messages/apt2264。

# APT2265
source: This could be caused by the project having non-ASCII characters in its filename or path. See https://learn.microsoft.com/dotnet/android/messages/apt2265 for details.
fr: Cela peut être dû au fait que le projet contient des caractères non-ASCII dans son nom de fichier ou son chemin d’accès. Pour en savoir plus, consultez https://learn.microsoft.com/dotnet/android/messages/apt2265.
tr: Bunun nedeni projenin dosya adında veya yolunda ASCII olmayan karakterler olması olabilir. Ayrıntılar için bkz. https://learn.microsoft.com/dotnet/android/messages/apt2265.
zh_hant: 這可能是因為專案的檔案名稱或路徑中包含非 ASCII 字元所造成。如需詳細資訊，請參閱 https://learn.microsoft.com/dotnet/android/messages/apt2265。

# XA3001
source: Could not AOT the assembly: {0}
fr: Impossible d'effectuer une compilation AOT de l'assembly : {0}
tr: Bütünleştirilmiş koda AOT uygulanamadı: {0}
zh_hant: 無法對組件進行 AOT 編譯: {0}

# XA3002
source: Invalid AOT mode: {0}
fr: Mode de compilation AOT non valide : {0}
tr: Geçersiz AOT modu: {0}
zh_hant: AOT 模式無效: {0}

# XA3003
source: Could not strip IL of assembly: {0}
fr: Impossible de supprimer l'IL de l'assembly : {0}
tr: Derlemenin IL'si ayrılamadı: {0}
zh_hant: 無法除去組件的 IL: {0}

# XA3004
source: Android NDK r10d is buggy and provides an incompatible x86_64 libm.so. See https://code.google.com/p/android/issues/detail?id=161422.
fr: Android NDK r10d ne fonctionne pas correctement, et fournit une bibliothèque libm.so x86_64 incompatible. Consultez https://code.google.com/p/android/issues/detail?id=161422.
tr: Android NDK r10d hatalı olduğundan uyumsuz bir x86_64 libm.so dosyası sağlıyor. Bkz. https://code.google.com/p/android/issues/detail?id=161422.
zh_hant: Android NDK r10d 有錯誤，且會提供不相容的 x86_64 libm.so。請參閱 https://code.google.com/p/android/issues/detail?id=161422。

# XA3005
source: The detected Android NDK version is incompatible with the targeted LLVM configuration. Please upgrade to NDK r10d or newer.
fr: La version du kit Android NDK détectée est incompatible avec la configuration LLVM ciblée. Effectuez une mise à niveau vers le NDK r10d ou une version ultérieure.
tr: Algılanan Android NDK sürümü, hedeflenen LLVM yapılandırmasıyla uyumsuz. Lütfen NDK r10d veya daha yeni bir sürüme yükseltin.
zh_hant: 偵測到的 Android NDK 版本與目標 LLVM 設定不相容。請升級為 NDK r10d 或更新版本。

# XA3006
source: Could not compile native assembly file: {0}{1}
fr: Impossible de compiler le fichier d'assembly natif : {0}{1}
tr: Yerel bütünleştirilmiş kod dosyası derlenemedi: {0}{1}
zh_hant: 無法編譯原生組件檔: {0}{1}

# XA3007
source: Could not link native shared library: {0}{1}
fr: Impossible de lier la bibliothèque partagée native : {0}{1}
tr: Yerel paylaşılan kitaplık bağlanamadı: {0}{1}
zh_hant: 無法連結原生共用程式庫: {0}{1}

# XA4209
source: Failed to generate Java type for class: {0} due to {1}
fr: Échec de la génération du type Java pour la classe {0} en raison de {1}
tr: {0} sınıfı için şu özel durum nedeniyle Java türü oluşturulamadı: {1}
zh_hant: 因為 {1}，所以無法為類別 {0} 產生 Java 類型

# XA4210
source: Please add a reference to Mono.Android.Export.dll when using ExportAttribute or ExportFieldAttribute.
fr: Ajoutez une référence à Mono.Android.Export.dll quand vous utilisez ExportAttribute ou ExportFieldAttribute.
tr: ExportAttribute veya ExportFieldAttribute kullanırken lütfen Mono.Android.Export.dll dosyasına bir başvuru ekleyin.
zh_hant: 使用 ExportAttribute 或 ExportFieldAttribute 時，請將參考新增至 Mono.Android.Export.dll。

# XA4211
source: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' is less than $(TargetFrameworkVersion) '{1}'. Using API-{2} for ACW compilation.
fr: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' est inférieur à $(TargetFrameworkVersion) '{1}'. Utilisation d'API-{2} pour la compilation ACW.
tr: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}', $(TargetFrameworkVersion) '{1}' değerinden küçük. ACW derlemesi için API-{2} kullanılıyor.
zh_hant: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' 小於 $(TargetFrameworkVersion) '{1}'。正在使用 API-{2} 進行 ACW 編譯。

# XA4213
source: The type '{0}' must provide a public default constructor
fr: Le type '{0}' doit fournir un constructeur public par défaut
tr: '{0}' türü, genel bir varsayılan oluşturucu sağlamalıdır
zh_hant: 類型 '{0}' 必須提供公用預設建構函式

# XA4214
source: The managed type `{0}` exists in multiple assemblies: {1}. Please refactor the managed type names in these assemblies so that they are not identical.
fr: Le type managé '{0}' existe dans plusieurs assemblys : {1}. Refactorisez les noms de types managés dans ces assemblys pour qu'ils ne soient pas identiques.
tr: `{0}` yönetilen türü birden çok derlemede var: {1}. Lütfen bu derlemelerde yönetilen tür adlarını aynı olmayacak şekilde yeniden düzenleyin.
zh_hant: 受控類型 `{0}` 存在於多個組件: {1}。請重構這些組件中的受控類型名稱，以免其重複。

# XA4214_Result
source: References to the type `{0}` will refer to `{0}, {1}`.
fr: Les références au type '{0}' vont faire référence à '{0}, {1}'.
tr: `{0}` türüne yapılan başvurular şuna başvurur: `{0}, {1}`.
zh_hant: 對類型 '{0}' 的參考將會參考 `{0}, {1}`。

# XA4215
source: The Java type `{0}` is generated by more than one managed type. Please change the [Register] attribute so that the same Java type is not emitted.
fr: Le type Java '{0}' est généré par plusieurs types managés. Changez l'attribut [Register] pour que le même type Java ne soit pas envoyé.
tr: `{0}` Java türü birden çok yönetilen tür tarafından üretiliyor. Lütfen aynı Java türünün gösterilmemesi için [Register] özniteliğini değiştirin.
zh_hant: Java 類型 `{0}` 由多種受控類型所產生。請變更 [Register] 屬性，以確保不會發出相同的 Java 類型。

# XA4215_Details
source: `{0}` generated by: {1}
fr: '{0}' généré par : {1}
tr: `{0}` türü, {1} tarafından oluşturuldu
zh_hant: `{0}` 由 {1} 所產生

# XA4216_SupportedOSPlatformVersion
source: The deployment target '{0}' is not supported (the minimum is '{1}'). Please increase the $(SupportedOSPlatformVersion) property value in your project file.
fr: La cible de déploiement '{0}' n’est pas prise en charge (la valeur minimale est '{1}'). Augmentez la valeur de propriété $(SupportedOSPlatformVersion) dans votre fichier projet.
tr: Dağıtım hedefi '{0}' desteklenmiyor (en düşük değer '{1}'. Lütfen proje dosyanızdaki $(SupportedOSPlatformVersion) özellik değerini artırın.
zh_hant: 不支援部署目標 '{0}' (最小值為 '{1}')。請增加專案檔中 $(SupportedOSPlatformVersion) 屬性值。

# XA4216_MinSdkVersion
source: The deployment target '{0}' is not supported (the minimum is '{1}'). Please increase (or remove) the //uses-sdk/@android:minSdkVersion value in your AndroidManifest.xml.
fr: La cible de déploiement '{0}' n’est pas prise en charge (la valeur minimale est '{1}'). Augmentez (ou supprimez) la valeur //uses-sdk/@android:minSdkVersion dans votre AndroidManifest.xml.
tr: Dağıtım hedefi '{0}' desteklenmiyor (en düşük değer '{1}'. Lütfen AndroidManifest.xml dosyanızdaki //uses-sdk/@android:minSdkVersion değerini artırın (veya kaldırın).
zh_hant: 不支援部署目標 '{0}' (最小值為 '{1}')。請增加 (或移除) AndroidManifest.xml中的 //uses-sdk/@android:minSdkVersion 值。

# XA4216_TargetSdkVersion
source: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' is less than API-{1}, this configuration is not supported.
fr: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' est inférieur à API-{1}, cette configuration n'est pas prise en charge.
tr: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}', API-{1} değerinden küçük, bu yapılandırma desteklenmiyor.
zh_hant: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' 小於 API-{1}，不支援此組態。

# XA4218
source: Unable to find //manifest/application/uses-library at path: {0}
fr: Impossible de localiser //manifest/application/uses-library dans le chemin : {0}
tr: Yolda //manifest/application/uses-library bulunamıyor: {0}
zh_hant: 在路徑 {0} 中找不到 //manifest/application/uses-library

# XA4219
source: Cannot find binding generator for language {0} or {1}.
fr: Impossible de trouver le générateur de liaisons pour le langage {0} ou {1}.
tr: {0} veya {1} dili için bağlama oluşturucusu bulunamıyor.
zh_hant: 找不到語言 {0} 或 {1} 的繫結產生器。

# XA4220
source: Partial class item '{0}' does not have an associated binding for layout '{1}'.
fr: L'élément de classe partiel '{0}' n'a pas de liaison associée pour la disposition '{1}'.
tr: '{0}' parçalı sınıf öğesi '{1}' düzeni için ilişkili bir bağlamaya sahip değil.
zh_hant: 有部分類別項目 '{0}' 沒有版面配置 '{1}' 相關聯的繫結。

# XA4221
source: No layout binding source files were generated.
fr: Aucun fichier source de liaison de disposition n'a été généré.
tr: Düzen bağlama kaynağı dosyası oluşturulmadı.
zh_hant: 未產生任何版面配置繫結原始程式檔。

# XA4222
source: No widgets found for layout ({0}).
fr: Aucun widget trouvé pour la disposition ({0}).
tr: Düzen ({0}) için pencere öğesi bulunamadı.
zh_hant: 找不到版面配置 ({0}) 的小工具。

# XA4223
source: Malformed full class name '{0}'. Missing namespace.
fr: Nom de classe complet incorrect : '{0}'. Espace de noms manquant.
tr: Tam sınıf adı ('{0}') hatalı biçimlendirilmiş. Ad alanı eksik.
zh_hant: 完整類別名稱 '{0}' 的格式不正確。缺少命名空間。

# XA4224
source: Malformed full class name '{0}'. Missing class name.
fr: Nom de classe complet incorrect : '{0}'. Nom de classe manquant.
tr: Tam sınıf adı ('{0}') hatalı biçimlendirilmiş. Sınıf adı eksik.
zh_hant: 完整類別名稱 '{0}' 的格式不正確。缺少類別名稱。

# XA4225
source: Widget '{0}' in layout '{1}' has multiple instances with different types. The property type will be set to: {2}
fr: Le widget '{0}' dans la disposition '{1}' a plusieurs instances avec des types différents. Le type de propriété aura la valeur suivante : {2}
tr: '{1}' düzenindeki '{0}' pencere öğesi farklı türlerde birden çok örneğe sahip. Özellik türü {2} olarak ayarlanacak
zh_hant: 版面配置 '{1}' 的小工具 '{0}' 具有多個不同類型的執行個體。此屬性類型將會設定為 {2}

# XA4226
source: Resource item '{0}' does not have the required metadata item '{1}'.
fr: L'élément de ressource '{0}' n'a pas l'élément de métadonnées obligatoire '{1}'.
tr: '{0}' kaynak öğesinde gerekli meta veri öğesi ('{1}') yok.
zh_hant: 資源項目 '{0}' 不具所需的中繼資料項目 '{1}'。

# XA4228
source: Unable to find specified //activity-alias/@android:targetActivity: '{0}'
fr: Le //activity-alias/@android:targetActivity spécifié est introuvable : '{0}'
tr: Belirtilen //activity-alias/@android:targetActivity: '{0}' bulunamadı
zh_hant: 找不到指定的 //activity-alias/@android:targetActivity: '{0}'

# XA4229
source: Unrecognized `TransformFile` root element: {0}.
fr: Élément racine 'TransformFile' non reconnu : {0}.
tr: ‘TransformFile‘ kök öğesi tanınmıyor: {0}.
zh_hant: 無法辨識的 'TransformFile' 根項目: {0}。

# XA4230
source: Error parsing XML: {0}
fr: Erreur d'analyse du code XML : {0}
tr: XML ayrıştırılırken hata oluştu: {0}
zh_hant: 剖析 XML 時發生錯誤: {0}

# XA4231
source: The Android class parser value '{0}' is deprecated and will be removed in a future version of .NET for Android. Update the project properties to use 'class-parse'.
fr: La valeur de l’analyseur de classe Android «{0}» est déconseillée et sera supprimée dans une future version de .NET pour Android. Mettez à jour les propriétés du projet pour utiliser 'class-parse'.
tr: Android sınıfı ayrıştırıcı değeri '{0}' kullanımdan kaldırıldı ve Android için .NET'in gelecekteki bir sürümünde kaldırılacak. Proje özelliklerini 'class-parse' kullanacak şekilde güncelleştirin.
zh_hant: Android 類別剖析器值 '{0}' 即將淘汰，將會從 Android 版 .NET 的後續版本中移除。請更新專案屬性，以使用 'class-parse'。

# XA4232
source: The Android code generation target '{0}' is deprecated and will be removed in a future version of .NET for Android. Update the project properties to use 'XAJavaInterop1'.
fr: La cible de génération de code Android «{0}» est déconseillée et sera supprimée dans une future version de .NET pour Android. Mettez à jour les propriétés du projet pour utiliser 'XAJavaInterop1'.
tr: Android kod oluşturma hedefi '{0}' kullanımdan kaldırıldı ve Android için .NET'in gelecekteki bir sürümünde kaldırılacak. Proje özelliklerini 'XAJavaInterop1' kullanacak şekilde güncelleştirin.
zh_hant: Android 程式碼產生目標 '{0}' 即將淘汰，將會從 Android 版 .NET 的後續版本中移除。請更新專案屬性，以使用 'XAJavaInterop1'。

# XA4300
source: Native library '{0}' will not be bundled because it has an unsupported ABI. Move this file to a directory with a valid Android ABI name such as 'libs/armeabi-v7a/'.
fr: La bibliothèque native '{0}' ne fera pas partie du bundle, car elle comporte une ABI non prise en charge. Déplacez ce fichier dans un répertoire ayant un nom d'ABI Android valide, par exemple 'libs/armeabi-v7a/'.
tr: '{0}' yerel kitaplığı, desteklenmeyen bir ABI içerdiğinden paketlenmeyecek. Bu dosyayı, as 'libs/armeabi-v7a/' gibi geçerli bir Android ABI adına sahip bir dizine taşıyın.
zh_hant: 因為原生程式庫 '{0}' 有不支援的 ABI，所以將不會隨附。請將此檔案移至具備有效 Android ABI 名稱的目錄，例如 'libs/armeabi-v7a/'。

# XA4301
source: APK already contains the item {0}; ignoring.
fr: L'APK contient déjà l'élément {0}. Ignoré.
tr: APK zaten {0} dosyasını içerdiğinden yoksayılıyor.
zh_hant: APK 已包含項目 {0}; 正在忽略。

# XA4301_ABI
source: Cannot determine ABI of native library '{0}'. Move this file to a directory with a valid Android ABI name such as 'libs/armeabi-v7a/'.
fr: Impossible de déterminer l'ABI de la bibliothèque native '{0}'. Déplacez ce fichier dans un répertoire ayant un nom d'ABI Android valide, par exemple 'libs/armeabi-v7a/'.
tr: '{0}' yerel kitaplığının ABI'si belirlenemiyor. Bu dosyayı, 'libs/armeabi-v7a/' gibi geçerli bir Android ABI adına sahip bir dizine taşıyın.
zh_hant: 無法判斷原生程式庫 '{0}' 的 ABI。請將此檔案移至具有效 Android ABI 名稱的目錄，例如 'libs/armeabi-v7a/'。

# XA4301_ABI_NuGet
source: Cannot determine ABI of native library '{0}'. Remove the '{1}' NuGet package, or notify the library author.
fr: Impossible de déterminer l'ABI de la bibliothèque native '{0}'. Supprimez le package NuGet '{1}', ou notifiez l'auteur de la bibliothèque.
tr: '{0}' yerel kitaplığının ABI'si belirlenemiyor. '{1}' NuGet paketini kaldırın veya kitaplık yazarına bildirin.
zh_hant: 無法判斷原生程式庫 '{0}' 的 ABI。請移除 '{1}' NuGet 套件，或通知程式庫作者。

# XA4301_ABI_Ignoring
source: Could not determine ABI of some native libraries. Ignoring those: {0}
fr: Impossible de déterminer l'ABI de certaines bibliothèques natives. Bibliothèques ignorées : {0}
tr: Bazı yerel kitaplıkların ABI'sı belirlenemedi. Yoksayılanlar: {0}
zh_hant: 無法判斷某些原生程式庫的 ABI。正在忽略下列項目: {0}

# XA4302
source: Unhandled exception merging `AndroidManifest.xml`: {0}
fr: Exception non prise en charge au moment de la fusion de 'AndroidManifest.xml' : {0}
tr: `AndroidManifest.xml` birleştirilirken işlenmeyen özel durum oluştu: {0}
zh_hant: 未處理的例外狀況合併 `AndroidManifest.xml`: {0}

# XA4303
source: Error extracting resources from "{0}": {1}
fr: Erreur au moment de l'extraction des ressources de "{0}" : {1}
tr: "{0}" dosyasından kaynaklar ayıklanırken hata oluştu: {1}
zh_hant: 從 "{0}" 擷取資源時發生錯誤: {1}

# XA4304
source: ProGuard configuration file '{0}' was not found.
fr: Le fichier config ProGuard '{0}' est introuvable.
tr: '{0}' ProGuard yapılandırma dosyası bulunamadı.
zh_hant: 找不到 ProGuard 組態檔 '{0}'。

# XA4305
source: Multidex is enabled, but `$(_AndroidMainDexListFile)` is empty.
fr: Multidex est activé, mais '$(_AndroidMainDexListFile)' est vide.
tr: Multidex etkin, ancak `$(_AndroidMainDexListFile)` boş.
zh_hant: 已啟用 Multidex，但 `$(_AndroidMainDexListFile)` 是空白的。

# XA4305_File_Missing
source: Multidex is enabled, but the `$(_AndroidMainDexListFile)` file '{0}' does not exist.
fr: Multidex est activé, mais le fichier '$(_AndroidMainDexListFile)' '{0}' n'existe pas.
tr: Multidex etkin, ancak '{0}' adlı `$(_AndroidMainDexListFile)` dosyası yok.
zh_hant: 已啟用 Multidex，但 `$(_AndroidMainDexListFile)` 檔案 '{0}' 不存在。

# XA4306
source: R8 does not support `@(MultiDexMainDexList)` files when android:minSdkVersion >= 21
fr: R8 ne prend pas en charge les fichiers '@(MultiDexMainDexList)' quand android:minSdkVersion >= 21
tr: android:minSdkVersion >= 21 olduğunda R8, `@(MultiDexMainDexList)` dosyalarını desteklemiyor
zh_hant: 當 android:minSdkVersion >= 21 時，R8 不支援 `@(MultiDexMainDexList)` 檔案

# XA4307
source: Invalid ProGuard configuration file. {0}
fr: Fichier config ProGuard non valide. {0}
tr: Geçersiz ProGuard yapılandırma dosyası. {0}
zh_hant: ProGuard 組態檔無效。{0}

# XA4308
source: Failed to generate type maps
fr: La génération des mappages de type a échoué
tr: Tür eşlemeleri oluşturulamadı
zh_hant: 無法產生類型對應

# XA4309
source: 'MultiDexMainDexList' file '{0}' does not exist.
fr: Le fichier 'MultiDexMainDexList' '{0}' n'existe pas.
tr: '{0}' adlı 'MultiDexMainDexList' dosyası yok.
zh_hant: 'MultiDexMainDexList' 檔案 '{0}' 不存在。

# XA4310
source: `{0}` file `{1}` could not be found.
fr: `{0}` le fichier `{1}` est introuvable.
tr: `{0}` dosyası`{1}` bulunamadı.
zh_hant: 找不到 `{0}` 檔案 `{1}`。

# XA4311
source: The application won't contain the paired Wear package because the Wear application package APK is not created yet. If building on the command line, be sure to build the "SignAndroidPackage" target.
fr: L'application ne contient pas le package Wear appairé, car le fichier APK du package d'application Wear n'est pas encore créé. Si vous effectuez la génération à partir de la ligne de commande, veillez à générer la cible "SignAndroidPackage".
tr: Wear uygulama paketi APK'sı henüz oluşturulmadığından uygulama, eşleştirilen Wear paketini içermeyecek. Komut satırında derleme yapıyorsanız, "SignAndroidPackage" hedefini derlediğinizden emin olun.
zh_hant: 因為尚未建立 Wear 應用程式套件 APK，所以該應用程式不會包含配對的 Wear 套件。如果從命令列進行建置，請務必建置 "SignAndroidPackage" 目標。
