Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/Resources.*.resx
Languages: fr, tr, zh_hant

# XA1001
source: AndroidResgen: Warning while updating resource XML '{0}': {1}
fr: AndroidResgen : avertissement durant la mise à jour du XML de ressources '{0}' : {1}
tr: AndroidResgen: '{0}' kaynak XML dosyası güncelleştirilirken uyarı oluştu: {1}
zh_hant: AndroidResgen: 更新資源 XML '{0}' 時發生警告: {1}

# XA1002
source: The closest match found for '{0}' is '{1}', but the capitalization does not match. Please correct the capitalization.
fr: La correspondance la plus proche pour '{0}' est '{1}', mais la mise en majuscules ne correspond pas. Corrigez la mise en majuscules.
tr: '{0}' için bulunan en yakın eşleşme '{1}' ancak büyük harf kullanımı eşleşmiyor. Lütfen büyük harf kullanımını düzeltin.
zh_hant: 找到與 '{0}' 最符合者為 '{1}'，但大小寫不符。請更正大小寫。

# XA1005
source: Attempting basic type name matching for element with ID '{0}' and type '{1}'
fr: Tentative de mise en correspondance du nom de type de base pour l'élément avec l'ID '{0}' et le type '{1}'
tr: Kimliği '{0}' ve türü '{1}' olan öğe için temel tür adı eşleştirmesi deneniyor
zh_hant: 正在嘗試對識別碼為 '{0}' 且類型為 '{1}' 的元素進行基本類型名稱比對

# XA1005_Instructions
source: If basic type name matching fails, please add a `xamarin:managedType` attribute to the element to specify the fully qualified managed type name of the element.
fr: En cas d'échec de la mise en correspondance du nom de type de base, ajoutez un attribut 'xamarin:managedType' à l'élément pour spécifier le nom de type managé complet de l'élément.
tr: Temel tür adı eşleştirme başarısız olursa, öğenin yönetilen tür tam adını belirtmek için öğeye bir `xamarin:managedType` özniteliği ekleyin.
zh_hant: 如果基本類型名稱比對失敗，請將 `xamarin:managedType` 屬性新增至元素，以指定該元素的完整受控類型名稱。

# XA1006
source: The TargetFrameworkVersion (Android API level {0}) is higher than the targetSdkVersion ({1}). Please increase the `android:targetSdkVersion` in the `AndroidManifest.xml` so that the API levels match.
fr: TargetFrameworkVersion (niveau d'API Android {0}) est supérieur à targetSdkVersion ({1}). Augmentez 'android:targetSdkVersion' dans 'AndroidManifest.xml' pour que les niveaux d'API correspondent.
tr: TargetFrameworkVersion (Android API düzey {0}), targetSdkVersion ({1}) değerinden daha yüksek. Lütfen API düzeylerinin eşleştiğinden emin olmak için `AndroidManifest.xml` içindeki `android:targetSdkVersion` değerini artırın.
zh_hant: TargetFrameworkVersion (Android API 層級 {0}) 高於 targetSdkVersion ({1})。請增加 `AndroidManifest.xml` 中的 `android:targetSdkVersion`，讓 API 層級一致。

# XA1007
source: The minSdkVersion ({0}) is greater than the targetSdkVersion. Please change the value such that the minSdkVersion is less than or equal to the targetSdkVersion ({1}).
fr: minSdkVersion ({0}) est supérieur à targetSdkVersion. Changez la valeur pour que minSdkVersion soit inférieur ou égal à targetSdkVersion ({1}).
tr: minSdkVersion ({0}), targetSdkVersion'dan daha büyük. Lütfen minSdkVersion değerini targetSdkVersion ({1}) değerine eşit veya daha küçük olacak şekilde değiştirin.
zh_hant: minSdkVersion ({0}) 大於 targetSdkVersion。請變更此值，讓 minSdkVersion 小於或等於 targetSdkVersion ({1})。

# XA1008
source: The TargetFrameworkVersion (Android API level {0}) is lower than the targetSdkVersion ({1}). Please increase the `$(TargetFrameworkVersion)` or decrease the `android:targetSdkVersion` in the `AndroidManifest.xml` so that the API levels match.
fr: TargetFrameworkVersion (niveau d'API Android {0}) est inférieur à targetSdkVersion ({1}). Augmentez '$(TargetFrameworkVersion)' ou diminuez 'android:targetSdkVersion' dans 'AndroidManifest.xml' pour que les niveaux d'API correspondent.
tr: TargetFrameworkVersion (Android API düzey {0}), targetSdkVersion ({1}) değerinden daha düşük. Lütfen API düzeylerinin eşleştiğinden emin olmak için `AndroidManifest.xml` içindeki `$(TargetFrameworkVersion)` değerini artırın veya `android:targetSdkVersion` değerini azaltın.
zh_hant: TargetFrameworkVersion (Android API 層級 {0}) 低於 targetSdkVersion ({1})。請增加 `$(TargetFrameworkVersion)` 或減少 `AndroidManifest.xml` 中的 `android:targetSdkVersion`，讓 API 層級一致。

# XA1010
source: Invalid `$(AndroidManifestPlaceholders)` value for Android manifest placeholders. Please use `key1=value1;key2=value2` format. The specified value was: `{0}`
fr: Valeur '$(AndroidManifestPlaceholders)' non valide pour les espaces réservés de manifeste Android. Utilisez le format 'clé1=valeur1;clé2=valeur2'. La valeur spécifiée est : '{0}'
tr: Android bildirim yer tutucuları için `$(AndroidManifestPlaceholders)` değeri geçersiz. Lütfen `anahtar1=değer1;anahtar2=değer2` biçimini kullanın. Belirtilen değer: `{0}`
zh_hant: Android 資訊清單預留位置的 `$(AndroidManifestPlaceholders)` 值無效。請使用 `key1=value1;key2=value2` 格式。指定的值為: `{0}`

# XA1011
source: Using ProGuard with the D8 DEX compiler is no longer supported. Please set the code shrinker to 'r8' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidLinkTool' MSBuild property to 'r8'.
fr: L'utilisation de ProGuard avec le compilateur D8 DEX n'est plus prise en charge. Définissez le réducteur de code sur 'r8' dans les pages de propriétés de projet Visual Studio, ou modifiez le fichier projet dans un éditeur de texte et définissez la propriété MSBuild 'AndroidLinkTool' sur 'r8'.
tr: ProGuard'ın D8 DEX derleyicisi ile kullanılması artık desteklenmiyor. Lütfen Visual Studio projesi özellik sayfalarında kod sıkıştırıcıyı 'r8' olarak ayarlayın veya proje dosyasını bir metin düzenleyicisinde düzenleyip 'AndroidLinkTool' MSBuild özelliğini 'r8' olarak ayarlayın.
zh_hant: 不再支援在 D8 DEX 編譯器中使用 ProGuard。請在 Visual Studio 專案屬性頁中，將程式碼壓縮工具設定為 'r8'，或在文字編輯器中編輯專案檔，並將 'AndroidLinkTool' MSBuild 屬性設定為 'r8'。

# XA1012
source: Included layout root element override ID '{0}' is not valid.
fr: L'ID de substitution de l'élément racine de disposition inclus '{0}' n'est pas valide.
tr: Eklenen düzen kök öğesi geçersiz kılma kimliği ('{0}') geçerli değil.
zh_hant: 包含的版面配置根項目覆寫識別碼 '{0}' 無效。

# XA1013
source: Failed to parse ID of node '{0}' in the layout file '{1}'.
fr: L'analyse de l'ID du nœud '{0}' dans le fichier de disposition '{1}' a échoué.
tr: '{1}' düzen dosyasındaki '{0}' düğümünün kimliği ayrıştırılamadı.
zh_hant: 無法剖析配置檔案 '{1}' 中節點 '{0}' 的識別碼。

# XA1014
source: JAR library references with identical file names but different contents were found: {0}. Please remove any conflicting libraries from EmbeddedJar, InputJar and AndroidJavaLibrary.
fr: Des références de bibliothèque JAR avec des noms de fichiers identiques mais des contenus différents ont été trouvés : {0}. Supprimez toutes les bibliothèques en conflit de EmbeddedJar, InputJar et AndroidJavaLibrary.
tr: Aynı dosya adına ancak farklı içeriğe sahip JAR kitaplığı başvuruları bulundu: {0}. Lütfen EmbeddedJar, InputJar ve AndroidJavaLibrary'den çakışan kitaplıkları kaldırın.
zh_hant: 找到具有相同檔案名稱但不同內容的 JAR 程式庫參考: {0}。請從 EmbeddedJar、InputJar 和 AndroidJAVALibrary 移除任何衝突的程式庫。

# XA1015
source: More than one Android Wear project is specified as the paired project. It can be at most one.
fr: Plusieurs projets Android Wear sont spécifiés en tant que projets appairés. Il ne doit en exister qu'un seul.
tr: Eşleştirilmiş proje olarak birden fazla Android Wear projesi belirtildi. En fazla bir proje belirtilebilir.
zh_hant: 已將一個以上的 Android Wear 專案指定為配對的專案。最多只能指定一個。

# XA1016
source: Target Wear application's project '{0}' does not specify required 'AndroidManifest' project property.
fr: Le projet '{0}' de l'application Wear cible ne spécifie pas la propriété de projet 'AndroidManifest' nécessaire.
tr: Hedef Wear uygulamasının '{0}' projesinde, gerekli 'AndroidManifest' proje özelliği belirtilmiyor.
zh_hant: 目標 Wear 應用程式的專案 '{0}' 未指定必要的 'AndroidManifest' 專案屬性。

# XA1017
source: Target Wear application's AndroidManifest.xml does not specify required 'package' attribute.
fr: Le fichier AndroidManifest.xml de l'application Wear cible ne spécifie pas l'attribut 'package' nécessaire.
tr: Hedef Wear uygulamasının AndroidManifest.xml dosyasında, gerekli 'package' özniteliği belirtilmiyor.
zh_hant: 目標 Wear 應用程式的 AndroidManifest.xml 未指定必要的 'package' 屬性。

# XA1018
source: Specified AndroidManifest file does not exist: {0}.
fr: Le fichier AndroidManifest spécifié n'existe pas : {0}.
tr: Belirtilen AndroidManifest dosyası yok: {0}.
zh_hant: 指定的 AndroidManifest 檔案不存在: {0}。

# XA1019
source: `LibraryProjectProperties` file `{0}` is located in a parent directory of the bindings project's intermediate output directory. Please adjust the path to use the original `project.properties` file directly from the Android library project directory.
fr: Le fichier 'LibraryProjectProperties' '{0}' se trouve dans un répertoire parent du répertoire de sortie intermédiaire du projet de liaisons. Modifiez le chemin pour utiliser le fichier 'project.properties' d'origine directement à partir du répertoire du projet de bibliothèque Android.
tr: `LibraryProjectProperties` dosyası `{0}`, bağlama projesinin ara çıkış dizininin bir üst dizininde yer alıyor. Lütfen yolu özgün `project.properties` dosyasını doğrudan Android kitaplığı proje dizininden kullanacak şekilde ayarlayın.
zh_hant: 'LibraryProjectProperties' 檔案 '{0}' 位於繫結專案之中繼輸出目錄的父目錄中。請將該路徑調整為直接使用 Android 程式庫專案目錄中的原始 'project. properties' 檔案。

# XA1020
source: At least one Java library is required for binding. Check that a Java library is included in the project and has the appropriate build action: 'LibraryProjectZip' (for AAR or ZIP), 'EmbeddedJar', 'InputJar' (for JAR), or 'LibraryProjectProperties' (project.properties).
fr: Au moins une bibliothèque Java est nécessaire pour la liaison. Vérifiez qu'une bibliothèque Java est incluse dans le projet et qu'elle a l'action de génération appropriée : 'LibraryProjectZip' (pour AAR ou ZIP), 'EmbeddedJar', 'InputJar' (pour JAR) ou 'LibraryProjectProperties' (project.properties).
tr: Bağlama için en az bir Java kitaplığı gerekir. Projede bir Java kitaplığı olduğundan ve kitaplığın uygun derleme eylemine sahip olduğundan emin olun: 'LibraryProjectZip' (AAR veya ZIP için),' EmbeddedJar', 'InputJar' (JAR için) veya 'LibraryProjectProperties' (project.properties).
zh_hant: 至少需要一個 Java 程式庫才能繫結。請確定專案包含 Java 程式庫及適當的建置動作: 'LibraryProjectZip' (適用於 AAR 或 ZIP)、'EmbeddedJar'、'InputJar' (適用於 JAR) 或 'LibraryProjectProperties' (project.properties)。

# XA1021
source: Specified source Java library not found: {0}
fr: Bibliothèque Java source spécifiée introuvable : {0}
tr: Belirtilen kaynak Java kitaplığı bulunamadı: {0}
zh_hant: 找不到指定的來源 Java 程式庫: {0}

# XA1022
source: Specified reference Java library not found: {0}
fr: Bibliothèque Java de référence spécifiée introuvable : {0}
tr: Belirtilen başvuru Java kitaplığı bulunamadı: {0}
zh_hant: 找不到指定的參考 Java 程式庫: {0}

# XA1023
source: Using the DX DEX Compiler is not supported. Please set the DEX compiler to 'd8' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidDexTool' MSBuild property to 'd8'.
fr: L'utilisation du compilateur DEX DX n’est pas prise en charge. Affectez au compilateur DEX la valeur 'd8' dans les pages de propriétés de projet Visual Studio, ou modifiez le fichier projet dans un éditeur de texte, puis affectez la valeur 'd8' à la propriété MSBuild 'AndroidDexTool'.
tr: DX DEX Derleyicisinin kullanılması desteklenmemektedir. Lütfen Visual Studio projesi özellik sayfalarında DEX derleyicisini 'd8' olarak ayarlayın veya proje dosyasını bir metin düzenleyicide düzenleyip 'AndroidDexTool' MSBuild özelliğini 'd8' olarak ayarlayın.
zh_hant: 已不支援使用 DX DEX 編譯器。請在 Visual Studio 專案屬性頁中將 DEX 編譯器設為 'd8'，或在文字編輯器中編輯專案檔，並將 'AndroidDexTool' MSBuild 屬性設為 'd8'。

# XA1024
source: Ignoring configuration file '{0}'. .NET configuration files are not supported in .NET for Android projects that target .NET 6 or higher.
fr: Fichier de configuration «{0}» ignoré. Les fichiers de configuration .NET ne sont pas pris en charge dans .NET pour les projets Android qui ciblent .NET 6 ou version ultérieure.
tr: '{0}' yapılandırma dosyası göz ardı ediliyor. .NET yapılandırma dosyaları, .NET 6 veya üstünü hedefleyen Android için .NET projelerinde desteklenmez.
zh_hant: 正在忽略設定檔 '{0}'。以 .NET 6 或更新版本為目標的 .NET Android 專案不支援 .NET 設定檔。

# XA1025
source: The experimental 'Hybrid' value for the 'AndroidAotMode' MSBuild property is not currently compatible with the armeabi-v7a target ABI. To continue using the experimental 'Hybrid' value for 'AndroidAotMode', deselect the armeabi-v7a target ABI in the Visual Studio project property pages or edit the project file in a text editor and remove 'armeabi-v7a' from the 'AndroidSupportedAbis' MSBuild property.
fr: L'utilisation de la valeur expérimentale 'Hybrid' pour la propriété MSBuild 'AndroidAotMode' n'est pas compatible avec l'ABI cible armeabi-v7a. Si vous souhaitez continuer à utiliser la valeur expérimentale 'Hybrid' pour 'AndroidAotMode', désélectionnez l'ABI cible armeabi-v7a dans les pages de propriétés de projet Visual Studio, ou modifiez le fichier projet dans un éditeur de texte, puis supprimez 'armeabi-v7a' dans la propriété MSBuild 'AndroidSupportedAbis'.
tr: 'AndroidAotMode' MSBuild özelliği için deneysel 'Hybrid' değeri şu anda armeabi-v7a hedef ABI ile uyumlu değil. 'AndroidAotMode' için deneysel 'Hybrid' değerini kullanmaya devam etmek için Visual Studio projesinin özellik sayfalarındaki armeabi-v7a hedef ABI seçimini kaldırın veya metin düzenleyicisinde proje dosyasını düzenleyerek 'AndroidSupportedAbis' MSBuild özelliğinden 'armeabi-v7a' öğesini kaldırın.
zh_hant: 'AndroidAotMode' MSBuild 屬性的實驗性 'Hybrid' 值目前與 armeabi v7a 目標 ABI 不相容。若要繼續使用 'AndroidAotMode' 的實驗性 'Hybrid' 值，請取消選取 Visual Studio 專案屬性頁面中的 armeabi-v7a 目標 ABI，或在文字編輯器中編輯專案檔，從 'AndroidSupportedAbis' MSBuild 屬性中移除 'armeabi-v7a'。

# XA1026
source: Using AAPT is deprecated in favor of AAPT2. Please enable 'Use incremental Android packaging system (aapt2)' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidUseAapt2' MSBuild property to 'true'.
fr: L'utilisation d'AAPT est dépréciée en faveur d'AAPT2. Activez 'Utiliser le système d'empaquetage Android incrémentiel (aapt2)' dans les pages de propriétés de projet Visual Studio, ou modifiez le fichier projet dans un éditeur de texte et définissez la propriété MSBuild 'AndroidUseAapt2' sur 'true'.
tr: AAPT kullanımı, kullanım dışı bırakılarak yerine AAPT2 getirildi. Lütfen Visual Studio projesinin özellik sayfalarındaki 'Artımlı Android paketleme sistemini (aapt2) kullan' seçeneğini etkinleştirin veya proje dosyasını bir metin düzenleyicisinde düzenleyip 'AndroidUseAapt2' MSBuild özelliğini 'true' olarak ayarlayın.
zh_hant: 已不再使用 AAPT，改用 AAPT 2。請在 Visual Studio 專案屬性頁中啟用 [使用增量 Android 封裝系統 (aapt2)]，或在文字編輯器中編輯專案檔，並將 'AndroidUseAapt2' MSBuild 屬性設定為 'true'。

# XA1026_dotnet
source: Using AAPT is not supported in .NET for Android projects that target .NET 6 or higher. Please enable 'Use incremental Android packaging system (aapt2)' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidUseAapt2' MSBuild property to 'true'.
fr: L’utilisation d’AAPT n’est pas prise en charge dans .NET pour les projets Android qui ciblent .NET 6 ou une version ultérieure. Activez 'Utiliser le système d'empaquetage Android incrémentiel (aapt2)' dans les pages de propriétés de projet Visual Studio, ou modifiez le fichier projet dans un éditeur de texte, puis affectez la valeur 'true' à la propriété MSBuild 'AndroidUseAapt2'.
tr: .NET 6 veya üstünü hedefleyen Android için .NET projelerinde AAPT kullanımı desteklenmez. Lütfen Visual Studio projesinin özellik sayfalarındaki 'Artımlı Android paketleme sistemini (aapt2) kullan' seçeneğini etkinleştirin veya proje dosyasını bir metin düzenleyicisinde düzenleyip 'AndroidUseAapt2' MSBuild özelliğini 'true' olarak ayarlayın.
zh_hant: 目標為 .NET 6 或更新版本的 Android 專案的 .NET 不支援使用 AAPT。請在 Visual Studio 專案屬性頁中啟用 [使用增量 Android 套件系統 (aapt2)]，或在文字編輯器中編輯專案檔，並將 'AndroidUseAapt2' MSBuild 屬性設定為 'true'。

# XA1027
source: The 'EnableProguard' MSBuild property is set to 'true' and the 'AndroidLinkTool' MSBuild property is empty, so 'AndroidLinkTool' will default to 'proguard'.
fr: La propriété MSBuild 'EnableProguard' est définie sur 'true' et la propriété MSBuild 'AndroidLinkTool' est vide. Par conséquent, 'AndroidLinkTool' a 'ProGuard' comme valeur par défaut.
tr: 'EnableProguard' MSBuild özelliği 'true' olarak ayarlandığından ve 'AndroidLinkTool' MSBuild özelliği boş olduğundan 'AndroidLinkTool' varsayılan olarak 'proguard' değerini alır.
zh_hant: 'EnableProguard' MSBuild 屬性設定為 'true'，而且 'AndroidLinkTool' MSBuild 屬性是空的，因此 'AndroidLinkTool' 預設為 'proguard'。

# XA1028
source: The 'AndroidEnableProguard' MSBuild property is set to 'true' and the 'AndroidLinkTool' MSBuild property is empty, so 'AndroidLinkTool' will default to 'proguard'.
fr: La propriété MSBuild 'AndroidEnableProguard' est définie sur 'true' et la propriété MSBuild 'AndroidLinkTool' est vide. Par conséquent, 'AndroidLinkTool' a 'ProGuard' comme valeur par défaut.
tr: 'AndroidEnableProguard' MSBuild özelliği 'true' olarak ayarlandığından ve 'AndroidLinkTool' MSBuild özelliği boş olduğundan 'AndroidLinkTool' varsayılan olarak 'proguard' değerini alır.
zh_hant: 'AndroidEnableProguard' MSBuild 屬性設定為 'true'，而且 'AndroidLinkTool' MSBuild 屬性是空的，因此 'AndroidLinkTool' 預設為 'proguard'。

# XA1029
source: The 'AotAssemblies' MSBuild property is deprecated. Edit the project file in a text editor to remove this property, and use the 'RunAOTCompilation' MSBuild property instead.
fr: La propriété MSBuild « AotAssemblies » est déconseillée. Modifiez le fichier projet dans un éditeur de texte pour supprimer cette propriété et utilisez la propriété MSBuild « RunAOTCompilation » à la place.
tr: 'AotAssemblies' MSBuild özelliği kullanım dışı bırakıldı. Bu özelliği kaldırmak için proje dosyasını bir metin düzenleyicisinde düzenleyin ve bunun yerine 'RunAOTCompilation' MSBuild özelliğini kullanın.
zh_hant: 'AotAssemblies' MSBuild 屬性已被取代。在文字編輯器中編輯專案檔案以移除此屬性，並改為使用 'RunAOTCompilation' MSBuild 屬性。

# XA1030
source: The 'RunAOTCompilation' MSBuild property is only supported when trimming is enabled. Edit the project file in a text editor to set 'PublishTrimmed' to 'true' for this build configuration.
fr: La propriété MSBuild « RunAOTCompilation » n’est prise en charge que lorsque le découpage est activé. Modifiez le fichier projet dans un éditeur de texte pour définir « PublishTrimmed » sur « true » pour cette configuration de build.
tr: 'RunAOTCompilation' MSBuild özelliği yalnızca kırpma etkinleştirildiğinde desteklenir. Bu yapı yapılandırması için 'PublishTrimmed' öğesini 'true' olarak ayarlamak için proje dosyasını bir metin düzenleyicide düzenleyin.
zh_hant: 只有在啟用 [修剪] 時，才支援 'RunAOTCompilation' MSBuild 屬性。在文字編輯器中編輯專案檔案，以將此組建組態的 'PublishTrimmed' 設為 'true'。

# XA1031
source: The 'AndroidHttpClientHandlerType' property value '{0}' must derive from '{1}'. Please change the value to an assembly-qualifed type name which inherits from '{1}' or remove the property completely.
fr: La valeur de la propriété « AndroidHttpClientHandlerType » « {0} » doit dériver de « {1} ». Veuillez remplacer la valeur par un nom de type qualifié par l’assembly qui hérite de « {1} » ou supprimez complètement la propriété.
tr: '{0}' 'AndroidHttpClientHandlerType' özellik değeri '{1}' türünden türetilmelidir. Lütfen değeri '{1}' türünden devralan derlemeye uygun bir tür adına dönüştürün veya özelliği tamamen kaldırın.
zh_hant: 'AndroidHttpClientHandlerType' 屬性值 '{0}' 必須衍生自 '{1}'。 請將值變更為繼承自 '{1}' 或完全移除屬性的 assembly-qualifed 類型名稱。

# XA1031_HCH
source: The 'AndroidHttpClientHandlerType' property value '{0}' must not derive from 'System.Net.Htt.HttpClientHandler'. Please change the value to an assembly-qualifed type name which inherits from 'System.Net.Http.HttpMessageHandler' or remove the property completely.
fr: La valeur de propriété « AndroidHttpClientHandlerType » « {0} » ne doit pas dériver de « System.Net.Htt.HttpClientHandler ». Remplacez la valeur par un nom de type assembly-qualifed qui hérite de « System.Net.Http.HttpMessageHandler » ou supprimez complètement la propriété.
tr: ‘AndroidHttpClientHandlerType’ özellik değeri ‘{0}’ ‘System.Net.Htt.HttpClientHandler’ öğesinden türetilmemeli. Lütfen değeri ‘System.Net.Http.HttpMessageHandler’ türünden devralan derlemeye uygun bir tür adına dönüştürün veya özelliği tamamen kaldırın.
zh_hant: 'AndroidHttpClientHandlerType' 屬性值 '{0}' 不能衍生自 'System.Net.Htt.HttpClientHandler'。 請將值變更為繼承自 'System.Net.Http.HttpMessageHandler' 或完全移除屬性的 assembly-qualifed 類型名稱。

# XA1032
source: Failed to resolve '{0}' from '{1}'. Please check your `AndroidHttpClientHandlerType` setting.
fr: Échec de la résolution de « {0} » à partir de « {1} ». Vérifiez votre paramètre `AndroidHttpClientHandlerType`.
tr: '{0}' değeri '{1}' derlemesinden çözümlenemedi. Lütfen `AndroidHttpClientHandlerType` ayarınızı kontrol edin.
zh_hant: 無法從 '{0}' 解析 '{1}'。請檢查您的 'AndroidHttpClientHandlerType' 設定。

# XA1033
source: Could not resolve '{0}'. Please check your `AndroidHttpClientHandlerType` setting.
fr: Impossible de résoudre « {0} ». Veuillez vérifier votre paramètre `AndroidHttpClientHandlerType`.
tr: '{0}' değeri çözümlenemedi. Lütfen `AndroidHttpClientHandlerType` ayarınızı kontrol edin.
zh_hant: 無法解析 '{0}'。請檢查您的 'AndroidHttpClientHandlerType' 設定。

# XA1034
source: Your project references '{0}' which uses the `_Microsoft.Android.Resource.Designer` assembly, but you do not have this feature enabled. Please set the `AndroidUseDesignerAssembly` MSBuild property to `true` in your project file.
fr: Vos références de projet « {0} » qui utilise l’assembly `_Microsoft.Android.Resource.Designer`, mais cette fonctionnalité n’est pas activée. Veuillez définir la propriété MSBuild `AndroidUseDesignerAssembly` sur `true` dans votre Fichier projet.
tr: Projeniz `_Microsoft.Android.Resource.Designer` derlemesini kullanan '{0}' özelliğine başvuruyor ancak bu özellik etkin değil. Lütfen proje dosyanızda `AndroidUseDesignerAssembly` MSBuild özelliğini `true` olarak ayarlayın.
zh_hant: 您的專案參考 '{0}' 使用 '_Microsoft.Android.Resource.Designer' 組件，但您未啟用此功能。請將專案檔案中的 'AndroidUseDesignerAssembly' MSBuild 屬性設定為 'true'。

# XA1035
source: The 'BundleAssemblies' property is deprecated and it has no effect on the application build. Equivalent functionality is implemented by the 'AndroidUseAssemblyStore' and 'AndroidEnableAssemblyCompression' properties.
fr: La propriété « BundleAssemblies » est déconseillée et n’a aucun effet sur la build de l’application. La fonctionnalité équivalente est implémentée par les propriétés « AndroidUseAssemblyStore » et « AndroidEnableAssemblyCompression ».
tr: 'BundleAssemblies' özelliği kullanım dışıdır ve uygulama derlemesi üzerinde etkisi yoktur. Eşdeğer işlev 'AndroidUseAssemblyStore' ve 'AndroidEnableAssemblyCompression' özellikleri ile uygulanmalıdır.
zh_hant: 'BundleAssemblies' 屬性已過時，對應用程式組建沒有任何作用。將由 'AndroidUseAssemblyStore' 和 'AndroidEnableAssemblyCompression' 屬性實作同等功能。
