Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# APT0001
source: Unknown option `{0}`. Please check `$(AndroidAapt2CompileExtraArgs)` and `$(AndroidAapt2LinkExtraArgs)` to see if they include any `aapt` command line arguments that are no longer valid for `aapt2` and ensure that all other arguments are valid for `aapt2`.
cs: Neznámá možnost {0}. Zkontrolujte prosím $(AndroidAapt2CompileExtraArgs) a $(AndroidAapt2LinkExtraArgs), podívejte se, jestli nezahrnují nějaké argumenty příkazového řádku aapt, které už nejsou pro aapt2 platné, a ujistěte se, že všechny ostatní argumenty jsou pro aapt2 platné.
de: Unbekannte Option "{0}". Überprüfen Sie "$(AndroidAapt2CompileExtraArgs)" und "$(AndroidAapt2LinkExtraArgs)" auf aapt-Befehlszeilenargumente, die für "aapt2" nicht mehr gültig sind, und stellen Sie sicher, dass alle anderen Argumente für "aapt2" gültig sind.
es: Opción "{0}" desconocida. Compruebe "$(AndroidAapt2CompileExtraArgs)" y "$(AndroidAapt2LinkExtraArgs)" para ver si incluyen los argumentos de la línea de comandos "aapt" que ya no son válidos para "aapt2" y asegúrese de que el resto de argumentos sean válidos para "aapt2".
it: Opzione `{0}` sconosciuta. Controllare `$(AndroidAapt2CompileExtraArgs)` e `$(AndroidAapt2LinkExtraArgs)` per verificare se includono argomenti della riga di comando di `aapt` che non sono più validi per `aapt2` e assicurarsi che tutti gli altri argomenti siano validi per `aapt2`.
ja: オプション '{0}' が不明です。`$(AndroidAapt2CompileExtraArgs)` と `$(AndroidAapt2LinkExtraArgs)` に、`aapt2` で有効ではなくなった `aapt` コマンド ライン引数が含まれていないか確認し、他のすべての引数が `aapt2` で有効であることを確かめてください。
ko: 알 수 없는 옵션 `{0}`입니다. `$(AndroidAapt2CompileExtraArgs)` 및 `$(AndroidAapt2LinkExtraArgs)`를 확인하여 `aapt2`에 대해 이제 유효하지 않은 `aapt` 명령줄 인수가 포함되는지 확인하고 `aapt2`에 대해 모든 다른 인수가 유효한지 확인하세요.
pl: Nieznana opcja „{0}”. Sprawdź zmienne „$(AndroidAapt2CompileExtraArgs)” i „$(AndroidAapt2LinkExtraArgs)” pod kątem tego, czy zawierają jakiekolwiek argumenty wiersza polecenia „aapt”, które nie są już prawidłowe dla elementu „aapt2”, oraz upewnij się, że wszystkie pozostałe argumenty są prawidłowe dla elementu „aapt2”.
pt_br: Opção desconhecida `{0}`. Verifique se '$(AndroidAapt2CompileExtraArgs)' e '$(AndroidAapt2LinkExtraArgs)' incluem argumentos de linha de comando de `aapt` que não sejam mais válidos para `aapt2` e verifique se todos os outros argumentos são válidos para `aapt2`.
ru: Неизвестный параметр "{0}". Проверьте "$(AndroidAapt2CompileExtraArgs)" и "$(AndroidAapt2LinkExtraArgs)", чтобы проверить, содержат ли они аргументы командной строки "aapt", которые больше не являются допустимыми для "aapt2", и убедитесь, что все остальные аргументы являются допустимыми для "aapt2".
zh_hans: 未知选项“{0}”。请检查 "$(AndroidAapt2CompileExtraArgs)" 和 "$(AndroidAapt2LinkExtraArgs)"，以查看它们是否包含任何对 "aapt2" 不再有效的 "aapt" 命令行参数，并确保所有其他参数都对 "aapt2" 有效。

# APT0002
source: Invalid file name: It must contain only {0}.
cs: Neplatný název souboru. Musí obsahovat jen {0}.
de: Ungültiger Dateiname: Der Name darf nur {0} enthalten.
es: Nombre de archivo no válido: debe contener solo {0}.
it: Nome file non valido: deve contenere solo {0}.
ja: ファイル名が無効です: {0} のみを指定する必要があります。
ko: 잘못된 파일 이름: {0}만 포함해야 합니다.
pl: Nieprawidłowa nazwa pliku: może ona zawierać tylko: {0}.
pt_br: Nome de arquivo inválido: ele precisa conter apenas {0}.
ru: Недопустимое имя файла: оно должно содержать только {0}.
zh_hans: 文件名无效: 它必须仅包含 {0}。

# APT0003
source: Invalid file name: It must contain only {0}.
cs: Neplatný název souboru. Musí obsahovat jen {0}.
de: Ungültiger Dateiname: Der Name darf nur {0} enthalten.
es: Nombre de archivo no válido: debe contener solo {0}.
it: Nome file non valido: deve contenere solo {0}.
ja: ファイル名が無効です: {0} のみを指定する必要があります。
ko: 잘못된 파일 이름: {0}만 포함해야 합니다.
pl: Nieprawidłowa nazwa pliku: może ona zawierać tylko: {0}.
pt_br: Nome de arquivo inválido: ele precisa conter apenas {0}.
ru: Недопустимое имя файла: оно должно содержать только {0}.
zh_hans: 文件名无效: 它必须仅包含 {0}。

# XA0000_API_for_TargetFrameworkVersion
source: Could not determine API level for $(TargetFrameworkVersion) of '{0}'.
cs: Nepovedlo se určit úroveň rozhraní API pro $(TargetFrameworkVersion) {0}.
de: Die API-Ebene für $(TargetFrameworkVersion) {0} konnte nicht bestimmt werden.
es: No se pudo determinar el nivel de API para $(TargetFrameworkVersion) de "{0}".
it: Non è stato possibile determinare il livello API per $(TargetFrameworkVersion) di '{0}'.
ja: '{0}' の $(TargetFrameworkVersion) の API レベルを特定できませんでした。
ko: '{0}'의 $(TargetFrameworkVersion)에 대한 API 레벨을 확인할 수 없습니다.
pl: Nie można określić poziomu interfejsu API dla parametru $(TargetFrameworkVersion) elementu „{0}”.
pt_br: Não foi possível determinar o nível da API da $(TargetFrameworkVersion) de '{0}'.
ru: Не удалось определить уровень API для $(TargetFrameworkVersion) "{0}".
zh_hans: 无法确定 $(TargetFrameworkVersion) "{0}" 的 API 级别。

# XA0000_API_or_TargetFrameworkVersion_Fail
source: Could not determine $(AndroidApiLevel) or $(TargetFrameworkVersion); should not be reached.
cs: Nepovedlo se určit $(AndroidApiLevel) nebo $(TargetFrameworkVersion); tato zpráva by se neměla zobrazit.
de: $(AndroidApiLevel) oder $(TargetFrameworkVersion) konnte nicht bestimmt werden. Dieser Fehler sollte nicht auftreten.
es: No se pudo determinar $(AndroidApiLevel) o $(TargetFrameworkVersion); no se esperaba llegar a esta situación.
it: Non è stato possibile determinare $(AndroidApiLevel) o $(TargetFrameworkVersion). Non deve essere raggiunto.
ja: $(AndroidApiLevel) も $(TargetFrameworkVersion) も特定できませんでした。これは、通常は表示されないメッセージです。
ko: $(AndroidApiLevel) 또는 $(TargetFrameworkVersion)을 확인할 수 없습니다. 이 오류 메시지가 표시되면 안 됩니다.
pl: Nie można określić parametru $(AndroidApiLevel) lub $(TargetFrameworkVersion); ten komunikat nie powinien być wyświetlany.
pt_br: Não foi possível determinar o $(AndroidApiLevel) ou a $(TargetFrameworkVersion). Isso não deveria ter ocorrido.
ru: Не удалось определить $(AndroidApiLevel) или $(TargetFrameworkVersion). Отображение этого сообщения не ожидается при нормальном использовании.
zh_hans: 无法确定 $(AndroidApiLevel)，或不应访问 $(TargetFrameworkVersion);。

# XA0000_Exception
source: Unhandled exception: {0}
cs: Neošetřená výjimka: {0}
de: Ausnahmefehler: {0}
es: Excepción no controlada: {0}
it: Eccezione non gestita: {0}
ja: ハンドルされない例外: {0}
ko: 처리되지 않은 예외: {0}
pl: Nieobsłużony wyjątek: {0}
pt_br: Exceção sem tratamento: {0}
ru: Необработанное исключение: {0}
zh_hans: 未处理的异常: {0}

# XA0000_TargetFrameworkVersion_for_API
source: Could not determine $(TargetFrameworkVersion) for API level '{0}.'
cs: Nepovedlo se určit $(TargetFrameworkVersion) pro úroveň rozhraní API {0}.
de: $(TargetFrameworkVersion) für API-Ebene {0} konnte nicht bestimmt werden.
es: No se pudo determinar $(TargetFrameworkVersion) para el nivel de API "{0}".
it: Non è stato possibile determinare $(TargetFrameworkVersion) per il livello API '{0}.'
ja: API レベル '{0}' の $(TargetFrameworkVersion) を特定できませんでした。
ko: API 레벨 '{0}'의 $(TargetFrameworkVersion)을 확인할 수 없습니다.
pl: Nie można określić parametru $(TargetFrameworkVersion) dla poziomu „{0}” interfejsu API.
pt_br: Não foi possível determinar a $(TargetFrameworkVersion) para o nível '{0}' da API.
ru: Не удалось определить $(TargetFrameworkVersion) для уровня API "{0}".
zh_hans: 无法确定 API 级别 "{0}" 的 $(TargetFrameworkVersion)。

# XA0001
source: Unsupported or invalid $(TargetFrameworkVersion) value of '{0}'. Please update your Project Options.
cs: Nepodporovaná nebo neplatná hodnota $(TargetFrameworkVersion) {0}. Aktualizujte prosím možnosti projektu.
de: Nicht unterstützter oder ungültiger $(TargetFrameworkVersion)-Wert von {0}. Aktualisieren Sie Ihre Projektoptionen.
es: Valor de $(TargetFrameworkVersion) de "{0}" no admitido o no válido. Actualice las opciones del proyecto.
it: Il valore '{0}' di $(TargetFrameworkVersion) non è supportato o non è valido. Aggiornare le opzioni del progetto.
ja: '{0}' の $(TargetFrameworkVersion) 値がサポートされていないか、無効です。プロジェクトのオプションを更新してください。
ko: '{0}'의 $(TargetFrameworkVersion) 값이 지원되지 않거나 잘못되었습니다. 프로젝트 옵션을 업데이트하세요.
pl: Nieobsługiwana lub nieprawidłowa wartość parametru $(TargetFrameworkVersion) dla elementu „{0}”. Zaktualizuj opcje projektu.
pt_br: Valor da $(TargetFrameworkVersion) '{0}' inválido ou sem suporte. Atualize as Opções do Projeto.
ru: Неподдерживаемое или недопустимое значение $(TargetFrameworkVersion) "{0}". Измените параметры проекта.
zh_hans: "{0}" 的 $(TargetFrameworkVersion) 值不受支持或无效。请更新项目选项。

# XA0002
source: Could not find mono.android.jar
cs: Nepovedlo se najít mono.android.jar.
de: "mono.android.jar" wurde nicht gefunden.
es: No se encontró mono.android.jar
it: Non è stato possibile trovare mono.android.jar
ja: mono.android.jar が見つかりませんでした
ko: mono.android.jar을 찾을 수 없습니다.
pl: Nie można było znaleźć pliku mono.android.jar
pt_br: Não foi possível encontrar o mono.android.jar
ru: Не удалось найти mono.android.jar.
zh_hans: 找不到 mono.android.jar

# XA0003
source: Invalid `android:versionCode` value `{0}` in `AndroidManifest.xml`. It must be an integer value.
cs: Neplatná hodnota android:versionCode {0} v AndroidManifest.xml. Musí být celočíselná.
de: Ungültiger android:versionCode-Wert "{0}" in "AndroidManifest.xml". Es muss sich um einen ganzzahligen Wert handeln.
es: Valor "{0}" de "android:versionCode" no válido en "AndroidManifest.xml". Debe ser un valor entero.
it: Il valore `{0}` di `android:versionCode` in `AndroidManifest.xml` non è valido. Deve essere un valore intero.
ja: `AndroidManifest.xml` の `android:versionCode` の値 `{0}` が無効です。整数値である必要があります。
ko: 'AndroidManifest'의 'android:versionCode' 값 '{0}'이(가) 잘못되었습니다. 정수 값이어야 합니다.
pl: Nieprawidłowa wartość „android:versionCode” „{0}” w pliku „AndroidManifest.xml”. Musi to być wartość całkowita.
pt_br: Valor `{0}` de `android:versionCode` inválido em `AndroidManifest.xml`. Deve ser um valor inteiro.
ru: Недопустимое значение "android:versionCode" "{0}" в "AndroidManifest.xml". Значение должно быть целым числом.
zh_hans: `AndroidManifest.xml` 中的 `android:versionCode` 值 `{0}` 无效。它必须是一个整数值。

# XA0004
source: Invalid `android:versionCode` value `{0}` in `AndroidManifest.xml`. The value must be in the range of 0 to {1}.
cs: Neplatná hodnota android:versionCode {0} v AndroidManifest.xml. Hodnota musí spadat do rozsahu od 0 do {1}.
de: Ungültiger android:versionCode-Wert "{0}" in "AndroidManifest.xml". Der Wert muss zwischen 0 und {1} liegen.
es: Valor "{0}" de "android:versionCode" no válido en "AndroidManifest.xml". El valor debe estar comprendido en el intervalo de 0 a {1}.
it: Il valore `{0}` di `android:versionCode` in `AndroidManifest.xml` non è valido. Il valore deve essere compreso tra 0 e {1}.
ja: `AndroidManifest.xml` の `android:versionCode` の値 `{0}` が無効です。値は 0 から {1} の範囲内にする必要があります。
ko: 'AndroidManifest'의 'android:versionCode' 값 '{0}'이(가) 잘못되었습니다. 값은 0에서 {1} 사이여야 합니다.
pl: Nieprawidłowa wartość „android:versionCode” „{0}” w pliku „AndroidManifest.xml”. Wartość musi mieścić się w zakresie od 0 do {1}.
pt_br: Valor `{0}` de `android:versionCode` em `AndroidManifest.xml` inválido. O valor deve estar no intervalo de 0 a {1}.
ru: Недопустимое значение "android:versionCode" "{0}" в "AndroidManifest.xml". Значение должно быть целым числом в диапазоне от 0 до {1}.
zh_hans: `AndroidManifest.xml` 中的 `android:versionCode` 值 `{0}` 无效。该值必须介于 0 到 {1} 范围内。

# XA0030
source: Building with JDK version `{0}` is not supported. Please install JDK version `{1}`. See https://aka.ms/xamarin/jdk9-errors
cs: Sestavování s verzí sady JDK {0} se nepodporuje. Nainstalujte prosím verzi sady JDK {1}. Další informace: https://aka.ms/xamarin/jdk9-errors
de: Eine Kompilierung mit JDK-Version {0} wird nicht unterstützt. Installieren Sie JDK-Version {1}. Siehe https://aka.ms/xamarin/jdk9-errors.
es: No se admite la compilación con la versión "{0}" de JDK. Instale la versión "{1}" de JDK. Consulte https://aka.ms/xamarin/jdk9-errors
it: La compilazione con la versione JDK `{0}` non è supportata. Installare JDK versione `{1}`. Vedere https://aka.ms/xamarin/jdk9-errors
ja: JDK バージョン '{0}' でのビルドはサポートされていません。JDK バージョン '{1}' をインストールしてください。https://aka.ms/xamarin/jdk9-errors を参照してください
ko: JDK 버전 '{0}'을(를) 사용하여 빌드할 수 없습니다. JDK 버전 '{1}'을(를) 설치하세요. https://aka.ms/xamarin/jdk9-errors를 참조하세요.
pl: Kompilowanie przy użyciu wersji zestawu JDK „{0}” nie jest obsługiwane. Zainstaluj zestaw JDK w wersji „{1}”. Zobacz https://aka.ms/xamarin/jdk9-errors
pt_br: Não há suporte para o build com a versão `{0}` do JDK. Instale a versão `{1}` do JDK. Consulte https://aka.ms/xamarin/jdk9-errors
ru: Сборка с использованием версии JDK "{0}" не поддерживается. Установите версию JDK "{1}". Дополнительные сведения см. на странице https://aka.ms/xamarin/jdk9-errors
zh_hans: 不支持使用 JDK 版本 `{0}` 生成。请安装 JDK 版本 `{1}`。请参阅 https://aka.ms/xamarin/jdk9-errors

# XA0031
source: Java SDK {0} or above is required when using {1}. Download the latest JDK at: https://aka.ms/msopenjdk Note: the Android Designer is incompatible with Java SDK 11.0: https://aka.ms/vs2019-and-jdk-11
cs: Když se používá {1}, vyžaduje se sada Java SDK {0} nebo novější.
de: Bei Verwendung von {1} ist Java SDK {0} oder höher erforderlich.
es: Se requiere el SDK de Java {0} o posterior cuando se use {1}.
it: Quando si usa {1}, è richiesto Java SDK {0} o versione successiva.
ja: {1} を使用するときには、Java SDK {0} 以上が必要です。
ko: {1}을(를) 사용하는 경우 Java SDK {0} 이상이 필요합니다.
pl: W przypadku używania funkcji {1} jest wymagany zestaw Java SDK {0} lub nowszy.
pt_br: O SDK do Java {0} ou superior é necessário ao usar {1}.
ru: При использовании компонента {1} требуется пакет SDK для Java как минимум версии {0}.
zh_hans: 使用 {1} 时需要 Java SDK {0} 或更高版本。

# XA0032
source: Java SDK {0} or above is required when using Android SDK Build-Tools {1}.
cs: Když se používají nástroje Build-Tools {1} v sadě Android SDK, vyžaduje se sada Java SDK {0} nebo novější.
de: Bei Verwendung der Android SDK Build-Tools {1} ist Java SDK {0} oder höher erforderlich.
es: Se requiere el SDK de Java {0} o posterior cuando se use Android SDK Build-Tools {1}.
it: Quando si usa Android SDK Build-Tools {1}, è richiesto Java SDK {0} o versioni successive.
ja: Android SDK ビルドツール {1} を使用するときには、Java SDK {0} 以上が必要です。
ko: Android SDK 빌드-도구 {1}을(를) 사용하는 경우 Java SDK {0} 이상이 필요합니다.
pl: W przypadku używania narzędzi Android SDK Build-Tools {1} jest wymagany zestaw Java SDK {0} lub nowszy.
pt_br: O SDK do Java {0} ou superior é necessário ao usar as Ferramentas de Build do SDK do Android {1}.
ru: При использовании Android SDK Build-Tools {1} требуется пакет SDK для Java версии {0} или более поздней версии.
zh_hans: 使用 Android SDK 生成工具 {1} 时需要 Java SDK {0} 或更高版本。

# XA0033
source: Failed to get the Java SDK version because the returned value does not appear to contain a valid version number. `{0} -version` returned: ```{1}```
cs: Nepovedlo se získat verzi sady Java SDK, protože vrácená hodnota podle všeho neobsahuje platné číslo verze. {0} -version vrátilo: {1}
de: Fehler beim Abrufen der Java SDK-Version, weil der zurückgegebene Wert offenbar keine gültige Versionsnummer enthält. Von "{0} -version" zurückgegebener Wert: "{1}"
es: No se pudo obtener la versión del SDK de Java porque el valor devuelto no parece contener un número de versión válido. "`{0} -version`" devolvió ```{1}```
it: Non è stato possibile ottenere la versione di Java SDK perché il valore restituito non sembra contenere un numero di versione valido. `{0} -version` restituito: ```{1}```
ja: 返された値に有効なバージョン番号が含まれていない可能性があるため、Java SDK バージョンを取得できませんでした。`{0} -version` が返されました。```{1}```
ko: 반환된 값이 유효한 버전 번호를 포함하지 않아서 Java SDK 버전을 가져오지 못했습니다. '{0} -version'에서 반환된 값: ```{1}```
pl: Nie udało się pobrać wersji zestawu Java SDK, ponieważ wygląda na to, że zwrócona wartość nie zawiera prawidłowego numeru wersji. Dane wyjściowe polecenia „{0} -version”: „{1}”
pt_br: Falha ao obter a versão do SDK do Java porque o valor retornado não parece conter um número de versão válido. `{0} -version` retornou: ```{1}```
ru: Не удалось получить версию пакета SDK для Java, поскольку возвращаемое значение не содержит допустимый номер версии. Команда "{0} -version" возвратила "{1}"
zh_hans: 未能获取 Java SDK 版本，因为返回的值似乎不包含有效的版本号。`{0} -version` 返回的值为 ```{1}```

# XA0034
source: Failed to get the Java SDK version. Please ensure you have Java {0} or above installed.
cs: Nepovedlo se získat verzi sady Java SDK. Ujistěte se prosím, že máte nainstalovanou Javu {0} nebo novější.
de: Fehler beim Abrufen der Java SDK-Version. Stellen Sie sicher, dass Java {0} oder höher installiert ist.
es: No se pudo obtener la versión del SDK de Java. Asegúrese de que tiene instalado Java {0} o una versión posterior.
it: Non è stato possibile ottenere la versione di Java SDK. Assicurarsi di aver installato Java {0} o versioni successive.
ja: Java SDK バージョンを取得できませんでした。Java {0} 以上がインストールされていることをご確認ください。
ko: Java SDK 버전을 가져오지 못했습니다. Java {0} 이상이 설치되어 있는지 확인하세요.
pl: Nie udało się pobrać wersji zestawu Java SDK. Upewnij się, że masz zainstalowany język Java {0} lub nowszy.
pt_br: Falha ao obter a versão do SDK do Java. Verifique se o Java {0} ou superior está instalado.
ru: Не удалось получить версию пакета SDK для Java. Убедитесь, что на компьютере установлен пакет Java {0} или более поздней версии.
zh_hans: 未能获取 Java SDK 版本。请确保安装了 Java {0} 或更高版本。

# XA0035
source: Unable to determine the Android ABI from the value '{0}'. Edit the project file in a text editor and set the 'RuntimeIdentifiers' MSBuild property to contain only valid identifiers for the Android platform.
cs: Z hodnoty {0} se nepovedlo určit Android ABI. Upravte soubor projektu v textovém editoru a nastavte vlastnost MSBuildu RuntimeIdentifiers tak, aby obsahovala jen platné identifikátory pro platformu Android.
de: Die Android-ABI kann aus dem Wert "{0}" nicht ermittelt werden. Bearbeiten Sie die Projektdatei in einem Text-Editor, und legen Sie die MSBuild-Eigenschaft "RuntimeIdentifiers" so fest, dass nur gültige Bezeichner für die Android-Plattform enthalten sind.
es: No se puede determinar la ABI de Android a partir del valor "{0}". Edite el archivo de proyecto en un editor de texto y establezca la propiedad de MSBuild "RuntimeIdentifiers" para que contenga solo identificadores válidos para la plataforma Android.
it: Non è possibile determinare l'ABI Android dal valore '{0}'. Modificare il file di progetto in un editor di testo e impostare la proprietà 'RuntimeIdentifiers' di MSBuild in modo che contenga solo identificatori validi per la piattaforma Android.
ja: 値 '{0}' から Android ABI を特定できません。プロジェクト ファイルをテキスト エディターで編集し、'RuntimeIdentifiers' MSBuild プロパティに、Android プラットフォームで有効な識別子だけが含まれるように設定してください。
ko: '{0}' 값에서 Android ABI를 확인할 수 없습니다. 텍스트 편집기에서 프로젝트 파일을 편집하고 Android 플랫폼에 대해 유효한 식별자만 포함하도록 'RuntimeIdentifiers' MSBuild 속성을 설정하세요.
pl: Nie można określić interfejsu Android ABI na podstawie wartości „{0}”. Edytuj plik projektu w edytorze tekstu i ustaw właściwość „RuntimeIdentifiers” programu MSBuild tak, aby zawierała wyłącznie prawidłowe identyfikatory platformy Android.
pt_br: Não foi possível determinar o ABI do Android com base no valor '{0}'. Edite o arquivo de projeto em um editor de texto e defina a propriedade 'RuntimeIdentifiers' do MSBuild para conter somente identificadores válidos para a plataforma Android.
ru: Не удалось определить ABI для Android по значению "{0}". Откройте файл проекта в текстовом редакторе и измените свойство MSBuild "RuntimeIdentifiers" так, чтобы оно содержало только допустимые идентификаторы для платформы Android.
zh_hans: 无法根据值“{0}”确定 Android ABI。请在文本编辑器中编辑项目文件，并将 MSBuild 属性 "RuntimeIdentifiers" 设置为仅包含 Android 平台的有效标识符。

# XA0036
source: The 'AndroidSupportedAbis' MSBuild property is no longer supported. Edit the project file in a text editor, remove any uses of 'AndroidSupportedAbis', and use the 'RuntimeIdentifiers' MSBuild property instead.
cs: Vlastnost MSBuildu AndroidSupportedAbis se už nepodporuje. Upravte soubor projektu v textovém editoru, odeberte všechna použití vlastnosti AndroidSupportedAbis a místo ní použijte vlastnost MSBuildu RuntimeIdentifiers.
de: Die MSBuild-Eigenschaft "AndroidSupportedAbis" wird nicht mehr unterstützt. Bearbeiten Sie die Projektdatei in einem Text-Editor, entfernen Sie alle Vorkommen von "AndroidSupportedAbis", und verwenden Sie stattdessen die MSBuild-Eigenschaft "RuntimeIdentifiers".
es: Ya no se admite la propiedad de MSBuild "AndroidSupportedAbis". Edite el archivo de proyecto en un editor de texto, quite los usos de "AndroidSupportedAbis" y utilice en su lugar la propiedad de MSBuild "RuntimeIdentifiers".
it: La proprietà 'AndroidSupportedAbis' di MSBuild non è più supportata. Modificare il file di progetto in un editor di testo, rimuovere tutti gli utilizzi di 'AndroidSupportedAbis' e sostituirli con la proprietà 'RuntimeIdentifiers' di MSBuild.
ja: 'AndroidSupportedAbis' MSBuild プロパティはサポートされなくなりました。プロジェクト ファイルをテキスト エディターで編集し、'AndroidSupportedAbis' の使用をすべて削除して、代わりに 'RuntimeIdentifiers' MSBuild プロパティを使用してください。
ko: 'AndroidSupportedAbis' MSBuild 속성은 더 이상 지원되지 않습니다. 텍스트 편집기에서 프로젝트 파일을 편집하고 'AndroidSupportedAbis' 사용을 모두 제거한 후 대신 'RuntimeIdentifiers' MSBuild 속성을 사용하세요.
pl: Właściwość „AndroidSupportedAbis” programu MSBuild nie jest już obsługiwana. Edytuj plik projektu w edytorze tekstu, usuń wszystkie wystąpienia właściwości „AndroidSupportedAbis” i użyj zamiast niej właściwości „RuntimeIdentifiers” programu MSBuild.
pt_br: Não há mais suporte para a propriedade 'AndroidSupportedAbis' do MSBuild. Edite o arquivo de projeto em um editor de texto, remova todas as ocorrências de 'AndroidSupportedAbis' e use a propriedade 'RuntimeIdentifiers' MSBuild em seu lugar.
ru: Свойство MSBuild "AndroidSupportedAbis" больше не поддерживается. Откройте файл проекта в текстовом редакторе, удалите все вхождения "AndroidSupportedAbis" и используйте вместо них свойство MSBuild "RuntimeIdentifiers".
zh_hans: 不再支持 MSBuild 属性 "AndroidSupportedAbis"。请在文本编辑器中编辑项目文件，删除对 "AndroidSupportedAbis" 的任何使用，并改为使用 MSBuild 属性 "RuntimeIdentifiers"。

# XA0100
source: EmbeddedNativeLibrary '{0}' is invalid in Android Application projects. Please use AndroidNativeLibrary instead.
cs: Knihovna EmbeddedNativeLibrary {0} v projektech aplikací pro Android není platná. Použijte prosím místo ní AndroidNativeLibrary.
de: EmbeddedNativeLibrary "{0}" ist in Android-Anwendungsprojekten ungültig. Verwenden Sie stattdessen AndroidNativeLibrary.
es: EmbeddedNativeLibrary "{0}" no es válido en los proyectos de aplicación Android. Use en su lugar AndroidNativeLibrary.
it: La libreria '{0}' di EmbeddedNativeLibrary non è valida in progetti Applicazione Android. In alternativa usare AndroidNativeLibrary.
ja: EmbeddedNativeLibrary '{0}' は Android アプリケーション プロジェクトでは無効です。代わりに AndroidNativeLibrary を使用してください。
ko: Android 애플리케이션 프로젝트의 EmbeddedNativeLibrary '{0}'이(가) 잘못되었습니다. 대신 AndroidNativeLibrary를 사용하세요.
pl: Biblioteka EmbeddedNativeLibrary „{0}” jest nieprawidłowa w projektach aplikacji systemu Android. Zamiast niej należy użyć biblioteki AndroidNativeLibrary.
pt_br: A EmbeddedNativeLibrary '{0}' é inválida nos projetos de Aplicativo Android. Use a AndroidNativeLibrary.
ru: Библиотека EmbeddedNativeLibrary "{0}" недопустима в проектах приложений Android. Используйте библиотеку AndroidNativeLibrary.
zh_hans: EmbeddedNativeLibrary“{0}”在 Android 应用程序项目中无效。请改用 AndroidNativeLibrary。
