Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# XA5201
source: NDK linker exited with an error. Exit code {0}
cs: Linker NDK byl ukončen s chybou. Ukončovací kód {0}
de: Der NDK-Linker wurde mit einem Fehler beendet. Exitcode: {0}
es: El enlazador de NDK se cerró con un error. Código de salida {0}
it: Il linker di NDK è stato terminato con un errore. Codice di uscita: {0}
ja: NDK リンカーがエラーで終了しました。終了コード {0}
ko: NDK 링커가 오류로 인해 종료되었습니다. 종료 코드 {0}
pl: Konsolidator zestawu NDK zakończył pracę z błędem. Kod zakończenia {0}
pt_br: O vinculador NDK C foi encerrado com um erro. Código de saída {0}
ru: Работа компоновщика NDK завершилась с ошибкой. Код выхода: {0}.
zh_hans: NDK 链接器已退出，但出现错误。退出代码 {0}

# XA5205
source: Cannot find `{0}`. Please install the Android SDK Build-Tools package with the `{1}{2}tools{2}{3}` program.
cs: Nepovedlo se najít {0}. Nainstalujte prosím balíček Android SDK Build-Tools pomocí programu {1}{2}tools{2}{3}.
de: "{0}" wurde nicht gefunden. Installieren Sie das Paket mit den Android SDK-Buildtools mit dem Programm "{1}{2}tools{2}{3}".
es: No se puede encontrar "{0}". Instale el paquete Build-Tools de Android SDK con el programa "{1}{2}tools{2}{3}".
it: Non è possibile trovare `{0}`. Installare il pacchetto Android SDK Build-Tools con il programma `{1}{2}tools{2}{3}`.
ja: `{0}` が見つかりません。`{1}{2}tools{2}{3}` プログラムを使用して Android SDK Build-Tools パッケージをインストールしてください。
ko: '{0}'을(를) 찾을 수 없습니다. '{1}{2}tools{2}{3}' 프로그램을 사용하여 Android SDK Build-Tools 패키지를 설치하세요.
pl: Nie można znaleźć narzędzia „{0}”. Zainstaluj pakiet Android SDK Build-Tools za pomocą programu „{1}{2}tools{2}{3}”.
pt_br: Não é possível localizar `{0}`. Instale o pacote Build-Tools do SDK do Android com o programa `{1}{2}tools{2}{3}`.
ru: Не удается найти "{0}". Установите пакет Android SDK Build-Tools с программой "{1}{2}tools{2}{3}".
zh_hans: 找不到“{0}”。请使用 `{1}{2}tools{2}{3}` 程序安装 Android SDK 生成工具包。

# XA5205_Lint
source: Cannot find `{0}` in the Android SDK. Please set its path via /p:LintToolPath.
cs: V sadě Android SDK se nepovedlo najít nástroj {0}. Nastavte prosím jeho cestu pomocí /p:LintToolPath.
de: "{0}" wurde im Android SDK nicht gefunden. Legen Sie den Pfad über "/p:LintToolPath" fest.
es: No se encuentra "{0}" en Android SDK. Establezca su ruta de acceso mediante /p:LintToolPath.
it: Non è possibile trovare `{0}` in Android SDK. Impostarne il percorso tramite /p:LintToolPath.
ja: Android SDK に `{0}` が見つかりません。/p:LintToolPath 経由のパスを設定してください。
ko: Android SDK에서 '{0}'을(를) 찾을 수 없습니다. /p:LintToolPath를 통해 해당 경로를 설정하세요.
pl: W zestawie Android SDK nie można znaleźć narzędzia „{0}”. Określ jego ścieżkę za pomocą opcji /p:LintToolPath.
pt_br: Não é possível localizar `{0}` no SDK do Android. Defina seu caminho por meio de /p:LintToolPath.
ru: Не удается найти "{0}" в пакете SDK для Android. Укажите путь к нему с помощью параметра /p:LintToolPath.
zh_hans: 在 Android SDK 中找不到“{0}”。请通过 /p:LintToolPath 设置其路径。

# XA5207
source: Could not find android.jar for API level {0}. This means the Android SDK platform for API level {0} is not installed. Either install it in the Android SDK Manager ({2}), or change the Xamarin.Android project to target an API version that is installed. ({1} missing.)
cs: Nepovedlo se najít android.jar pro úroveň rozhraní API {0}. To znamená, že platforma sady Android SDK pro úroveň rozhraní API {0} není nainstalovaná. Buď ji nainstalujte ve Správci sady Android SDK ({2}), nebo změňte projekt Xamarin.Android tak, aby cílil na verzi rozhraní API, která je nainstalovaná. (Chybí {1}.)
de: "android.jar" wurde für API-Ebene {0} nicht gefunden. Dies bedeutet, dass die Android SDK-Plattform für API-Ebene {0} nicht installiert ist. Führen Sie die Installation entweder im Android-SDK-Manager ({2}) durch, oder ändern Sie das Xamarin.Android-Projekt, um eine installierte API-Version als Ziel zu verwenden ("{1}" fehlt.)
es: No se encontró ningún archivo android.jar para el nivel de API {0}. Esto significa que la plataforma Android SDK para el nivel de API {0} no está instalada. Instálela en el Administrador de Android SDK ({2}) o cambie el proyecto Xamarin.Android para que tenga como destino una versión de la API que esté instalada. (Falta {1}).
it: Non è stato possibile trovare android.jar per il livello API {0}. Questo errore indica che la piattaforma Android SDK per il livello API {0} non è installata. Installarla in Gestione Android SDK ({2}) oppure modificare il progetto Xamarin.Android in modo che la destinazione sia una versione API installata ({1} mancante).
ja: API レベル {0} の android .jar が見つかりませんでした。これは、API レベル {0} の Android SDK プラットフォームがインストールされていないことを意味します。Android SDK マネージャー ({2}) にインストールするか、インストールされている API バージョンを対象とする Xamarin.Android プロジェクトを変更します。({1} がありません。)
ko: API 레벨 {0}의 android.jar을 찾을 수 없습니다. API 레벨 {0}의 Android SDK 플랫폼이 설치되어 있지 않습니다. Android SDK 관리자({2})에서 설치하거나, 설치된 API 버전을 대상으로 하도록 Xamarin.Android 프로젝트를 변경하세요.({1}이(가) 없습니다.)
pl: Nie można było znaleźć pliku android.jar dla poziomu interfejsu API {0}. Oznacza to, że platforma Android SDK dla poziomu interfejsu API {0} nie jest zainstalowana. Zainstaluj ją w Menedżerze zestawów Android SDK ({2}) lub zmień projekt Xamarin.Android tak, aby był przeznaczony dla zainstalowanej wersji interfejsu API. (Brak pliku {1}).
pt_br: Não foi possível encontrar android.jar para o nível da API {0}. Isso significa que a plataforma do SDK do Android para o nível da API {0} não está instalada. Instale-a no Gerenciador de SDK Android ({2}) ou altere o projeto Xamarin.Android para que ele seja direcionado a uma versão da API instalada. ({1} ausente.)
ru: Не удалось найти файл android.jar для уровня API {0}. Это означает, что платформа SDK для Android для уровня API {0} не установлена. Установите его в Диспетчере SDK Android ({2}) или измените проект Xamarin.Android, чтобы установленная версия API использовалась в нем в качестве целевой. (Отсутствует файл {1}.)
zh_hans: 找不到 API 级别 {0} 的 android jar。这意味着未安装 API 级别 {0} 的 Android SDK 平台。请在 Android SDK 管理器 {2} 中安装它，或更改 Xamarin.Android 项目，使其将安装的 API 版本作为目标。(缺少 {1}。)

# XA5207_SDK_Manager_Windows
source: Tools > Android > Android SDK Manager...
cs: Nástroje > Android > Správce sady Android SDK...
de: Extras > Android > Android-SDK-Manager...
es: Herramientas > Android > Administrador de Android SDK...
it: Strumenti > Android > Gestione Android SDK...
ja: [ツール] > [Android] > [Android SDK マネージャー...]
ko: 도구 > Android > Android SDK 관리자...
pl: Narzędzia > Android > Menedżer zestawów Android SDK...
pt_br: Ferramentas > Android > Gerenciador de SDK Android...
ru: Средства > Android > Диспетчер SDK Android…
zh_hans: “工具”>“ Android”>“Android SDK 管理器”…

# XA5207_SDK_Manager_macOS
source: Tools > Open Android SDK Manager...
cs: Nástroje > Otevřít správce sady Android SDK...
de: Extras > Android-SDK-Manager öffnen...
es: Herramientas > Abrir el Administrador de Android SDK...
it: Strumenti > Apri Gestione Android SDK...
ja: [ツール] > [Android SDK マネージャーを開く...]
ko: 도구 > Android SDK 관리자 열기...
pl: Narzędzia > Otwórz Menedżer zestawów SDK dla systemu Android...
pt_br: Ferramentas > Abrir o Gerenciador de SDK Android...
ru: Средства > Открыть Диспетчер SDK Android…
zh_hans: “工具”>“打开 Android SDK 管理器”…

# XA5211
source: Embedded Wear app package name differs from handheld app package name ({0} != {1}).
cs: Název vložené aplikace pro Wear se liší od názvu balíčku aplikace pro kapesní zařízení ({0} != {1}).
de: Der Name des eingebetteten Wear-App-Pakets weicht vom Namen des Handheld-App-Pakets ab ({0} != {1}).
es: El nombre del paquete de la aplicación Wear que se ha insertado es distinto del nombre del paquete de la aplicación para dispositivos de mano ({0}! = {1}).
it: Il nome del pacchetto dell'app Wear incorporata è diverso da quello dell'app palmare ({0} != {1}).
ja: 組み込みの Wear アプリ パッケージ名がハンドヘルド アプリ パッケージ名と異なります ({0}! = {1})。
ko: 포함된 Wear 앱 패키지 이름이 핸드헬드 앱 패키지 이름과 다릅니다({0} != {1}).
pl: Nazwa pakietu osadzonej aplikacji systemu Wear jest inna niż nazwa pakietu aplikacji dla urządzenia podręcznego ({0} != {1}).
pt_br: O nome do pacote do aplicativo Wear inserido difere do nome do pacote do aplicativo portátil ({0} != {1}).
ru: Имя пакета приложения Wear для встроенных устройств отличается от имени пакета приложения для наладонных устройств ({0} != {1}).
zh_hans: 嵌入的 Wear 应用包名称与手持式应用包名称不同({0} != {1})。

# XA5213
source: java.lang.OutOfMemoryError. Consider increasing the value of $(JavaMaximumHeapSize). Java ran out of memory while executing '{0} {1}'
cs: java.lang.OutOfMemoryError. Zvažte zvýšení hodnoty $(JavaMaximumHeapSize). Při provádění {0} {1} došlo v prostředí Java k nedostatku paměti.
de: java.lang.OutOfMemoryError. Erwägen Sie eine Erhöhung des Werts von $(JavaMaximumHeapSize). Für Java stand während der Ausführung von "{0} {1}" nicht genügend Arbeitsspeicher zur Verfügung.
es: Java.lang.OutOfMemoryError. Considere la posibilidad de aumentar el valor de $(JavaMaximumHeapSize). Se agotó la memoria de Java mientras se ejecutaba "{0} {1}".
it: java.lang.OutOfMemoryError. Provare ad aumentare il valore di $(JavaMaximumHeapSize). Java ha esaurito la memoria durante l'esecuzione di '{0} {1}'
ja: java.lang.OutOfMemoryError。$(JavaMaximumHeapSize) の値を増やすことを検討してください。'{0} {1}' の実行中に Java でメモリ不足が発生しました
ko: java.lang.OutOfMemoryError. $(JavaMaximumHeapSize) 값을 늘려 보세요. '{0} {1}'을(를) 실행하는 동안 Java에 메모리가 부족합니다.
pl: java.lang.OutOfMemoryError. Rozważ zwiększenie wartości parametru $(JavaMaximumHeapSize). Zabrakło pamięci dla środowiska Java podczas wykonywania elementu „{0} {1}”.
pt_br: java.lang.OutOfMemoryError. Considere o aumento do valor de $(JavaMaximumHeapSize). O Java ficou sem memória ao executar '{0} {1}'
ru: java.lang.OutOfMemoryError. Попробуйте увеличить значение $(JavaMaximumHeapSize). В Java недостаточно памяти для выполнения "{0} {1}"
zh_hans: java.lang.OutOfMemoryError。请考虑增大 $(JavaMaximumHeapSize) 的值。执行 "{0} {1}" 时，Java 内存不足

# XA5300_Android_Platforms
source: No Android platforms installed at '{0}'. Please install an SDK Platform with the `{1}{2}tools{2}{3}` program.
cs: V nástroji {0} není nainstalovaná žádná platforma Android. Nainstalujte prosím platformu sady SDK pomocí programu {1}{2}tools{2}{3}.
de: Auf "{0}" wurden keine Android-Plattformen installiert. Installieren Sie eine SDK-Plattform mit dem Programm "{1}{2}tools{2}{3}".
es: No hay ninguna plataforma Android instalada en "{0}". Instale una plataforma de SDK con el programa "{1}{2}tools{2}{3}".
it: Non ci sono piattaforme Android installate in '{0}'. Installare un'istanza di SDK Platform con il programma `{1}{2}tools{2}{3}`.
ja: Android プラットフォームが '{0}' にインストールされていません。`{1}{2}tools{2}{3}` プログラムを使用して SDK プラットフォームをインストールしてください。
ko: Android 플랫폼을 '{0}'에 설치하지 않았습니다. '{1}{2}tools{2}{3}' 프로그램을 사용하여 SDK Platform을 설치하세요.
pl: Brak platform systemu Android zainstalowanych w: „{0}”. Zainstaluj platformę zestawu SDK za pomocą programu „{1}{2}tools{2}{3}”.
pt_br: Não há nenhuma plataforma Android instalada em '{0}'. Instale uma Plataforma de SDK com o programa `{1}{2}tools{2}{3}`.
ru: На "{0}" не установлены платформы Android. Установите SDK Platform с помощью программы "{1}{2}tools{2}{3}".
zh_hans: “{0}”中未安装任何 Android 平台。请使用 `{1}{2}tools{2}{3}` 程序安装 SDK 平台。

# XA5300_Android_SDK
source: The Android SDK directory could not be found. Check that the Android SDK Manager in Visual Studio shows a valid installation. To use a custom SDK path for a command line build, set the 'AndroidSdkDirectory' MSBuild property to the custom path.
cs: Adresář sady Android SDK se nepovedlo najít. Nastavte ho prosím pomocí /p:AndroidSdkDirectory.
de: Das Android SDK-Verzeichnis wurde nicht gefunden. Legen Sie es über "/p:AndroidSdkDirectory" fest.
es: No se encontró el directorio de Android SDK. Debe establecerse a través de /p:AndroidSdkDirectory.
it: Non è stato possibile trovare la directory di Android SDK. Impostarla tramite /p:AndroidSdkDirectory.
ja: Android SDK ディレクトリが見つかりませんでした。/p:AndroidSdkDirectory 経由で設定してください。
ko: Android SDK 디렉터리를 찾을 수 없습니다. /p:AndroidSdkDirectory를 통해 설정하세요.
pl: Nie udało się znaleźć katalogu zestawu Android SDK. Określ go za pomocą opcji /p:AndroidSdkDirectory.
pt_br: Não foi possível encontrar o diretório do SDK do Android. Defina-o por meio de /p:AndroidSdkDirectory.
ru: Не удалось найти каталог пакета SDK для Android. Укажите путь к нему с помощью параметра /p:AndroidSdkDirectory.
zh_hans: 找不到 Android SDK 目录。请通过 /p:AndroidSdkDirectory 进行设置。

# XA5300_Java_SDK
source: The Java SDK directory could not be found. Ensure that the Android section of the Visual Studio options has a valid Java SDK directory configured. To use a custom SDK path for a command line build, set the 'JavaSdkDirectory' MSBuild property to the custom path.
cs: Adresář sady Java SDK se nepovedlo najít. Nastavte ho prosím pomocí /p:JavaSdkDirectory.
de: Das Java SDK-Verzeichnis wurde nicht gefunden. Legen Sie es über "/p:JavaSdkDirectory" fest.
es: No se encontró el directorio del SDK de Java. Debe establecerse a través de /p:JavaSdkDirectory.
it: Non è stato possibile trovare la directory di Java SDK. Impostarla tramite /p:JavaSdkDirectory.
ja: Java SDK ディレクトリが見つかりませんでした。/p:JavaSdkDirectory 経由で設定してください。
ko: Java SDK 디렉터리를 찾을 수 없습니다. /p:JavaSdkDirectory를 통해 설정하세요.
pl: Nie udało się znaleźć katalogu zestawu Java SDK. Określ go za pomocą opcji /p:JavaSdkDirectory.
pt_br: Não foi possível encontrar o diretório do SDK do Java. Defina-o por meio de /p:JavaSdkDirectory.
ru: Не удалось найти каталог пакета SDK для Java. Укажите путь к нему с помощью параметра /p:JavaSdkDirectory.
zh_hans: 找不到 Java SDK 目录。请通过 /p:JavaSdkDirectory 进行设置。

# XA5301
source: Failed to generate Java type for class: {0} due to MAX_PATH: {1}
cs: Nepovedlo se vygenerovat typ Javy pro třídu {0} kvůli MAX_PATH: {1}
de: Fehler beim Generieren des Java-Typs für die Klasse "{0}" aufgrund von MAX_PATH: {1}.
es: No se pudo generar el tipo Java {0} para la clase debido a la excepción MAX_PATH siguiente: {1}
it: Non è stato possibile generare il tipo Java per la classe {0} perché MAX_PATH è impostato su {1}
ja: MAX_PATH のため、クラス {0} の Java の型を生成できませんでした: {1}
ko: 클래스의 Java 형식({0})을 생성하지 못했습니다(원인: MAX_PATH: {1}).
pl: Nie można wygenerować typu języka Java dla klasy {0} z powodu elementu MAX_PATH: {1}
pt_br: Falha ao gerar o tipo Java para a classe: {0} devido a MAX_PATH: {1}
ru: Не удалось создать тип Java для класса {0} из-за MAX_PATH: {1}
zh_hans: 由于 MAX_PATH 未能为类 {0} 生成 Java 类型: {1}

# XA5302
source: Two processes may be building this project at once. Lock file exists at path: {0}
cs: Tento projekt možná sestavují dva procesy najednou. Na následující cestě existuje soubor zámku: {0}
de: Möglicherweise wird dieses Projekt von zwei Prozessen gleichzeitig kompiliert. Im Pfad ist eine Sperrdatei vorhanden: {0}
es: Puede que haya dos procesos compilando este proyecto a la vez. El archivo de bloqueo existe en la ruta de acceso {0}
it: Due processi possono compilare il progetto contemporaneamente. Il file di blocco si trova nel percorso: {0}
ja: 2 つのプロセスがこのプロジェクトを同時にビルドしている可能性があります。ロック ファイルはパス {0} に存在します
ko: 두 프로세스에서 이 프로젝트를 동시에 빌드할 수 있습니다. 잠금 파일은 {0} 경로에 있습니다.
pl: Ten projekt może być kompilowany jednocześnie przez dwa procesy. Plik blokady istnieje w ścieżce: {0}
pt_br: Dois processos podem estar criando este projeto ao mesmo tempo. O arquivo de bloqueio existe no caminho: {0}
ru: Сборка этого проекта может одновременно осуществляться двумя процессами. Файл блокировки находится по следующему пути: {0}
zh_hans: 可同时生成此项目的两个进程。以下路径中存在锁定文件: {0}

# XA1023
source: Using the DX DEX Compiler is not supported. Please set the DEX compiler to 'd8' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidDexTool' MSBuild property to 'd8'.
de: Die Verwendung des DX DEX-Compiler ist veraltet. Legen Sie den DEX-Compiler in den Visual Studio-Projekteigenschaftenseiten auf "d8" fest, oder bearbeiten Sie die Projektdatei in einem Text-Editor, und legen Sie die MSBuild-Eigenschaft "AndroidDexTool" auf "d8" fest.
pl: Używanie kompilatora DX DEX jest przestarzałe. Ustaw kompilator DEX na „d8” na stronach właściwości projektu w programie Visual Studio lub edytuj plik projektu w edytorze tekstów i ustaw właściwość programu MSBuild o nazwie „AndroidDexTool” na wartość „d8”.
ru: Использование DEX-компилятора DX является нерекомендуемым. Установите компилятор DEX "d8" на страницах свойств проекта в Visual Studio или измените файл проекта в текстовом редакторе, задав значение "d8" для свойства MSBuild "AndroidDexTool".
zh_hans: 已弃用 DX DEX 编译器。请在 Visual Studio 项目属性页中将 DEX 编译器设置为 "d8"，或者在文本编辑器中编辑项目文件，并将 "AndroidDexTool" MSBuild 属性设置为 "d8"。
