Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# XA1020
source: At least one Java library is required for binding. Check that a Java library is included in the project and has the appropriate build action: 'LibraryProjectZip' (for AAR or ZIP), 'EmbeddedJar', 'InputJar' (for JAR), or 'LibraryProjectProperties' (project.properties).
cs: Pro vazbu se vyžaduje nejméně jedna knihovna Java. Zkontrolujte, že knihovna Java je součástí projektu a že má vhodnou akci sestavení: LibraryProjectZip (pro AAR nebo ZIP), EmbeddedJar, InputJar (pro JAR) nebo LibraryProjectProperties (project.properties).
de: Für die Bindung ist mindestens eine Java-Bibliothek erforderlich. Stellen Sie sicher, dass eine Java-Bibliothek im Projekt enthalten ist und über die entsprechende Buildaktion verfügt: "LibraryProjectZip" (für AAR oder ZIP), "EmbeddedJar", "InputJar" (für JAR) oder "LibraryProjectProperties" (project.Properties).
es: Se necesita al menos una biblioteca Java para el enlace. Compruebe que haya una biblioteca Java incluida en el proyecto y que tenga la acción de compilación apropiada: "LibraryProjectZip" (para AAR o ZIP), "EmbeddedJar", "InputJar" (para JAR) o "LibraryProjectProperties" (project.properties).
it: Per il binding è richiesta almeno una libreria Java. Verificare che il progetto includa una libreria Java che contenga l'azione di compilazione appropriata: 'LibraryProjectZip' (per AAR o ZIP), 'EmbeddedJar', 'InputJar' (per JAR) o 'LibraryProjectProperties' (project.properties).
ja: バインドには、少なくとも 1 つの Java ライブラリが必要です。Java ライブラリがプロジェクトに含まれており、適切なビルド アクションが存在することを確認してください: 'LibraryProjectZip' (AAR または ZIP 用)、'EmbeddedJar'、'InputJar' (JAR 用)、または 'LibraryProjectProperties' (project.properties)。
ko: 바인딩에 하나 이상의 Java 라이브러리가 필요합니다. Java 라이브러리가 프로젝트에 포함되어 있으며 적합한 빌드 작업('LibraryProjectZip'(AAR 또는 ZIP의 경우), 'EmbeddedJar', 'InputJar'(JAR의 경우) 또는 'LibraryProjectProperties'(project.properties))이 있는지 확인하세요.
pl: Do powiązania wymagana jest co najmniej jedna biblioteka języka Java. Sprawdź, czy biblioteka języka Java jest dołączona do projektu i czy ma odpowiednią akcję kompilacji: „LibraryProjectZip” (w przypadku pliku AAR lub ZIP), „EmbeddedJar”, „InputJar” (w przypadku pliku JAR) lub „LibraryProjectProperties” (w przypadku pliku project.properties).
pt_br: Pelo menos uma biblioteca Java é necessária para associação. Verifique se uma biblioteca Java está incluída no projeto e se ela tem a ação de build apropriada: 'LibraryProjectZip' (para AAR ou ZIP), 'EmbeddedJar', 'InputJar' (para JAR) ou 'LibraryProjectProperties' (project.properties).
ru: Для привязки требуется по меньшей мере одна библиотека Java. Убедитесь, что в проект включена библиотека Java, имеющая соответствующее действие сборки: "LibraryProjectZip" (для AAR или ZIP), "EmbeddedJar", "InputJar" (для JAR) или "LibraryProjectProperties" (project.properties).
zh_hans: 至少需要一个 Java 库才能进行绑定。请检查项目中是否包含了 Java 库且该库是否具有适当的生成操作: "LibraryProjectZip" (对于 AAR 或 ZIP)、"EmbeddedJar"、"InputJar"(对于 JAR)或 "LibraryProjectProperties" (project.properties)。

# XA1021
source: Specified source Java library not found: {0}
cs: Zadaná zdrojová knihovna Java se nenašla: {0}
de: Die angegebene Java-Quellbibliothek wurde nicht gefunden: {0}
es: No se encontró la biblioteca Java de origen especificada: {0}
it: La libreria Java di origine specificata non è stata trovata: {0}
ja: 指定されたソース Java ライブラリが見つかりませんでした: {0}
ko: 지정한 소스 Java 라이브러리를 찾을 수 없음: {0}
pl: Nie odnaleziono określonej źródłowej biblioteki języka Java: {0}
pt_br: A biblioteca Java de origem especificada não foi encontrada: {0}
ru: Указанная исходная библиотека Java не найдена: {0}
zh_hans: 未找到指定的源 Java 库: {0}

# XA1022
source: Specified reference Java library not found: {0}
cs: Zadaná referenční knihovna Java se nenašla: {0}
de: Die angegebene Java-Referenzbibliothek wurde nicht gefunden: {0}
es: No se encontró la biblioteca Java de referencia especificada: {0}
it: La libreria Java di riferimento specificata non è stata trovata: {0}
ja: 指定されたリファレンス Java ライブラリが見つかりません: {0}
ko: 지정한 참조 Java 라이브러리를 찾을 수 없음: {0}
pl: Nie odnaleziono biblioteki języka Java określonej przez odwołanie: {0}
pt_br: A biblioteca Java de referência especificada não foi encontrada: {0}
ru: Указанная справочная библиотека Java не найдена: {0}
zh_hans: 未找到指定的引用 Java 库: {0}

# XA1023
source: Using the DX DEX Compiler is deprecated. Please set the DEX compiler to 'd8' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidDexTool' MSBuild property to 'd8'.
cs: Používání kompilátoru DX DEX je zastaralé. Nastavte prosím na stránkách vlastností projektu sady Visual Studio kompilátor DEX na d8, nebo upravte soubor projektu v textovém editoru a nastavte vlastnost MSBuildu AndroidDexTool na d8.
es: Ya no se admite el uso de ProGuard con el compilador DX DEX. Establezca el compilador DEX en "d8" en las páginas de propiedades del proyecto de Visual Studio o edite el archivo de proyecto en un editor de texto y establezca la propiedad "AndroidLinkTool" de MSBuild en "d8".
it: L'uso del compilatore DEX DX è deprecato. Impostare il compilatore DEX su 'd8' nelle pagine delle proprietà del progetto di Visual Studio o modificare il file di progetto in un editor di testo e impostare la proprietà 'AndroidDexTool' di MSBuild su 'd8'.
ja: DX DEX コンパイラは非推奨になりました。Visual Studio プロジェクトのプロパティ ページで DEX コンパイラを 'd8' に設定するか、テキスト エディターでプロジェクト ファイルを編集して 'AndroidDexTool' MSBuild プロパティを 'd8' に設定してください。
ko: DX DEX 컴파일러는 사용되지 않습니다. Visual Studio 프로젝트 속성 페이지에서 DEX 컴파일러를 'd8'로 설정하거나 텍스트 편집기에서 프로젝트 파일을 편집하고 'AndroidDexTool' MSBuild 속성을 'd8'로 설정하세요.
pt_br: O uso do Compilador DX DEX foi preterido. Defina o compilador DEX para 'd8' nas páginas de propriedades do projeto do Visual Studio ou edite o arquivo de projeto em um editor de texto e defina a propriedade 'AndroidDexTool' do MSBuild como 'd8'.

# XA1023_dotnet
source: Using the DX DEX Compiler is not supported in Xamarin.Android projects that target .NET 6 or higher. Please set the DEX compiler to 'd8' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidDexTool' MSBuild property to 'd8'.
cs: Používání kompilátoru DX DEX se v projektech Xamarin.Androidu, které cílí na .NET 5 nebo vyšší, nepodporuje. Nastavte prosím na stránkách vlastností projektu sady Visual Studio kompilátor DEX na d8, nebo upravte soubor projektu v textovém editoru a nastavte vlastnost MSBuildu AndroidDexTool na d8.
es: No se admite el uso del compilador DX DEX en los proyectos de Xamarin.Android destinados a .NET 5 o versiones posteriores. Establezca el compilador DEX en "d8" en las páginas de propiedades del proyecto de Visual Studio o edite el archivo de proyecto en un editor de texto y establezca la propiedad "AndroidDexTool" de MSBuild en "d8".
it: L'uso del compilatore DEX DX non è supportato in progetti Xamarin.Android destinati a .NET 5 o versione successiva. Impostare il compilatore DEX su 'd8' nelle pagine delle proprietà del progetto di Visual Studio o modificare il file di progetto in un editor di testo e impostare la proprietà 'AndroidDexTool' di MSBuild su 'd8'.
ja: .NET 5 以降を対象とする Xamarin.Android プロジェクトでは、DX DEX コンパイラの使用はサポートされていません。Visual Studio プロジェクトのプロパティ ページで DEX コンパイラを 'd8' に設定するか、テキスト エディターでプロジェクト ファイルを編集して 'AndroidDexTool' MSBuild プロパティを 'd8' に設定してください。
ko: DX DEX 컴파일러는 .NET 5 이상을 대상으로 하는 Xamarin.Android 프로젝트에서 사용할 수 없습니다. Visual Studio 프로젝트 속성 페이지에서 DEX 컴파일러를 'd8'로 설정하거나 텍스트 편집기에서 프로젝트 파일을 편집하고 'AndroidDexTool' MSBuild 속성을 'd8'로 설정하세요.
pt_br: Não há suporte para o uso do Compilador DX DEX nos projetos do Xamarin.Android direcionados ao .NET 5 ou superior. Defina o compilador DEX para 'd8' nas páginas de propriedades do projeto do Visual Studio ou edite o arquivo de projeto em um editor de texto e defina a propriedade 'AndroidDexTool' do MSBuild como 'd8'.

# XA1024
source: Ignoring configuration file '{0}'. .NET configuration files are not supported in Xamarin.Android projects that target .NET 6 or higher.
cs: Ignoruje se konfigurační soubor {0}. Konfigurační soubory .NET se v projektech Xamarin.Androidu, které cílí na .NET 5 nebo vyšší, nepodporují.
de: Die Konfigurationsdatei "{0}" wird ignoriert. .NET-Konfigurationsdateien werden in Xamarin.Android-Projekten für .NET 5 oder höher nicht unterstützt.
es: Omitiendo el archivo de configuración "{0}". Los archivos de configuración .NET no se admiten en proyectos Xamarin. Android destinados a .NET 5 o versiones posteriores.
it: Il file di configurazione '{0}' verrà ignorato. I file di configurazione .NET non sono supportati in progetti Xamarin.Android destinati a .NET 5 o versione successiva.
ja: 構成ファイル '{0}' を無視しています。.NET 構成ファイルは、.NET 5 以降を対象とする Xamarin.Android プロジェクトではサポートされていません。
ko: 구성 파일 '{0}'을(를) 무시합니다. .Net 5 이상을 대상으로 Xamarin.Android 프로젝트에서 .NET 구성 파일은 지원되지 않습니다.
pl: Ignorowanie pliku konfiguracji „{0}”. Pliki konfiguracji .NET nie są obsługiwane w projektach Xamarin.Android, których elementem docelowym jest platforma .NET 5 lub nowsza.
pt_br: Ignorando o arquivo de configuração '{0}'. Não há suporte para arquivos de configuração do .NET em projetos do Xamarin.Android direcionados ao .NET 5 ou posterior.
ru: Пропуск файла конфигурации "{0}". Файлы конфигурации .NET не поддерживаются в проектах Xamarin.Android для .NET 5 и более поздних версий.
zh_hans: 将忽略配置文件“{0}”。在面向 .NET 5 或更高版本的 Xamarin.Android 项目中不支持 .NET 配置文件。

# XA2000
source: Use of AppDomain.CreateDomain() detected in assembly: {0}. .NET 6 and higher will only support a single AppDomain, so this API will no longer be available in Xamarin.Android once .NET 6 is released.
cs: V sestavení {0} se zjistilo, že se používá AppDomain.CreateDomain(). .NET 5 bude podporovat jen jednu doménu AppDomain, proto toto rozhraní API už nebude po vydání rozhraní .NET 5 v Xamarin.Androidu k dispozici.
de: In der Assembly "{0}" wurde die Verwendung von "AppDomain.CreateDomain()" festgestellt. .NET 5 unterstützt nur eine einzelne AppDomain, sodass diese API nach dem Release von .NET 5 nicht mehr in Xamarin.Android verfügbar ist.
es: Se detectó el uso de AppDomain.CreateDomain() en el ensamblado: {0}. En .NET 5 solo se admitirá una instancia de AppDomain, por lo que esta API ya no estará disponible en Xamarin.Android una vez que se haya lanzado .NET 5.
it: È stato rilevato l'uso di AppDomain.CreateDomain() nell'assembly: {0}. .NET 5 supporterà solo un'unica istanza di AppDomain, di conseguenza questa API non sarà più disponibile in Xamarin.Android dopo il rilascio di .NET 5.
ja: アセンブリ {0} で AppDomain.CreateDomain() が使用されていることが検出されました。.NET 5 では単一の AppDomain のみがサポートされる予定のため、.NET 5 がリリースされるとこの API は Xamarin.Android では使用できなくなります。
ko: {0} 어셈블리에서 AppDomain.CreateDomain() 사용이 검색되었습니다. .NET 5는 단일 AppDomain만 지원하므로 .NET 5가 릴리스되면 이 API는 Xamarin.Android에서 더는 사용할 수 없습니다.
pl: Wykryto użycie metody AppDomain.CreateDomain() w następującym zestawie: {0}. Program .NET 5 obsługuje tylko jeden obiekt AppDomain, dlatego ten interfejs API nie będzie już dostępny w interfejsie Xamarin.Android po wydaniu programu .NET 5.
pt_br: O uso de AppDomain.CreateDomain() foi detectado no assembly: {0}. O .NET 5 dá suporte apenas a um único AppDomain, portanto, essa API não estará mais disponível no Xamarin.Android quando o .NET 5 for lançado.
ru: В сборке обнаружено использование AppDomain.CreateDomain(): {0}. .NET 5 поддерживает только один домен AppDomain, поэтому этот API не будет доступен в Xamarin.Android после выпуска .NET 5.
zh_hans: 在程序集 {0} 中检测到使用了 AppDomain.CreateDomain()。.NET 5 将仅支持一个 AppDomain，因此 .NET 5 发布后，将无法再在 Xamarin.Android 中使用此 API。

# XA2001
source: Source file '{0}' could not be found.
cs: Zdrojový soubor {0} se nenašel.
de: Die Quelldatei "{0}" wurde nicht gefunden.
es: No se encontró el archivo de origen '{0}'.
it: Il file di origine '{0}' non è stato trovato.
ja: ソース ファイル '{0}' が見つかりませんでした。
ko: 원본 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie można znaleźć pliku źródłowego „{0}”.
pt_br: Arquivo de origem "{0}" não pode ser encontrado.
ru: Не удалось найти исходный файл "{0}".
zh_hans: 未能找到源文件“{0}”。

# XA2002_Framework
source: Can not resolve reference: `{0}`, referenced by {1}. Perhaps it doesn't exist in the Mono for Android profile?
cs: Nelze přeložit odkaz {0}, na který odkazuje {1}. Možná neexistuje v profilu Mono for Android.
de: Der durch "{1}" referenzierte Verweis "{0}" kann nicht aufgelöst werden. Möglicherweise ist er im Mono für Android-Profil nicht vorhanden.
es: No se puede resolver la referencia "{0}", a la que hace referencia {1}. ¿Puede que no exista en el perfil de Mono para Android?
it: Non è possibile risolvere il riferimento `{0}`, a cui fa riferimento {1}. Forse non esiste nel profilo Mono per Android?
ja: {1} によって参照されている参照 '{0}' を解決できません。Mono for Android プロファイル内にそれが存在しないと思われます。
ko: {1}에서 참조하는 '{0}' 참조를 확인할 수 없습니다. Mono for Android 프로필에 해당 참조가 없는 것 같습니다.
pl: Nie można rozpoznać odwołania „{0}” przywoływanego przez element {1}. Być może nie istnieje ono w profilu platformy Mono dla systemu Android?
pt_br: Não é possível resolver a referência: `{0}`, referenciada por {1}. É possível que ela não exista no perfil do Mono para Android?
ru: Не удается разрешить ссылку "{0}", на которую ссылается {1}. Возможно, она отсутствует в профиле Mono для Android.
zh_hans: 无法解析 {1} 引用的引用“{0}”。Mono for Android 配置文件中可能没有该引用。

# XA2002_NuGet
source: Can not resolve reference: `{0}`, referenced by {1}. Please add a NuGet package or assembly reference for `{0}`, or remove the reference to `{2}`.
cs: Nelze přeložit odkaz: {0}, na který odkazuje {1}. Přidejte prosím balíček NuGet nebo odkaz na sestavení pro {0} nebo odeberte odkaz na {2}.
de: Der durch "{1}" referenzierte Verweis "{0}" kann nicht aufgelöst werden. Fügen Sie einen Verweis auf ein NuGet-Paket oder eine Assembly für "{0}" hinzu, oder entfernen Sie den Verweis auf "{2}".
es: No se puede resolver la referencia "{0}", a la que hace referencia {1}. Agregue un paquete NuGet o una referencia de ensamblado para "{0}", o bien quite la referencia a "{2}".
it: Non è possibile risolvere il riferimento `{0}`, a cui fa riferimento {1}. Aggiungere un pacchetto NuGet o un riferimento a un assembly per `{0}` oppure rimuovere il riferimento a `{2}`.
ja: {1} によって参照されている参照 '{0}' を解決できません。'{0}' の NuGet パッケージまたはアセンブリ参照を追加するか、'{2}' への参照を削除してください。
ko: {1}에서 참조하는 '{0}' 참조를 확인할 수 없습니다. '{0}'에 대한 NuGet 패키지 또는 어셈블리 참조를 추가하거나 '{2}'에 대한 참조를 제거하세요.
pl: Nie można rozpoznać odwołania „{0}” przywoływanego przez element {1}. Dodaj odwołanie do pakietu lub zestawu NuGet dla elementu „{0}” lub usuń odwołanie do elementu „{2}”.
pt_br: Não é possível resolver a referência: `{0}`, referenciada por {1}. Adicione um pacote NuGet ou uma referência de assembly para `{0}` ou remova a referência a `{2}`.
ru: Не удается разрешить ссылку "{0}", на которую ссылается {1}. Добавьте пакет NuGet или ссылку на сборку для "{0}" либо удалите ссылку на "{2}".
zh_hans: 无法解析引用: `{0}`，引用者为 {1}。请为 `{0}` 添加 NuGet 包或程序集引用，或删除对 `{2}` 的引用。

# XA2006
source: Could not resolve reference to '{0}' (defined in assembly '{1}') with scope '{2}'. When the scope is different from the defining assembly, it usually means that the type is forwarded.
cs: Nepodařilo se přeložit odkaz na {0} (definovaný v sestavení {1}) s oborem {2}. Když se obor liší od definujícího sestavení, obvykle to znamená, že je typ předán.
de: Der Verweis auf "{0}" (definiert in Assembly "{1}") mit dem Bereich "{2}" konnte nicht aufgelöst werden. Wenn sich der Bereich von der definierenden Assembly unterscheidet, weist dies üblicherweise auf einen weitergeleiteten Typ hin.
es: No se pudo resolver la referencia a "{0}" (definida en el ensamblado "{1}") con el ámbito "{2}"'. Cuando el ámbito es diferente del ensamblado de definición, normalmente significa que el tipo se reenvía.
it: Non è stato possibile risolvere il riferimento a '{0}' (definito nell'assembly '{1}') con ambito '{2}'. Quando l'ambito è diverso dall'assembly che lo definisce, in genere significa che il tipo è stato inoltrato.
ja: '{0}' (アセンブリ '{1}' 内で定義されている) への参照をスコープ '{2}' で解決できませんでした。定義しているアセンブリとスコープが異なる場合、通常は、その型が転送されることを意味します。
ko: 범위가 '{2}'인 '{0}'('{1}' 어셈블리에 정의되어 있음)에 대한 참조를 확인할 수 없습니다. 범위가 정의 어셈블리와 다르면 일반적으로 형식이 전달되었음을 의미합니다.
pl: Nie można rozpoznać odwołania do elementu „{0}” (zdefiniowanego w zestawie „{1}”) z zakresem „{2}”. Jeśli zakres różni się od zestawu definiującego, zazwyczaj oznacza to, że typ jest przekazywany.
pt_br: Não foi possível resolver a referência a '{0}' (definida no assembly '{1}') com o escopo '{2}'. Quando o escopo é diferente do assembly de definição, geralmente o tipo é encaminhado.
ru: Не удалось разрешить ссылку на "{0}" (определенную в сборке "{1}") с областью "{2}". Если область отличается от определяющей сборки, обычно это означает, что тип передается.
zh_hans: 未能使用范围 "{2}" 解析对(程序集 "{1}" 中定义的) "{0}" 的引用。当范围与进行定义的程序集不同时，这通常意味着已转发该类型。

# XA2007
source: Exception while loading assemblies: {0}
cs: Výjimka při načítání sestavení: {0}
de: Ausnahme beim Laden von Assemblys: {0}
es: Excepción al cargar los ensamblados: {0}
it: Si è verificata un'eccezione durante il caricamento degli assembly: {0}
ja: アセンブリの読み込み中に例外が発生しました。{0}
ko: 어셈블리 로드 중 예외 발생: {0}
pl: Wyjątek podczas ładowania zestawów: {0}
pt_br: Exceção ao carregar os assemblies: {0}
ru: Исключение при загрузке сборок: {0}.
zh_hans: 加载程序集时出错: {0}

# XA2008
source: In referenced assembly {0}, Java.Interop.DoNotPackageAttribute requires non-null file name.
cs: V odkazovaném sestavení {0} vyžaduje položka Java.Interop.DoNotPackageAttribute název souboru, který není null.
de: In der referenzierten Assembly "{0}" ist für "Java.Interop.DoNotPackageAttribute" ein Dateiname ungleich NULL erforderlich.
es: En el ensamblado {0} al que se hace referencia, Java.Interop.DoNotPackageAttribute requiere un nombre de archivo que no sea NULL.
it: Nell'assembly di riferimento {0} Java.Interop.DoNotPackageAttribute richiede un nome file diverso da Null.
ja: 参照されたアセンブリ {0} では、Java.Interop.DoNotPackageAttribute に Null 以外のファイル名が必要です。
ko: 참조된 어셈블리 {0}에서 Java.Interop.DoNotPackageAttribute에 null이 아닌 파일 이름이 필요합니다.
pl: W przywoływanym zestawie {0} element Java.Interop.DoNotPackageAttribute wymaga nazwy pliku o wartości innej niż null.
pt_br: No assembly referenciado {0}, Java.Interop.DoNotPackageAttribute exige um nome de arquivo não nulo.
ru: В сборке {0}, на которую указывает ссылка, для Java.Interop.DoNotPackageAttribute требуется имя файла, отличное от NULL.
zh_hans: 在引用的程序集 {0} 中，Java.Interop.DoNotPackageAttribute 需要非 null 的文件名。

# XA3001
source: Could not AOT the assembly: {0}
cs: Sestavení se nepovedlo zkompilovat AOT: {0}
de: AOT für Assembly nicht möglich: {0}
es: No se pudo aplicar AOT al ensamblado: {0}
it: Non è stato possibile eseguire la compilazione AOT dell'assembly: {0}
ja: アセンブリを AOT できませんでした: {0}
ko: 어셈블리를 AOT할 수 없음: {0}
pl: Nie można utworzyć widoku AOT zestawu: {0}
pt_br: Não foi possível fazer AOT no assembly: {0}
ru: Не удалось выполнить AOT для сборки: {0}
zh_hans: 无法 AOT 程序集: {0}

# XA3002
source: Invalid AOT mode: {0}
cs: Neplatný režim AOT: {0}
de: Ungültiger AOT-Modus: {0}
es: Modo AOT no válido: {0}
it: Modalità AOT non valida: {0}
ja: 無効な AOT モード: {0}
ko: 잘못된 AOT 모드: {0}
pl: Nieprawidłowy tryb AOT: {0}
pt_br: Modo de AOT inválido: {0}
ru: Недопустимый режим AOT: {0}
zh_hans: AOT 模式无效: {0}

# XA3003
source: Could not strip IL of assembly: {0}
cs: Nepovedlo se odebrat sestavení z IL: {0}
de: IL für Assembly konnte nicht entfernt werden: {0}
es: No se pudo quitar IL del ensamblado: {0}
it: Non è stato possibile rimuovere IL dell'assembly: {0}
ja: アセンブリの IL を削除できませんでした: {0}
ko: 어셈블리의 IL을 제거할 수 없음: {0}
pl: Nie można usunąć kodu IL zestawu: {0}
pt_br: Não foi possível remover o IL do assembly: {0}
ru: Не удалось удалить промежуточный язык сборки: {0}
zh_hans: 无法提取程序集的 IL: {0}

# XA3004
source: Android NDK r10d is buggy and provides an incompatible x86_64 libm.so. See https://code.google.com/p/android/issues/detail?id=161422.
cs: Android NDK r10d obsahuje chyby a poskytuje nekompatibilní knihovnu libm.so pro architekturu x86_64. Viz https://code.google.com/p/android/issues/detail?id=161422.
de: Android NDK r10d ist fehlerhaft und stellt eine inkompatible x86_64-Bibliothek "libm.so" bereit. Siehe https://code.google.com/p/android/issues/detail?id=161422.
es: Android NDK r10d ha dado error y proporciona un archivo x86_64 libm.so no compatible. Consulte https://code.google.com/p/android/issues/detail?id=161422.
it: Android NDK r10d contiene bug e fornisce un file x86_64 libm.so incompatibile. Vedere https://code.google.com/p/android/issues/detail?id=161422.
ja: Android NDK r10d にはバグがあるため、互換性のない x86_64 libm.so が提供されます。https://code.google.com/p/android/issues/detail?id=161422 をご覧ください。
ko: Android NDK r10d는 버그가 있으며 호환되지 않는 x86_64 libm.so를 제공합니다. https://code.google.com/p/android/issues/detail?id=161422를 참조하세요.
pl: Zestaw Android NDK r10d zawiera wiele usterek i dostarcza niezgodną bibliotekę libm.so dla architektury x86_64. Zobacz https://code.google.com/p/android/issues/detail?id=161422.
pt_br: O NDK r10d apresenta um bug e fornece um libm.so do x86_64 incompatível. Confira https://code.google.com/p/android/issues/detail?id=161422.
ru: Android NDK r10d содержит ошибки и предоставляет несовместимый пакет x86_64 libm.so. См. https://code.google.com/p/android/issues/detail?id=161422.
zh_hans: Android NDK r10d 有 bug，且提供了不兼容的 x86_64 libm.so。请参阅 https://code.google.com/p/android/issues/detail?id=161422。

# XA3005
source: The detected Android NDK version is incompatible with the targeted LLVM configuration. Please upgrade to NDK r10d or newer.
cs: Zjištěná verze Android NDK není kompatibilní s cílovou konfigurací LLVM. Upgradujte prosím NDK na r10d nebo novější.
de: Die erkannte Android-NDK-Version ist nicht mit der LLVM-Zielkonfiguration kompatibel. Führen Sie ein Upgrade auf NDK r10d oder höher aus.
es: La versión de Android NDK detectada no es compatible con la configuración de LLVM de destino. Actualice a NDK r10d o una versión más reciente.
it: La versione di Android NDK rilevata non è compatibile con la configurazione di LLVM di destinazione. Eseguire l'aggiornamento a NDK r10d o versione successiva.
ja: 検出された Android NDK のバージョンは、ターゲットの LLVM 構成と互換性がありません。NDK r10d 以降にアップグレードしてください。
ko: 검색된 Android NDK 버전이 대상 LLVM 구성과 호환되지 않습니다. NDK r10d 이상으로 업그레이드하세요.
pl: Wykryta wersja zestawu Android NDK jest niezgodna z docelową konfiguracją programu LLVM. Uaktualnij do zestawu NDK r10d lub nowszego.
pt_br: A versão do Android NDK detectada é incompatível com a configuração de LLVM de destino. Atualize para o NDK r10d ou mais recente.
ru: Обнаруженная версия Android NDK несовместима с целевой конфигурацией LLVM. Выполните обновление до NDK r10d или более поздней версии.
zh_hans: 检测到的 Android NDK 版本与目标 LLVM 配置不兼容。请升级到 NDK r10d 或更高版本。

# XA3006
source: Could not compile native assembly file: {0}
cs: Nepovedlo se zkompilovat soubor nativního sestavení: {0}
de: Die native Assemblydatei konnte nicht kompiliert werden: {0}
es: No se pudo compilar el archivo de ensamblado nativo: {0}
it: Non è stato possibile compilare il file di assembly nativo: {0}
ja: ネイティブ アセンブリ ファイルをコンパイルできませんでした: {0}
ko: 네이티브 어셈블리 파일을 컴파일할 수 없음: {0}
pl: Nie można skompilować natywnego pliku zestawu: {0}
pt_br: Não foi possível compilar o arquivo do assembly nativo: {0}
ru: Не удалось скомпилировать файл собственной сборки: {0}
zh_hans: 无法编译本机程序集文件: {0}
