Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# XA3007
source: Could not link native shared library: {0}
cs: Nepovedlo se připojit nativní sdílenou knihovnu: {0}
de: Die native freigegebene Bibliothek konnte nicht verknüpft werden: {0}
es: No se pudo vincular la biblioteca compartida nativa: {0}
it: Non è stato possibile collegare la libreria condivisa nativa: {0}
ja: ネイティブの共有ライブラリをリンクできませんでした: {0}
ko: 네이티브 공유 라이브러리를 연결할 수 없음: {0}
pl: Nie można połączyć natywnej biblioteki współużytkowanej: {0}
pt_br: Não foi possível vincular a biblioteca compartilhada nativa: {0}
ru: Не удалось связать собственную общую библиотеку: {0}
zh_hans: 无法链接本机共享库: {0}

# XA4209
source: Failed to generate Java type for class: {0} due to {1}
cs: Kvůli {1} se nepovedlo vygenerovat typ Javy pro třídu {0}.
de: Fehler beim Generieren des Java-Typs für die Klasse "{0}". Ursache: {1}
es: No se pudo generar el tipo Java {0} para la clase debido a lo siguiente: {1}
it: Non è stato possibile generare il tipo Java per la classe {0} a causa di {1}
ja: {1} のため、クラス {0} の Java の型を生成できませんでした
ko: 클래스의 Java 형식({0})을 생성하지 못했습니다(원인: {1}).
pl: Nie można wygenerować typu języka Java dla klasy {0} z powodu wyjątku {1}
pt_br: Falha ao gerar o tipo Java para a classe: {0} devido a {1}
ru: Не удалось создать тип Java для класса {0}, так как возникло исключение {1}
zh_hans: 由于 {1}，未能为类 {0} 生成 Java 类型

# XA4210
source: Please add a reference to Mono.Android.Export.dll when using ExportAttribute or ExportFieldAttribute.
cs: Když používáte ExportAttribute nebo ExportFieldAttribute, přidejte prosím odkaz na Mono.Android.Export.dll.
de: Fügen Sie einen Verweis auf "Mono.Android.Export.dll" hinzu, wenn Sie "ExportAttribute" oder "ExportFieldAttribute" verwenden.
es: Agregue una referencia a Mono.Android.Export.dll al usar ExportAttribute o ExportFieldAttribute.
it: Aggiungere un riferimento a Mono.Android.Export.dll quando si usa ExportAttribute o ExportFieldAttribute.
ja: ExportAttribute または ExportFieldAttribute を使用するときには、Mono.Android.Export.dll への参照を追加してください。
ko: ExportAttribute 또는 ExportFieldAttribute를 사용할 때 Mono.Android.Export.dll에 대한 참조를 추가하세요.
pl: Dodaj odwołanie do pliku Mono.Android.Export.dll w przypadku używania atrybutu ExportAttribute lub ExportFieldAttribute.
pt_br: Adicione uma referência a Mono.Android.Export.dll ao usar ExportAttribute ou ExportFieldAttribute.
ru: При использовании ExportAttribute или ExportFieldAttribute добавьте ссылку на Mono.Android.Export.dll.
zh_hans: 使用 ExportAttribute 或 ExportFieldAttribute 时，请添加对 Mono.Android.Export.dll 的引用。

# XA4211
source: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' is less than $(TargetFrameworkVersion) '{1}'. Using API-{2} for ACW compilation.
cs: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion {0} je méně než $(TargetFrameworkVersion) '{1}'. Pro kompilaci ACW se používá API-{2}.
de: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion "{0}" ist niedriger als $(TargetFrameworkVersion) "{1}". Für die ACW-Kompilierung wird API-{2} verwendet.
es: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion "{0}" es anterior a $(TargetFrameworkVersion) "{1}". Se usa API-{2} para la compilación ACW.
it: La versione //uses-sdk/@android:targetSdkVersion '{0}' di AndroidManifest.xml è precedente a $(TargetFrameworkVersion) '{1}'. Per la compilazione ACW verrà usata l'API {2}.
ja: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' が $(TargetFrameworkVersion) '{1}' より小さいため、ACW のコンパイルに API-{2} を使用します。
ko: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}'이(가) $(TargetFrameworkVersion) '{1}'보다 작습니다. ACW 컴파일에 API-{2}을(를) 사용합니다.
pl: Wersja //uses-sdk/@android:targetSdkVersion w pliku AndroidManifest.xml „{0}” jest niższa niż $(TargetFrameworkVersion) „{1}”. Używanie wersji API-{2} na potrzeby kompilacji ACW.
pt_br: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' é menor que $(TargetFrameworkVersion) '{1}'. Usando a API-{2} para compilação do ACW.
ru: Версия AndroidManifest.xml //uses-sdk/@android:targetSdkVersion "{0}" ниже версии $(TargetFrameworkVersion) "{1}". Использование API-{2} для компиляции ACW.
zh_hans: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion“{0}”小于 $(TargetFrameworkVersion)“{1}”。请使用 API {2} 进行 ACW 编译。

# XA4213
source: The type '{0}' must provide a public default constructor
cs: Typ {0} musí poskytovat veřejný výchozí konstruktor.
de: Der Typ "{0}" muss einen öffentlichen Standardkonstruktor angeben.
es: El tipo "{0}" debe proporcionar un constructor predeterminado público.
it: Il tipo '{0}' deve fornire un costruttore predefinito pubblico
ja: 型 '{0}' には、既定のパブリック コンストラクターを指定する必要があります
ko: '{0}' 형식은 public 기본 생성자를 제공해야 합니다.
pl: Typ „{0}” musi dostarczać publiczny konstruktor domyślny
pt_br: O tipo '{0}' deve fornecer um construtor padrão público
ru: Тип "{0}" должен предоставлять открытый конструктор по умолчанию.
zh_hans: 类型 "{0}" 必须提供公共的默认构造函数

# XA4214
source: The managed type `{0}` exists in multiple assemblies: {1}. Please refactor the managed type names in these assemblies so that they are not identical.
cs: Spravovaný typ {0} existuje ve více sestaveních: {1}. V těchto sestaveních prosím refaktorujte názvy spravovaných typů tak, aby nebyly identické.
de: Der verwaltete Typ "{0}" ist in mehreren Assemblys vorhanden: {1}. Gestalten Sie die Namen der verwalteten Typen in diesen Assemblys so um, dass sie nicht übereinstimmen.
es: El tipo "{0}" administrado existe en varios ensamblados: {1}. Refactorice los nombres de los tipos administrados en estos ensamblados para que no sean idénticos.
it: Il tipo gestito `{0}` è presente in più assembly: {1}. Effettuare il refactoring dei nomi di tipo gestito in questi assembly in modo che non siano identici.
ja: マネージ型 '{0}' が複数のアセンブリに存在します: {1}。これらのアセンブリにあるマネージ型の名前をリファクターして、それらが同一にならないようにしてください。
ko: 관리되는 형식 '{0}'이(가) 여러 어셈블리({1})에 있습니다. 이와 같은 어셈블리의 관리되는 형식 이름을 리팩터링하여 서로 다른 이름을 사용하도록 하세요.
pl: Typ zarządzany „{0}” istnieje w wielu zestawach: {1}. Wykonaj refaktoryzację nazw typów zarządzanych w tych zestawach, aby nie były identyczne.
pt_br: O tipo gerenciado `{0}` existe em vários assemblies: {1}. Refatore os nomes de tipos gerenciados nesses assemblies para que eles não sejam idênticos.
ru: Управляемый тип "{0}" существует в нескольких сборках: {1}. Выполните рефакторинг имен управляемых типов в этих сборках, чтобы они не совпадали.
zh_hans: 托管类型 `{0}` 存在于多个程序集中: {1}。请重构这些程序集中的托管类型名称，使它们不相同。

# XA4214_Result
source: References to the type `{0}` will refer to `{0}, {1}`.
cs: Odkazy na typ {0} budou odkazovat na typ {0}, {1}.
de: Verweise auf den Typ "{0}" verweisen auf "{0}, {1}".
es: Las referencias al tipo "{0}" harán referencia a "{0}, {1}".
it: I riferimenti al tipo `{0}` faranno riferimento a `{0}, {1}`.
ja: 型 '{0}' への参照では、'{0}, {1}' が参照されます。
ko: '{0}' 형식에 대한 참조는 '{0}, {1}'을(를) 참조합니다.
pl: Odwołania do typu „{0}” będą odwoływać się do typu „{0}, {1}”.
pt_br: As referências ao tipo `{0}` farão referência a `{0}, {1}`.
ru: Ссылки на тип "{0}" будут ссылаться на "{0}, {1}".
zh_hans: 对类型 `{0}` 的引用将引用 `{0}, {1}`。

# XA4215
source: The Java type `{0}` is generated by more than one managed type. Please change the [Register] attribute so that the same Java type is not emitted.
cs: Typ Java {0} se generuje více než jedním spravovaným typem. Změňte prosím atribut [Register] tak, aby se negeneroval stejný typ Java.
de: Der Java-Typ "{0}" wird von mehr als einem verwalteten Typ generiert. Ändern Sie das [Register]-Attribut, sodass nicht derselbe Java-Typ ausgegeben wird.
es: Más de un tipo administrado genera el tipo Java "{0}". Cambie el atributo [Register] para que no se emita el mismo tipo Java.
it: Il tipo Java `{0}` è stato generato da più di un tipo gestito. Modificare l'attributo [Register] in modo che non venga creato lo stesso tipo Java.
ja: Java の型 `{0}` は複数のマネージ型によって生成されています。同じ Java の型が生成されないように、[Register] 属性を変更してください。
ko: Java 형식 '{0}'은(는) 둘 이상의 관리형 형식에 의해 생성되었습니다. 같은 Java 형식을 내보내지 않도록 [Register] 특성을 변경하세요.
pl: Typ języka Java „{0}” jest generowany przez więcej niż jeden typ zarządzany. Zmień atrybut [Register], aby ten sam typ języka Java nie był emitowany.
pt_br: O tipo de Java '{0}' é gerado por mais de um tipo gerenciado. Altere o atributo [Register] para que o mesmo tipo de Java não seja emitido.
ru: Тип Java "{0}" создан несколькими управляемыми типами. Измените атрибут [Register] так, чтобы один и тот же тип Java не создавался.
zh_hans: Java 类型 `{0}` 由多个托管类型生成。请更改 [Register] 属性，以确保不发出相同的 Java 类型。

# XA4215_Details
source: `{0}` generated by: {1}
cs: {0} vygenerováno pomocí {1}
de: "{0}" generiert von: {1}
es: "{0}" generado por {1}
it: `{0}` generato da: {1}
ja: `{0}` が以下によって生成されました: {1}
ko: '{0}'은(는) 다음에 의해 생성됨: {1}
pl: Element „{0}” wygenerowany przez zarządzany element „{1}”
pt_br: '{0}' gerado por: {1}
ru: Имя типа: "{0}", создан: {1}
zh_hans: `{0}` 生成类型: {1}

# XA4216_MinSdkVersion
source: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}' is less than API-{1}, this configuration is not supported.
cs: AndroidManifest.xml //uses-sdk/@android:minSdkVersion {0} je méně než API-{1}, tato konfigurace se nepodporuje.
de: AndroidManifest.xml //uses-sdk/@android:minSdkVersion "{0}" ist niedriger als API-{1}, diese Konfiguration wird nicht unterstützt.
es: AndroidManifest.xml //uses-sdk/@android:minSdkVersion "{0}" es anterior a la versión de la API-{1}; no se admite esta configuración.
it: La versione //uses-sdk/@android:minSdkVersion '{0}' di AndroidManifest.xml è precedente all'API {1}. Questa configurazione non è supportata.
ja: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}' が API-{1} よりも小さいため、この構成はサポートされていません。
ko: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}'이(가) API-{1}보다 작으므로 이 구성은 지원되지 않습니다.
pl: Wersja //uses-sdk/@android:minSdkVersion w pliku AndroidManifest.xml „{0}” jest niższa niż API-{1}. Taka konfiguracja nie jest obsługiwana.
pt_br: AndroidManifest.xml //uses-sdk/@android:minSdkVersion '{0}' é menor que a API-{1}, essa configuração não tem suporte.
ru: Версия AndroidManifest.xml //uses-sdk/@android:minSdkVersion "{0}" ниже версии API-{1}, эта конфигурация не поддерживается.
zh_hans: Androidmanifest.xml//uses-sdk/@android: minSdkVersion“{0}”小于 API-{1}，此配置不受支持。

# XA4216_TargetSdkVersion
source: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' is less than API-{1}, this configuration is not supported.
cs: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion {0} je méně než API-{1}, tato konfigurace se nepodporuje.
de: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion "{0}" ist niedriger als API-{1}, diese Konfiguration wird nicht unterstützt.
es: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion "{0}" es anterior a la versión de la API-{1}; esta configuración no se admite.
it: La versione //uses-sdk/@android:targetSdkVersion '{0}' di AndroidManifest.xml è precedente all'API {1}. Questa configurazione non è supportata.
ja: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' が API-{1} よりも小さいため、この構成はサポートされません。
ko: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}'이(가) API-{1}보다 작으므로 이 구성은 지원되지 않습니다.
pl: Wersja //uses-sdk/@android:targetSdkVersion w pliku AndroidManifest.xml „{0}” jest niższa niż API-{1}. Taka konfiguracja nie jest obsługiwana.
pt_br: AndroidManifest.xml //uses-sdk/@android:targetSdkVersion '{0}' é menor que a API-{1}, essa configuração não tem suporte.
ru: Версия AndroidManifest.xml //uses-sdk/@android:targetSdkVersion "{0}" ниже версии API-{1}, эта конфигурация не поддерживается.
zh_hans: Androidmanifest.xml//uses-sdk/@android: targetSdkVersion“{0}”小于 API-{1}，此配置不受支持。

# XA4218
source: Unable to find //manifest/application/uses-library at path: {0}
cs: Nepodařilo se najít položku //manifest/application/uses-library v cestě: {0}
de: "//manifest/application/uses-library" wurde nicht im Pfad "{0}" gefunden.
es: No se puede encontrar //manifest/application/uses-library en la ruta de acceso: {0}
it: Non è possibile trovare //manifest/application/uses-library nel percorso: {0}
ja: パスに //manifest/application/uses-library が見つかりませんでした: {0}
ko: {0} 경로에서 //manifest/application/uses-library를 찾을 수 없습니다.
pl: Nie można znaleźć elementu //manifest/application/uses-library w ścieżce: {0}
pt_br: Não é possível localizar //manifest/application/uses-library no caminho: {0}
ru: Не удалось найти //manifest/application/uses-library по пути: {0}
zh_hans: 在以下路径找不到 //manifest/application/uses-library: {0}

# XA4219
source: Cannot find binding generator for language {0} or {1}.
cs: Nepodařilo se najít generátor vazby pro jazyk {0} nebo {1}.
de: Der Bindungsgenerator für die Sprache {0} oder {1} wurde nicht gefunden.
es: No se encuentra el generador de enlaces para el lenguaje {0} o {1}.
it: Non è possibile trovare il generatore di binding per il linguaggio {0} o {1}.
ja: 言語 {0} または {1} のバインド ジェネレーターが見つかりません。
ko: {0} 또는 {1} 언어에 대한 바인딩 생성기를 찾을 수 없습니다.
pl: Nie można odnaleźć generatora powiązań dla języka {0} ani {1}.
pt_br: Não é possível encontrar o gerador de associação para a linguagem {0} ou {1}.
ru: Не удается найти генератор привязки для языка {0} или {1}.
zh_hans: 找不到语言 {0} 或 {1} 的绑定生成器。

# XA4220
source: Partial class item '{0}' does not have an associated binding for layout '{1}'.
cs: Částečná položka třídy {0} nemá přidruženou vazbu pro rozložení {1}.
de: Das partielle Klassenelement "{0}" besitzt keine zugeordnete Bindung für das Layout "{1}".
es: El elemento de clase parcial "{0}" no tiene ningún enlace asociado para el diseño "{1}".
it: L'elemento di classe parziale '{0}' non contiene un binding associato per il layout '{1}'.
ja: 部分クラス項目 '{0}' には、レイアウト '{1}' に関連付けられたバインドがありません。
ko: partial 클래스 항목 '{0}'에 레이아웃 '{1}'과(와) 연결된 바인딩이 없습니다.
pl: Element klasy częściowej „{0}” nie ma skojarzonego powiązania dla układu „{1}”.
pt_br: O item de classe parcial '{0}' não tem uma associação associada para o layout '{1}'.
ru: С элементом разделяемого класса "{0}" не связана привязка для макета "{1}".
zh_hans: 分部类项“{0}”没有布局“{1}”的关联绑定。

# XA4221
source: No layout binding source files were generated.
cs: Nebyly vygenerovány žádné zdrojové soubory pro vazbu rozložení.
de: Es wurden keine Bindungsquelldateien für das Layout generiert.
es: No se ha generado ningún archivo de origen de enlace del diseño.
it: Non è stato generato alcun file di origine del binding di layout.
ja: レイアウト バインドのソース ファイルが生成されませんでした。
ko: 레이아웃 바인딩 소스 파일이 생성되지 않았습니다.
pl: Nie wygenerowano żadnych plików źródłowych powiązania układu.
pt_br: Não foi gerado nenhum arquivo de origem de associação de layout.
ru: Не были созданы исходные файлы привязки макета.
zh_hans: 未生成任何布局绑定源文件。

# XA4222
source: No widgets found for layout ({0}).
cs: Pro rozložení ({0}) se nenašly žádné widgety.
de: Für das Layout ({0}) wurden keine Widgets gefunden.
es: No se ha encontrado ningún widget para el diseño ({0}).
it: Non sono stati trovati widget per il layout ({0}).
ja: レイアウトのウィジェットが見つかりません ({0})。
ko: 레이아웃({0})에 대한 위젯을 찾을 수 없습니다.
pl: Nie odnaleziono żadnych widżetów dla układu ({0}).
pt_br: Não foi encontrado nenhum widget para o layout ({0}).
ru: Не найдены мини-приложения для макета ({0}).
zh_hans: 找不到布局的小组件({0})。

# XA4223
source: Malformed full class name '{0}'. Missing namespace.
cs: Plný název třídy {0} má chybný formát. Chybí obor názvů.
de: Falsch formatierter vollständiger Klassenname "{0}". Namespace fehlt.
es: El nombre de clase completo "{0}" tiene un formato incorrecto. Falta el espacio de nombres.
it: Il nome della classe completo '{0}' non è valido. Manca lo spazio dei nomi.
ja: 完全なクラス名 '{0}' の形式が正しくありません。名前空間がありません。
ko: 전체 클래스 이름 '{0}'의 형식이 잘못되었습니다. 네임스페이스가 없습니다.
pl: Źle sformułowana pełna nazwa klasy „{0}”. Brak przestrzeni nazw.
pt_br: Nome de classe completo mal formado '{0}'. Namespace ausente.
ru: Полное имя класса "{0}" сформировано неправильно. Отсутствует пространство имен.
zh_hans: 完整类名“{0}”格式错误。缺少命名空间。

# XA4224
source: Malformed full class name '{0}'. Missing class name.
cs: Plný název třídy {0} má chybný formát. Chybí název třídy.
de: Falsch formatierter vollständiger Klassenname "{0}". Klassenname fehlt.
es: El nombre de clase completo "{0}" tiene un formato incorrecto. Falta el nombre de la clase.
it: Il nome della classe completo '{0}' non è valido. Manca il nome della classe.
ja: 完全なクラス名 '{0}' の形式が正しくありません。クラス名がありません。
ko: 전체 클래스 이름 '{0}'의 형식이 잘못되었습니다. 클래스 이름이 없습니다.
pl: Źle sformułowana pełna nazwa klasy „{0}”. Brak nazwy klasy.
pt_br: Nome de classe completo mal formado '{0}'. Nome de classe ausente.
ru: Полное имя класса "{0}" сформировано неправильно. Отсутствует имя класса.
zh_hans: 完整类“{0}”格式错误。缺少类名。

# XA4225
source: Widget '{0}' in layout '{1}' has multiple instances with different types. The property type will be set to: {2}
cs: Widget {0} v rozložení {1} má více instancí s odlišnými typy. Typ vlastnosti se nastaví na: {2}.
de: Das Widget "{0}" im Layout "{1}" weist mehrere Instanzen mit unterschiedlichen Typen auf. Der Eigenschaftentyp wird auf "{2}" festgelegt.
es: El widget "{0}" del diseño "{1}" tiene varias instancias con tipos distintos. El tipo de propiedad se establecerá como {2}
it: Il widget '{0}' nel layout '{1}' contiene più istanze con tipi diversi. Il tipo di proprietà verrà impostato su {2}
ja: レイアウト '{1}' 内のウィジェット '{0}' には、型が異なる複数のインスタンスがあります。プロパティの型は {2} に設定されます
ko: '{1}' 레이아웃의 '{0}' 위젯에 형식이 다른 여러 인스턴스가 있습니다. 속성 형식이 다음으로 설정됩니다. {2}
pl: Widżet „{0}” w układzie „{1}” ma wiele wystąpień o różnych typach. Typ właściwości zostanie skonfigurowany na następującą wartość: {2}
pt_br: O widget '{0}' no layout '{1}' tem várias instâncias com tipos diferentes. O tipo de propriedade será definido como: {2}
ru: Мини-приложение "{0}" в макете "{1}" содержит несколько экземпляров с разными типами. Будет установлен тип свойства {2}
zh_hans: 布局“{1}”中的小组件“{0}”包含多个具有不同类型的实例。属性类型将设置为: {2}

# XA4226
source: Resource item '{0}' does not have the required metadata item '{1}'.
cs: Položka prostředku {0} nemá požadovanou položku metadat {1}.
de: Das Ressourcenelement "{0}" verfügt nicht über das erforderliche Metadatenelement "{1}".
es: El elemento del recurso "{0}" no tiene el elemento de metadatos "{1}" necesario.
it: L'elemento di risorsa '{0}' non contiene l'elemento di metadati richiesto '{1}'.
ja: リソース項目 '{0}' に、必要なメタデータ項目 '{1}' がありません。
ko: 리소스 항목 '{0}'에 필수 메타데이터 항목 '{1}'이(가) 없습니다.
pl: Element zasobu „{0}” nie ma wymaganego elementu metadanych „{1}”.
pt_br: O item de recurso '{0}' não tem o item de metadados necessário '{1}'.
ru: Элемент ресурса "{0}" не включает необходимый элемент метаданных "{1}".
zh_hans: 资源项“{0}”没有所需的元数据项“{1}”。

# XA4228
source: Unable to find specified //activity-alias/@android:targetActivity: '{0}'
cs: Nepovedlo se najít zadané //activity-alias/@android:targetActivity: {0}
de: Die angegebene //activity-alias/@android:targetActivity wurde nicht gefunden: "{0}"
es: No se encuentra el elemento //activity-alias/@android:targetActivity especificado: "{0}"
it: Non è possibile trovare l'attività specificata //activity-alias/@android:targetActivity: '{0}'
ja: 指定された //activity-alias/@android:targetActivity '{0}' が見つかりません
ko: 지정한 //activity-alias/@android:targetActivity를 찾을 수 없음: '{0}'
pl: Nie można znaleźć określonego elementu //activity-alias/@android:targetActivity: „{0}”
pt_br: Não é possível localizar o //activity-alias/@android:targetActivity especificado: '{0}'
ru: Не найдено указанное действие //activity-alias/@android:targetActivity: "{0}".
zh_hans: 找不到指定的 //activity-alias/@android:targetActivity:“{0}”

# XA4229
source: Unrecognized `TransformFile` root element: {0}.
cs: Nerozpoznaný kořenový element TransformFile: {0}
de: Unbekanntes TransformFile-Stammelement: {0}.
es: Elemento raíz "TransformFile" no reconocido: {0}.
it: Elemento radice di `TransformFile` non riconosciuto: {0}.
ja: 認識されない 'TransformFile' ルート要素: {0}。
ko: `TransformFile` 루트 요소 {0}을(를) 인식할 수 없습니다.
pl: Nierozpoznany element główny „TransformFile”: {0}.
pt_br: Elemento raiz `TransformFile` não reconhecido: {0}.
ru: Нераспознанный корневой элемент "TransformFile": {0}.
zh_hans: 无法识别的 "TransformFile" 根元素: {0}。

# XA4230
source: Error parsing XML: {0}
cs: Při parsování XML došlo k chybě: {0}
de: Fehler beim Analysieren von XML: {0}
es: Error al analizar XML: {0}
it: Si è verificato un errore durante l'analisi del file XML: {0}
ja: XML の解析中にエラーが発生しました: {0}
ko: XML 구문 분석 중 오류 발생: {0}
pl: Błąd podczas analizowania kodu XML: {0}
pt_br: Erro ao analisar o XML: {0}
ru: Ошибка анализа XML: {0}
zh_hans: 分析 XML 时出错: {0}

# XA4231
source: The Android class parser value '{0}' is deprecated and will be removed in a future version of Xamarin.Android. Update the project properties to use 'class-parse'.
cs: Hodnota parseru tříd Androidu {0} je zastaralá a v budoucí verzi Xamarin.Androidu se odebere. Aktualizujte vlastnosti projektu tak, aby používaly class-parse.
de: Der Wert "{0}" des Android-Klassenparsers ist veraltet und wird in einer zukünftigen Version von Xamarin.Android entfernt. Aktualisieren Sie die Projekteigenschaften auf die Verwendung von "class-parse".
es: El valor "{0}" del analizador de clases de Android está en desuso y se quitará en una versión futura de Xamarin.Android. Actualice las propiedades del proyecto para usar "class-parse".
it: Il valore '{0}' del parser di classi Android è deprecato e verrà rimosso in una versione futura di Xamarin.Android. Aggiornare le proprietà del progetto in modo da usare 'class-parse'.
ja: Android クラス パーサーの値 '{0}' は非推奨であり、Xamarin.Android の今後のバージョンでは削除されます。'class-parse' を使用するようにプロジェクトのプロパティを更新してください。
ko: Android 클래스 파서 값 '{0}'은(는) 사용되지 않으며 Xamarin.Android의 이후 버전에서 제거됩니다. 'class-parse'를 사용하도록 프로젝트 속성을 업데이트하세요.
pl: Wartość analizatora klas systemu Android „{0}” jest przestarzała i zostanie usunięta w przyszłej wersji rozszerzenia Xamarin.Android. Zaktualizuj właściwości projektu, aby używać literału „class-parse”.
pt_br: O valor do analisador de classe do Android '{0}' foi preterido e será removido em uma versão futura do Xamarin.Android. Atualize as propriedades do projeto para usar 'class-parse'.
ru: Значение "{0}" синтаксического анализатора класса Android является устаревшим и будет удалено в следующей версии Xamarin.Android. Обновите свойства проекта, чтобы использовать "class-parse".
zh_hans: Android 类分析器值“{0}”已被弃用，并将在 Xamarin.Android 的未来版本中被删除。要使用 "class-parse"，请更新项目属性。
