Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# XA4232
source: The Android code generation target '{0}' is deprecated and will be removed in a future version of Xamarin.Android. Update the project properties to use 'XAJavaInterop1'.
cs: Cíl generování kódu pro Androidu {0} je zastaralý a v budoucí verzi Xamarin.Androidu se odebere. Aktualizujte vlastnosti projektu tak, aby používaly XAJavaInterop1.
de: Das Ziel "{0}" für die Android-Codegenerierung ist veraltet und wird in einer zukünftigen Version von Xamarin.Android entfernt. Aktualisieren Sie die Projekteigenschaften auf die Verwendung von "XAJavaInterop1".
es: El destino "{0}" de generación de código de Android está en desuso y se quitará en una versión futura de Xamarin.Android. Actualice las propiedades del proyecto para usar "XAJavaInterop1".
it: La destinazione '{0}' per la generazione del codice Android è deprecato e verrà rimosso in una versione futura di Xamarin.Android. Aggiornare le proprietà del progetto in modo da usare 'XAJavaInterop1'.
ja: Android コード生成ターゲット '{0}' は非推奨であり、Xamarin.Android の今後のバージョンでは削除されます。'XAJavaInterop1' を使用するようにプロジェクトのプロパティを更新してください。
ko: Android 코드 생성 대상 '{0}'은(는) 사용되지 않으며 Xamarin.Android의 이후 버전에서 제거됩니다. 'XAJavaInterop1'을 사용하도록 프로젝트 속성을 업데이트하세요.
pl: Element docelowy generowania kodu systemu Android „{0}” jest przestarzały i zostanie usunięty w przyszłej wersji rozszerzenia Xamarin.Android. Zaktualizuj właściwości projektu, aby używać literału „XAJavaInterop1”.
pt_br: O destino de geração de código Android '{0}' foi preterido e será removido em uma versão futura do Xamarin.Android. Atualize as propriedades do projeto para usar 'XAJavaInterop1'.
ru: Целевой объект "{0}" создания кода Android является устаревшим и будет удален в следующей версии Xamarin.Android. Обновите свойства проекта, чтобы использовать "XAJavaInterop1".
zh_hans: Android 代码生成目标“{0}”已被弃用，并将在 Xamarin.Android 的未来版本中被删除。要使用 "XAJavaInterop1"，请更新项目属性。

# XA4301
source: APK already contains the item {0}; ignoring.
cs: APK už obsahuje položku {0}. Ignoruje se.
de: APK enthält bereits das Element "{0}". Das Element wird ignoriert.
es: APK ya contiene el elemento {0}; omitiendo.
it: L'APK contiene già l'elemento {0}. Verrà ignorato.
ja: APK には既に項目 {0} が含まれています; 無視しています。
ko: APK에 {0} 항목이 이미 포함되어 있습니다. 무시합니다.
pl: Zestaw APK zawiera już element {0}; jest ignorowany.
pt_br: O APK já contém o item {0}. Ignorando.
ru: Пакет APK уже содержит элемент {0}; он будет пропущен.
zh_hans: APK 已包含项 {0}；正在忽略。

# XA4301_ABI
source: Cannot determine ABI of native library '{0}'. Move this file to a directory with a valid Android ABI name such as 'libs/armeabi-v7a/'.
cs: Nejde určit ABI nativní knihovny {0}.
de: ABI der nativen Bibliothek "{0}" kann nicht ermittelt werden.
es: No se puede determinar el ABI de la biblioteca nativa {0}.
it: Non è possibile determinare l'ABI della libreria nativa {0}.
ja: ネイティブ ライブラリ {0} の ABI を特定できません。
ko: 네이티브 라이브러리 {0}의 ABI를 확인할 수 없습니다.
pl: Nie można określić interfejsu ABI natywnej biblioteki {0}.
pt_br: Não é possível determinar o ABI da biblioteca nativa {0}.
ru: Невозможно определить ABI для собственной библиотеки {0}.
zh_hans: 无法确定本机库 {0} 的 ABI。

# XA4301_ABI_Ignoring
source: Could not determine ABI of some native libraries. Ignoring those: {0}
cs: Nepovedlo se určit ABI některých nativních knihoven. Ignorují se: {0}
de: ABI konnte für einige native Bibliotheken nicht ermittelt werden. Diese werden ignoriert: {0}
es: No se pudo determinar el ABI de algunas bibliotecas nativas. Se omitirán esas: {0}
it: Non è stato possibile determinare l'ABI di alcune librerie native. Le seguenti verranno ignorate: {0}
ja: いくつかのネイティブ ライブラリの ABI を特定できませんでした。以下は無視しています: {0}
ko: 일부 네이티브 라이브러리의 ABI를 확인할 수 없습니다. {0}을(를) 무시합니다.
pl: Nie można było określić interfejsu ABI niektórych bibliotek natywnych. Następujące są ignorowane: {0}
pt_br: Não foi possível determinar o ABI de algumas bibliotecas nativas. Ignorando estas: {0}
ru: Не удалось определить ABI для некоторых собственных библиотек. Следующие будут пропущены: {0}.
zh_hans: 无法确定某些本机库的 ABI。正在忽略这些库: {0}

# XA4302
source: Unhandled exception merging `AndroidManifest.xml`: {0}
cs: Při slučování AndroidManifest.xml se vyvolala nezpracovaná výjimka: {0}
de: Unbehandelte Ausnahme beim Zusammenführen von "AndroidManifest.xml": {0}
es: Excepción no controlada al aplicar "merge" a "AndroidManifest.xml": {0}
it: Si è verificata un'eccezione non gestita durante il merge di `AndroidManifest.xml`: {0}
ja: ハンドルされない例外が 'AndroidManifest.xml' をマージしています。{0}
ko: 'AndroidManifest.xml'을(를) 병합하는 중 처리되지 않은 예외 발생: {0}
pl: Nieobsługiwany wyjątek podczas scalania pliku „AndroidManifest.xml”: {0}
pt_br: Exceção sem tratamento ao mesclar `AndroidManifest.xml`: {0}
ru: Слияние необработанных исключений "AndroidManifest.xml": {0}
zh_hans: 合并 `AndroidManifest.xml` 时出现未经处理的异常: {0}

# XA4303
source: Error extracting resources from "{0}": {1}
cs: Při extrakci prostředků z {0} došlo k chybě: {1}
de: Fehler beim Extrahieren von Ressourcen aus "{0}": {1}
es: Error al extraer los recursos de "{0}": {1}
it: Si è verificato un errore durante l'estrazione delle risorse da "{0}": {1}
ja: "{0}" からのリソースの抽出でエラーが発生しました。{1}
ko: "{0}"에서 리소스를 추출하는 중 오류 발생: {1}
pl: Błąd podczas wyodrębniania zasobów z pliku „{0}”: {1}
pt_br: Erro ao extrair recursos de "{0}": {1}
ru: Ошибка при извлечении ресурсов из "{0}": {1}
zh_hans: 从 "{0}" 提取资源时出错: {1}

# XA4304
source: ProGuard configuration file '{0}' was not found.
cs: Konfigurační soubor ProGuard {0} nebyl nalezen.
de: Die ProGuard-Konfigurationsdatei "{0}" wurde nicht gefunden.
es: No se encontró el archivo de configuración de ProGuard "{0}".
it: Il file di configurazione '{0}' di ProGuard non è stato trovato.
ja: ProGuard 構成ファイル '{0}' が見つかりませんでした。
ko: ProGuard 구성 파일 '{0}'을(를) 찾을 수 없습니다.
pl: Nie znaleziono pliku konfiguracji programu ProGuard „{0}”.
pt_br: O arquivo de configuração do ProGuard '{0}' não foi encontrado.
ru: Не удалось найти файл конфигурации ProGuard "{0}".
zh_hans: 未找到 ProGuard 配置文件 "{0}"。

# XA4305
source: Multidex is enabled, but `$(_AndroidMainDexListFile)` is empty.
cs: Multidex je povolený, ale soubor $(_AndroidMainDexListFile) je prázdný.
de: Multidex ist aktiviert, aber "$(_AndroidMainDexListFile)" ist leer.
es: Multidex está habilitado, pero "$(_AndroidMainDexListFile)" está vacío.
it: Multidex è abilitato, ma `$(_AndroidMainDexListFile)` è vuoto.
ja: Multidex が有効になっていますが、`$(_AndroidMainDexListFile)` が空です。
ko: Multidex가 사용하도록 설정되어 있지만, '$(_AndroidMainDexListFile)'이 비어 있습니다.
pl: Biblioteka Multidex jest włączona, ale plik „$(_AndroidMainDexListFile)” jest pusty.
pt_br: Multidex está habilitado, mas '$(_AndroidMainDexListFile)' está vazio.
ru: Multidex включен, но "$(_AndroidMainDexListFile)" пуст.
zh_hans: 已启用 Multidex，但 `$(_AndroidMainDexListFile)` 为空。

# XA4305_File_Missing
source: Multidex is enabled, but the `$(_AndroidMainDexListFile)` file '{0}' does not exist.
cs: Multidex je povolený, ale soubor $(_AndroidMainDexListFile) {0} neexistuje.
de: Multidex ist aktiviert, aber die $(_AndroidMainDexListFile)-Datei "{0}" ist nicht vorhanden.
es: Multidex está habilitado, pero el archivo "$(_AndroidMainDexListFile)" "{0}" no existe.
it: Multidex è abilitato, ma il file '{0}' `$(_AndroidMainDexListFile)` non esiste.
ja: Multidex が有効になっていますが、`$(_AndroidMainDexListFile)` ファイル '{0}' が存在しません。
ko: Multidex가 사용하도록 설정되어 있지만, '$(_AndroidMainDexListFile)' 파일 '{0}'이(가) 없습니다.
pl: Biblioteka Multidex jest włączona, ale plik „$(_AndroidMainDexListFile)” „{0}” nie istnieje.
pt_br: Multidex está habilitado, mas o arquivo '$(_AndroidMainDexListFile)' '{0}' não existe.
ru: Multidex включен, но файл "$(_AndroidMainDexListFile)" "{0}" не существует.
zh_hans: 已启用 Multidex，但 `$(_AndroidMainDexListFile)` 文件“{0}”不存在。

# XA4306
source: R8 does not support `@(MultiDexMainDexList)` files when android:minSdkVersion >= 21
cs: R8 nepodporuje soubory @(MultiDexMainDexList), když je android:minSdkVersion >= 21.
de: R8 unterstützt keine @(MultiDexMainDexList)-Dateien, wenn "android:minSdkVersion" größer oder gleich 21 ist.
es: R8 no admite archivos "@(MultiDexMainDexList)" cuando android:minSdkVersion >= 21
it: R8 non supporta i file di `@(MultiDexMainDexList)` quando android:minSdkVersion >= 21
ja: android:minSdkVersion が 21 以上の場合、R8 では `@(MultiDexMainDexList)` ファイルはサポートされません。
ko: android:minSdkVersion >= 21인 경우 R8은 '@(MultiDexMainDexList)' 파일을 지원하지 않습니다.
pl: Element R8 nie obsługuje plików „@(MultiDexMainDexList)”, jeśli wartość właściwości android:minSdkVersion jest większa lub równa 21
pt_br: A R8 não dá suporte a arquivos '@(MultiDexMainDexList)' quando android:minSdkVersion >= 21
ru: R8 не поддерживает файлы "@(MultiDexMainDexList)", если android:minSdkVersion >= 21.
zh_hans: 当 android:minSdkVersion >= 21，R8 不支持 `@(MultiDexMainDexList)` 文件

# XA4307
source: Invalid ProGuard configuration file. {0}
cs: Neplatný konfigurační soubor ProGuard. {0}
de: Ungültige ProGuard-Konfigurationsdatei. {0}
es: Archivo de configuración de ProGuard no válido. {0}
it: Il file di configurazione di ProGuard non è valido. {0}
ja: ProGuard 構成ファイルが無効です。{0}
ko: ProGuard 구성 파일이 잘못되었습니다. {0}
pl: Nieprawidłowy plik konfiguracji programu ProGuard. {0}
pt_br: Arquivo de configuração do ProGuard inválido. {0}
ru: Недопустимый файл конфигурации ProGuard. {0}
zh_hans: ProGuard 配置文件无效。{0}

# XA4308
source: Failed to generate type maps
cs: Nepovedlo se vygenerovat mapy typů.
de: Fehler beim Generieren von Typzuordnungen.
es: No se pudieron generar las asignaciones de tipo.
it: Non è stato possibile generare i mapping dei tipi
ja: 型のマップを生成できませんでした
ko: 형식 맵을 생성하지 못했습니다.
pl: Nie można wygenerować map typów
pt_br: Falha ao gerar mapas de tipo
ru: Не удалось создать сопоставления типов.
zh_hans: 无法生成类型映射

# XA4309
source: 'MultiDexMainDexList' file '{0}' does not exist.
cs: Soubor MultiDexMainDexList {0} neexistuje.
de: Die MultiDexMainDexList-Datei "{0}" ist nicht vorhanden.
es: El archivo "MultiDexMainDexList" "{0}" no existe.
it: Il file '{0}' di 'MultiDexMainDexList' non esiste.
ja: 'MultiDexMainDexList' ファイル '{0}' が存在しません。
ko: 'MultiDexMainDexList' 파일 '{0}'이(가) 없습니다.
pl: Plik „MultiDexMainDexList” „{0}” nie istnieje.
pt_br: O arquivo 'MultiDexMainDexList' '{0}' não existe.
ru: Файл MultiDexMainDexList "{0}" не существует.
zh_hans: MultiDexMainDexList 文件“{0}”不存在。

# XA4310
source: `{0}` file `{1}` could not be found.
cs: Soubor {0} {1} se nepovedlo najít.
de: Die {0}-Datei "{1}" wurde nicht gefunden.
es: No se ha encontrado el archivo "{1}" de "{0}".
it: Non è stato possibile trovare il file `{1}` di `{0}`.
ja: '{0}' ファイル '{1}' が見つかりませんでした。
ko: '{0}' 파일 '{1}'을(를) 찾을 수 없습니다.

# XA4311
source: The application won't contain the paired Wear package because the Wear application package APK is not created yet. If building on the command line, be sure to build the "SignAndroidPackage" target.
cs: Aplikace nebude obsahovat spárovaný balíček Wear, protože ještě není vytvořen soubor APK pro balíček aplikace Wear. Při sestavování na příkazovém řádku nezapomeňte sestavit cíl SignAndroidPackage.
de: Die Anwendung enthält nicht das gekoppelte Wear-Paket, weil das Wear-Anwendungspaket "APK" noch nicht erstellt wurde. Stellen Sie bei einer Kompilierung über die Befehlszeile sicher, dass Sie das Ziel "SignAndroidPackage" erstellen.
es: La aplicación no contendrá el paquete Wear emparejado porque aún no se ha creado el archivo APK del paquete de la aplicación Wear. Si se está compilando en la línea de comandos, asegúrese de compilar el destino "SignAndroidPackage".
it: L'applicazione non conterrà il pacchetto Wear associato perché non è ancora stato creato il file APK del pacchetto dell'applicazione Wear. Se si compila dalla riga di comando, assicurarsi di compilare la destinazione "SignAndroidPackage".
ja: Wear アプリケーション パッケージ APK がまだ作成されていないため、アプリケーションにはペアリングされた Wear パッケージは含まれません。コマンド ラインでビルドする場合は、"SignAndroidPackage" ターゲットをビルドしてください。
ko: Wear 애플리케이션 패키지 APK가 아직 만들어지지 않았기 때문에 애플리케이션에 페어링된 Wear 패키지가 포함되지 않습니다. 명령줄에서 빌드하는 경우 "SignAndroidPackage" 대상을 빌드해야 합니다.
pl: Aplikacja nie będzie zawierać sparowanego pakietu systemu Wear, ponieważ plik APK pakietu aplikacji systemu Wear nie został jeszcze utworzony. W przypadku kompilowania z poziomu wiersza polecenia pamiętaj, aby skompilować element docelowy „SignAndroidPackage”.
pt_br: O aplicativo não conterá o pacote do Wear emparelhado porque o APK do pacote de aplicativos do Wear ainda não foi criado. Se estiver criando na linha de comando, não se esqueça de criar o destino "SignAndroidPackage".
ru: Приложение не будет содержать связанный пакет Wear, так как пакет APK приложения Wear еще не создан. При сборке в командной строке необходимо выполнить сборку целевого объекта "SignAndroidPackage".
zh_hans: 应用程序不包含配对的 Wear 包，因为尚未创建 Wear 应用程序包 APK。如果在命令行上生成，请确保生成 "SignAndroidPackage" 目标。

# XA4312
source: Referencing the Android Wear application project '{0}' from an Android application project is deprecated and will no longer be supported in a future version of Xamarin.Android. Remove the Android Wear application project reference from the Android application project and distribute the Wear application as a standalone application instead.
cs: Odkazování na projekt aplikace pro Android Wear {0} z projektu aplikace pro Android je zastaralé a v budoucí verzi Xamarin.Androidu se už nebude podporovat. Odeberte odkaz na projekt aplikace pro Android Wear z projektu aplikace pro Android a distribuujte aplikaci pro Wear jako samostatnou aplikaci.
de: Verweise von einem Android-Anwendungsprojekt auf das Android Wear-Anwendungsprojekt "{0}" ist veraltet und wird in zukünftigen Versionen von Xamarin.Android nicht mehr unterstützt. Entfernen Sie den Verweis auf das Android Wear-Anwendungsprojekt aus dem Android-Anwendungsprojekt, und verteilen Sie die Wear-Anwendung stattdessen als eigenständige Anwendung.
es: La referencia al proyecto de aplicación Android Wear "{0}" de un proyecto de aplicación Android está en desuso y ya no se admitirá en una versión futura de Xamarin.Android. Quítela y distribuya en cambio la aplicación Wear como una aplicación independiente.
it: Il riferimento a un progetto applicazione Android Wear '{0}' da un progetto Applicazione Android è deprecato e non sarà più supportato in una versione futura di Xamarin.Android. Rimuovere il riferimento al progetto Applicazione Android Wear dal progetto Applicazione Android e distribuire l'applicazione Wear come applicazione autonoma.
ja: Android アプリケーション プロジェクトから Android Wear アプリケーション プロジェクト '{0}' を参照することは非推奨となり、Xamarin.Android の今後のバージョンではサポートされなくなります。Android アプリケーション プロジェクトから Android Wear アプリケーション プロジェクト参照を削除し、代わりにスタンドアロン アプリケーションとして Wear アプリケーションを配布してください。
ko: Android 애플리케이션 프로젝트에서 Android Wear 애플리케이션 프로젝트 '{0}'을(를) 참조하는 기능은 사용되지 않으며 Xamarin.Android의 이후 버전에서 더 이상 지원되지 않습니다. Android 애플리케이션 프로젝트에서 Android Wear 애플리케이션 프로젝트 참조를 제거하고 대신 Wear 애플리케이션을 독립 실행형 애플리케이션으로 배포하세요.
pl: Odwoływanie się do projektu aplikacji dla systemu Android Wear „{0}” z projektu aplikacji dla systemu Android jest przestarzałe i nie będzie już obsługiwane w przyszłej wersji programu Xamarin.Android. Usuń odwołanie do projektu aplikacji dla systemu Android Wear z projektu aplikacji dla systemu Android i dystrybuuj aplikację dla systemu Wear jako autonomiczną aplikację.
pt_br: A referência ao projeto de aplicativo Wear Android '{0}' de um projeto de aplicativo Android foi preterida e não haverá mais suporte para ela em uma versão futura do Xamarin.Android. Remova a referência ao projeto de aplicativo Wear Android do projeto de aplicativo Android e distribua o aplicativo Wear como um aplicativo autônomo.
ru: Использование ссылки на проект приложения Android Wear "{0}" из проекта приложения Android является нерекомендуемым, и в будущей версии Xamarin.Android поддержка такой ссылки будет прекращена. Удалите ссылку на проект приложения Android Wear из проекта приложения Android и распространяйте приложение Wear в качестве автономного приложения.
zh_hans: 已弃用从 Android 应用程序项目中引用 Android Wear 应用程序项目“{0}”的功能，并且未来版本的 Xamarin.Android 中将不再支持此功能。请从 Android 应用程序项目中删除 Android Wear 应用程序项目引用，并将 Wear 应用程序作为独立应用程序进行分发。

# XA5101
source: Missing Android NDK toolchains directory '{0}'. Please install the Android NDK.
cs: Chybí adresář sady nástrojů Android NDK {0}. Nainstalujte prosím sadu Android NDK.
de: Das Android NDK-Toolkettenverzeichnis "{0}" fehlt. Installieren Sie das Android NDK.
es: Falta el directorio de cadenas de herramientas de Android NDK "{0}". Instale Android NDK.
it: La directory '{0}' delle toolchain di Android NDK non è presente. Installare Android NDK.
ja: Android NDK のツールチェーン ディレクトリ '{0}' がありません。Android NDK をインストールしてください。
ko: Android NDK 도구 체인 디렉터리 '{0}'이(가) 없습니다. Android NDK를 설치하세요.
pl: Brak katalogu łańcuchów narzędzi zestawu Android NDK „{0}”. Zainstaluj zestaw Android NDK.
pt_br: O diretório de cadeias de ferramentas '{0}' do Android NDK está ausente. Instale o Android NDK.
ru: Отсутствует каталог цепочек инструментов Android NDK "{0}". Установите Android NDK.
zh_hans: 缺少 Android NDK 工具链目录“{0}”。请安装 Android NDK。

# XA5101_C_Compiler
source: C compiler for target {0} was not found. Tried paths: "{1}"
cs: Kompilátor jazyka C pro cíl {0} se nenašel. Vyzkoušely se tyto cesty: {1}
de: Der C-Compiler für das Ziel "{0}" wurde nicht gefunden. Durchsuchte Pfade: {1}
es: No se encontró el compilador de C para el destino {0}. Rutas de acceso probadas: "{1}"
it: Il compilatore C per la destinazione {0} non è stato trovato. Percorsi provati: "{1}"
ja: ターゲット {0} の C コンパイラが見つかりませんでした。試行したパス: "{1}"
ko: 대상 {0}용 C 컴파일러를 찾을 수 없습니다. 시도한 경로: "{1}"
pl: Nie znaleziono kompilatora języka C dla docelowej architektury {0}. Sprawdzone ścieżki: „{1}”
pt_br: O compilador C do {0} de destino não foi encontrado. Caminhos tentados: "{1}"
ru: Компилятор C для целевой архитектуры {0} не найден. Проверенные пути: "{1}".
zh_hans: 找不到目标 {0} 的 C 编译器。已尝试的路径:“{1}”

# XA5101_Toolchain
source: Toolchain directory for target {0} was not found.
cs: Adresář sady nástrojů pro cíl {0} se nenašel.
de: Das Toolkettenverzeichnis für das Ziel "{0}" wurde nicht gefunden.
es: No se encontró el directorio de cadena de herramientas para el destino {0}.
it: La directory della toolchain per la destinazione {0} non è stata trovata.
ja: ターゲット {0} のためのツールチェーン ディレクトリが見つかりませんでした。
ko: 대상 {0}용 도구 체인 디렉터리를 찾을 수 없습니다.
pl: Nie znaleziono katalogu łańcucha narzędzi dla docelowej architektury {0}.
pt_br: O diretório de cadeia ferramentas do {0} de destino não foi encontrado.
ru: Каталог цепочки инструментов для целевой архитектуры {0} не найден.
zh_hans: 找不到目标 {0} 的工具链目录。

# XA5102
source: Conversion from assembly to native code failed. Exit code {0}
cs: Převod ze sestavení na nativní kód se nezdařil. Ukončovací kód {0}
de: Fehler beim Konvertieren der Assembly in nativen Code. Exitcode: {0}
es: No se pudo realizar la conversión de ensamblado a código nativo. Código de salida {0}
it: La conversione da assembly a codice nativo non è riuscita. Codice di uscita: {0}
ja: アセンブリからネイティブ コードへの変換に失敗しました。終了コード {0}
ko: 어셈블리에서 네이티브 코드로 변환하지 못했습니다. 종료 코드 {0}
pl: Konwersja z zestawu do kodu natywnego nie powiodła się. Kod zakończenia {0}
pt_br: Falha na conversão de assembly em código nativo. Código de saída {0}
ru: Не удалось выполнить преобразование из сборки в машинный код. Код выхода: {0}.
zh_hans: 从程序集到本机代码转换失败。退出代码 {0}

# XA5103
source: NDK C compiler exited with an error. Exit code {0}
cs: Kompilátor NDK C byl ukončen s chybou. Ukončovací kód {0}
de: Der NDK C-Compiler wurde mit einem Fehler beendet. Exitcode: {0}
es: El compilador de C del NDK se cerró con un error. Código de salida {0}
it: Il compilatore C di NDK è stato terminato con un errore. Codice di uscita: {0}
ja: NDK C コンパイラがエラーで終了しました。終了コード {0}
ko: NDK C 컴파일러가 오류로 인해 종료되었습니다. 종료 코드 {0}
pl: Kompilator języka C zestawu NDK zakończył pracę z błędem. Kod zakończenia {0}
pt_br: O compilador NDK C foi encerrado com um erro. Código de saída {0}
ru: Компилятор NDK C завершил работу с ошибкой. Код выхода: {0}.
zh_hans: NDK C 编译器已退出，但出现错误。退出代码 {0}

# XA5104
source: Could not locate the Android NDK. Please make sure the Android NDK is installed in the Android SDK Manager, or if using a custom NDK path, please ensure the $(AndroidNdkDirectory) MSBuild property is set to the custom path.
cs: Nepovedlo se najít sadu Android NDK. Ujistěte se prosím, že v Android SDK Manageru je nainstalovaná sada Android NDK, nebo pokud používáte vlastní cestu k sadě NDK, ujistěte se prosím, že vlastnost MSBuildu $(AndroidNdkDirectory) je nastavená na danou vlastní cestu.
de: Das Android NDK wurde nicht gefunden. Stellen Sie sicher, dass das Android NDK im Android SDK Manager installiert ist, oder stellen Sie bei Verwendung eines benutzerdefinierten NDK-Pfads sicher, dass die MSBuild-Eigenschaft "$(AndroidNdkDirectory)" auf den benutzerdefinierten Pfad festgelegt ist.
es: No se pudo encontrar Android NDK. Asegúrese de que está instalado en el Administrador de Android SDK o, si usa una ruta de acceso de NDK personalizada, asegúrese de que la propiedad $(AndroidNdkDirectory) de MSBuild está establecida en la ruta de acceso personalizada.
it: Non è stato possibile trovare Android NDK. Assicurarsi che Android NDK sia installato in Gestione Android SDK, oppure se si usa un percorso NDK personalizzato, assicurarsi che la proprietà $(AndroidNdkDirectory) di MSBuild sia impostata sul percorso personalizzato.
ja: Android NDK が見つかりませんでした。Android NDK が Android SDK マネージャーにインストールされていることを確認するか、カスタムの NDK パスを使用している場合は、$(AndroidNdkDirectory) MSBuild プロパティがカスタム パスに設定されていることを確認してください。
ko: Android NDK를 찾을 수 없습니다. Android SDK 관리자에 Android NDK가 설치되어 있는지 확인하거나, 사용자 지정 NDK 경로를 사용하는 경우 $(AndroidNdkDirectory) MSBuild 속성이 사용자 지정 경로로 설정되어 있는지 확인하세요.
pl: Nie można było zlokalizować zestawu Android NDK. Upewnij się, że zestaw Android NDK jest zainstalowany w Menedżerze zestawów Android SDK, a jeśli używana jest niestandardowa ścieżka zestawu NDK, upewnij się, że właściwość $(AndroidNdkDirectory) narzędzia MSBuild jest ustawiona na ścieżkę niestandardową.
pt_br: Não foi possível localizar o Android NDK. Verifique se o Android NDK está instalado no Gerenciador de SDK Android ou, se estiver usando um caminho personalizado do NDK, verifique se a propriedade $(AndroidNdkDirectory) do MSBuild está definida para o caminho personalizado.
ru: Не удалось найти Android NDK. Проверьте установку этого пакета в Диспетчере SDK Android, а если используется особый путь к NDK, этот путь должен быть задан в свойстве MSBuild $(AndroidNdkDirectory).
zh_hans: 找不到 Android NDK。请确保在 Android SDK 管理器中安装 Android NDK，或者如果使用自定义 NDK 路径，请确保将 $(AndroidNdkDirectory) MSBuild 属性设置为自定义路径。

# XA5105
source: Toolchain utility '{0}' for target {1} was not found. Tried in path: "{2}"
cs: Nástroj sady nástrojů {0} pro cíl {1} se nenašel. Prohledala se tato cesta: {2}
de: Das Toolketten-Hilfsprogramm "{0}" für das Ziel "{1}" wurde nicht gefunden. Durchsuchter Pfad: {2}
es: No se encontró la utilidad de cadena de herramientas "{0}" para el destino {1}. Se intentó en la ruta de acceso: "{2}"
it: L'utilità '{0}' della toolchain per la destinazione {1} non è stata trovata. Tentativi effettuati nel percorso: "{2}"
ja: ターゲット {1} のためのツールチェーン ユーティリティ '{0}' が見つかりませんでした。試行したパス: "{2}"
ko: 대상 {1}용 도구 체인 유틸리티 '{0}'을(를) 찾을 수 없습니다. 시도한 경로: "{2}"
pl: Nie znaleziono programu łańcucha narzędzi „{0}” dla docelowej architektury {1}. Sprawdzone ścieżki: „{2}”
pt_br: O utilitário de cadeia de ferramentas '{0}' para o {1} de destino não foi encontrado. Foi tentado o caminho: "{2}"
ru: Служебная программа "{0}" цепочки инструментов для целевой архитектуры {1} не найдена. Проверенный путь: "{2}".
zh_hans: 找不到目标 {1} 的工具链实用工具“{0}”。已尝试的路径:“{2}”
