Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# XA0104
source: Invalid value for `$(AndroidSequencePointsMode)`: {0}
cs: Neplatná hodnota pro $(AndroidSequencePointsMode): {0}
de: Ungültiger Wert für "$(AndroidSequencePointsMode)": {0}
es: Valor no válido para "$(AndroidSequencePointsMode)": {0}
it: Valore non valido per `$(AndroidSequencePointsMode)`: {0}
ja: '$(AndroidSequencePointsMode)' の値が無効です: {0}
ko: '$(AndroidSequencePointsMode)'의 잘못된 값: {0}
pl: Nieprawidłowa wartość parametru „$(AndroidSequencePointsMode)”: {0}
pt_br: Valor inválido de `$(AndroidSequencePointsMode)`: {0}
ru: Недопустимое значение для "$(AndroidSequencePointsMode)": {0}
zh_hans: `$(AndroidSequencePointsMode)` 的无效值: {0}

# XA0105
source: The $(TargetFrameworkVersion) for {0} ({1}) is greater than the $(TargetFrameworkVersion) for the application project ({2}). Please increase the $(TargetFrameworkVersion) for the application project.
cs: $(TargetFrameworkVersion) pro {0} ({1}) je větší než $(TargetFrameworkVersion) pro projekt aplikace ({2}). Zvyšte prosím $(TargetFrameworkVersion) aplikačního projektu.
de: Die $(TargetFrameworkVersion) für "{0}" ({1}) ist höher als die $(TargetFrameworkVersion) für das Anwendungsprojekt ({2}). Erhöhen Sie die $(TargetFrameworkVersion) für das Anwendungsprojekt.
es: El valor de $(TargetFrameworkVersion) de {0} ({1}) es mayor que el valor de $(TargetFrameworkVersion) del proyecto de aplicación ({2}). Aumente el valor de $(TargetFrameworkVersion) del proyecto de aplicación.
it: Il valore di $(TargetFrameworkVersion) per {0} ({1}) è maggiore di quello di $(TargetFrameworkVersion) per il progetto dell'applicazione ({2}). Aumentare il valore di $(TargetFrameworkVersion) per il progetto dell'applicazione.
ja: {0} ({1}) の $(TargetFrameworkVersion) が、アプリケーション プロジェクト ({2}) の $(TargetFrameworkVersion) よりも大きくなっています。アプリケーション プロジェクトの $(TargetFrameworkVersion) を大きくしてください。
ko: {0}({1})의 $(TargetFrameworkVersion)이 애플리케이션 프로젝트({2})의 $(TargetFrameworkVersion)보다 큽니다. 애플리케이션 프로젝트의 $(TargetFrameworkVersion)을 늘리세요.
pl: Parametr $(TargetFrameworkVersion) dla elementu {0} ({1}) jest większy niż parametr $(TargetFrameworkVersion) dla projektu aplikacji ({2}). Zwiększ wartość parametru $(TargetFrameworkVersion) dla projektu aplikacji.
pt_br: A $(TargetFrameworkVersion) de {0} ({1}) é superior à $(TargetFrameworkVersion) do projeto de aplicativo ({2}). Aumente a $(TargetFrameworkVersion) do projeto de aplicativo.
ru: $(TargetFrameworkVersion) для {0} ({1}) выше $(TargetFrameworkVersion) для проекта приложения ({2}). Используйте более новую версию $(TargetFrameworkVersion) для проекта приложения.
zh_hans: {0} 的 $(TargetFrameworkVersion) ({1})大于应用程序项目的 $(TargetFrameworkVersion) ({2})。请增大应用程序项目的 $(TargetFrameworkVersion)。

# XA0107
source: {0} is a Reference Assembly.
cs: {0} je referenční sestavení.
de: "{0}" ist eine Referenzassembly.
es: {0} es un ensamblado de referencia.
it: {0} è un assembly di riferimento.
ja: {0} は参照アセンブリです。
ko: {0}은(는) 참조 어셈블리입니다.
pl: {0} to zestaw odwołania.
pt_br: {0} é um Assembly de Referência.
ru: {0} является базовой сборкой.
zh_hans: {0} 是引用程序集。

# XA0107_Ignoring
source: Ignoring Reference Assembly `{0}`.
cs: Ignoruje se referenční sestavení {0}.
de: Die Referenzassembly "{0}" wird ignoriert.
es: Omitiendo el ensamblado de referencia "{0}".
it: L'assembly di riferimento `{0}` verrà ignorato.
ja: 参照アセンブリ '{0}' を無視しています。
ko: 참조 어셈블리 '{0}'을(를) 무시합니다.
pl: Ignorowanie zestawu odwołania „{0}”.
pt_br: Ignorando o Assembly de Referência `{0}`.
ru: Базовая сборка "{0}" будет пропущена.
zh_hans: 正在忽略引用程序集 `{0}`。

# XA0108
source: Could not get version from '{0}'. Defaulting to 1.0
cs: Nepovedlo se získat verzi z nástroje {0}. Nastavuje se výchozí hodnota 1.0.
de: Die Version konnte nicht aus "{0}" abgerufen werden. Es wird die Standardeinstellung 1.0 verwendet.
es: No se pudo obtener la versión de "{0}". Se tomará como valor predeterminado 1.0
it: Non è stato possibile ottenere la versione da '{0}'. Come impostazione predefinita verrà usata 1.0
ja: '{0}' からバージョンを取得できませんでした。既定で 1.0 を使用します
ko: '{0}'에서 버전을 가져올 수 없습니다. 기본값인 1.0으로 설정합니다.
pl: Nie można pobrać wersji z elementu „{0}”. Zostanie użyta wartość domyślna 1.0.
pt_br: Não foi possível obter a versão de '{0}'. Usando 1.0 como padrão
ru: Не удалось получить версию из "{0}". Устанавливается версия по умолчанию (1.0).
zh_hans: 无法从 "{0}" 获取版本。将采用默认值 1.0

# XA0116
source: Unable to find `EmbeddedResource` named `{0}`.
cs: Nepovedlo se najít EmbeddedResource s názvem {0}.
de: Die EmbeddedResource namens "{0}" wurde nicht gefunden.
es: No se encuentra el elemento "EmbeddedResource" llamado "{0}".
it: Non è possibile trovare l'elemento `EmbeddedResource` denominato `{0}`.
ja: `{0}` という名前の `EmbeddedResource` が見つかりません。
ko: 이름이 '{0}'인 'EmbeddedResource'를 찾을 수 없습니다.
pl: Nie można odnaleźć elementu „EmbeddedResource” o nazwie „{0}”.
pt_br: Não é possível encontrar 'EmbeddedResource' com o nome '{0}'.
ru: Не удалось найти "EmbeddedResource" с именем "{0}".
zh_hans: 找不到名为 `{0}` 的 `EmbeddedResource`。

# XA0117
source: The TargetFrameworkVersion {0} is deprecated. Please update it to be v5.0 or higher.
cs: Hodnota {0} pro TargetFrameworkVersion je zastaralá. Aktualizujte prosím tuto hodnotu na v5.0 nebo vyšší.
de: Die TargetFrameworkVersion {0} ist veraltet. Führen Sie eine Aktualisierung auf Version 5.0 oder höher durch.
es: El valor de TargetFrameworkVersion {0} está en desuso. Actualícelo a v5.0 o superior.
it: TargetFrameworkVersion {0} è deprecato. Aggiornarlo alla versione 5.0 o successiva.
ja: TargetFrameworkVersion {0} は非推奨です。v5.0 以上に更新してください。
ko: TargetFrameworkVersion {0}은(는) 사용되지 않습니다. v5.0 이상으로 업데이트하세요.
pl: Wartość {0} dla elementu TargetFrameworkVersion jest przestarzała. Zaktualizuj ją na wartość v5.0 lub wyższą.
pt_br: A TargetFrameworkVersion {0} foi preterida. Atualize para a v5.0 ou superior.
ru: Версия TargetFrameworkVersion {0} является нерекомендуемой. Обновите ее как минимум до v5.0.
zh_hans: TargetFrameworkVersion {0} 已弃用。请将其更新到 v5.0 或更高版本。

# XA0118_Parse
source: Could not parse '{0}'
cs: Nepodařilo se analyzovat {0}.
de: "{0}" konnte nicht analysiert werden.
es: No se pudo analizar "{0}"
it: Non è stato possibile analizzare '{0}'
ja: '{0}' を解析できませんでした
ko: '{0}'을(를) 구문 분석할 수 없습니다.
pl: Nie można przeanalizować elementu „{0}”
pt_br: Não foi possível analisar '{0}'
ru: Не удалось проанализировать "{0}".
zh_hans: 无法分析 "{0}"

# XA0118_Target
source: Could not resolve `target` in lock file for '{0}'
cs: Nepodařilo se vyhodnotit target v souboru zámku pro: {0}.
de: "target" konnte in der Sperrdatei für "{0}" nicht aufgelöst werden.
es: No se pudo resolver "target" en el archivo de bloqueo para "{0}"
it: Non è stato possibile risolvere `target` nel file di blocco per '{0}'
ja: '{0}' のロック ファイルで 'target' を解決できませんでした
ko: '{0}'의 잠금 파일에서 'target'을 확인할 수 없습니다.
pl: Nie można rozpoznać elementu „target” w pliku blokady dla elementu „{0}”
pt_br: Não foi possível resolver `target` no arquivo de bloqueio de '{0}'
ru: Не удалось разрешить "Target" в файле блокировки для "{0}".
zh_hans: 无法解析 "{0}" 的锁定文件中的 `target`

# XA0119_AOT
source: Using fast deployment and AOT at the same time is not recommended. Use fast deployment for Debug configurations and AOT for Release configurations.
cs: Používání rychlého nasazení a AOT najednou se nedoporučuje. Pro konfigurace Debug použijte rychlé nasazení, pro konfigurace Release pak AOT.
de: Von der gleichzeitigen Verwendung der schnellen Bereitstellung und der AOT wird abgeraten. Verwenden Sie die schnelle Bereitstellung für Debugkonfigurationen und die AOT für Releasekonfigurationen.
es: No se recomienda usar una implementación rápida y AOT al mismo tiempo. Use la implementación rápida para configuraciones de Debug y AOT para configuraciones de Release.
it: L'uso contestuale della distribuzione rapida e di AOT è sconsigliato. Usare la distribuzione rapida per le configurazioni di debug e AOT per le configurazioni di versione.
ja: 高速展開と AOT を同時に使用することはお勧めしません。Debug 構成には高速展開、Release 構成には AOT を使用してください。
ko: 빠른 배포와 AOT를 동시에 사용하는 것은 좋지 않습니다. Debug 구성에 빠른 배포를 사용하고, Release 구성에 AOT를 사용하세요.
pl: W tym samym czasie nie zaleca się korzystania z funkcji szybkiego wdrażania i drzewa obiektów aplikacji (AOT). Użyj szybkiego wdrażania do konfiguracji debugowania, a drzewa AOT do konfiguracji wydania.
pt_br: Não é recomendado usar a implantação rápida e a AOT ao mesmo tempo. Use a implantação rápida para configurações de Depuração e a AOT para configurações de Liberação.
ru: Не рекомендуется использовать быстрое развертывание и AOT одновременно. Используйте быстрое развертывание для конфигураций отладки, а AOT — для конфигураций выпуска.
zh_hans: 建议不要同时使用快速部署和 AOT。请对调试配置使用快速部署，对发布配置使用 AOT。

# XA0119_LinkMode
source: Using fast deployment and the linker at the same time is not recommended. Use fast deployment for Debug configurations and the linker for Release configurations.
cs: Používání rychlého nasazení a linkeru najednou se nedoporučuje. Pro konfigurace Debug použijte rychlé nasazení, pro konfigurace Release pak linker.
de: Von der gleichzeitigen Verwendung der schnellen Bereitstellung und des Linkers wird abgeraten. Verwenden Sie die schnelle Bereitstellung für Debugkonfigurationen und den Linker für Releasekonfigurationen.
es: No se recomienda usar una implementación rápida y el enlazador al mismo tiempo. Use la implementación rápida para configuraciones de Debug y el enlazador para configuraciones de Release.
it: L'uso contestuale della distribuzione rapida e del linker è sconsigliato. Usare la distribuzione rapida per le configurazioni di debug e il linker per le configurazioni di versione.
ja: 高速展開とリンカーを同時に使用することはお勧めできません。Debug 構成には高速展開、Release 構成にはリンカーを使用してください。
ko: 빠른 배포와 링커를 동시에 사용하는 것은 좋지 않습니다. Debug 구성에 빠른 배포를 사용하고, Release 구성에 링커를 사용하세요.
pl: W tym samym czasie nie zaleca się używania funkcji szybkiego wdrażania i konsolidatora. Użyj szybkiego wdrażania do konfiguracji debugowania, a konsolidatora do konfiguracji wydania.
pt_br: Não é recomendado usar a implantação rápida e o vinculador ao mesmo tempo. Use a implantação rápida para configurações de Depuração e o vinculador para configurações de Liberação.
ru: Не рекомендуется использовать быстрое развертывание и компоновщик одновременно. Используйте быстрое развертывание для конфигураций отладки, а компоновщик — для конфигураций выпуска.
zh_hans: 建议不要同时使用快速部署和链接器。请对调试配置使用快速部署，对发布配置使用链接器。

# XA0119_LinkTool
source: Using fast deployment and a code shrinker at the same time is not recommended. Use fast deployment for Debug configurations and a code shrinker for Release configurations.
cs: Používání rychlého nasazení a nástroje pro zmenšování kódu najednou se nedoporučuje. Pro konfigurace Debug použijte rychlé nasazení, pro konfigurace Release pak nástroj pro zmenšování kódu.
de: Von der gleichzeitigen Verwendung der schnellen Bereitstellung und des Codeshrinkers wird abgeraten. Verwenden Sie die schnelle Bereitstellung für Debugkonfigurationen und den Codeshrinker für Releasekonfigurationen.
es: No se recomienda usar una implementación rápida y un reducidor de código al mismo tiempo. Use la implementación rápida para configuraciones de Debug y un reductor de código para configuraciones de Release.
it: L'uso contestuale della distribuzione rapida e di un code shrinker è sconsigliato. Usare la distribuzione rapida per le configurazioni di debug e un code shrinker per le configurazioni di versione.
ja: 高速展開とコード シュリンカーを同時に使用することはお勧めできません。Debug 構成には高速展開、Release 構成にはコード シュリンカーを使用してください。
ko: 빠른 배포와 코드 Shrinker를 동시에 사용하는 것은 좋지 않습니다. Debug 구성에 빠른 배포를 사용하고, Release 구성에 코드 Shrinker를 사용하세요.
pl: W tym samym czasie nie zaleca się korzystania z funkcji szybkiego wdrażania i zmniejszania kodu. Użyj szybkiego wdrażania do konfiguracji debugowania, a zmniejszania kodu do konfiguracji wydania.
pt_br: Não é recomendado usar a implantação rápida e a redução de código ao mesmo tempo. Use a implantação rápida para configurações de Depuração e a redução de código para configurações de Liberação.
ru: Не рекомендуется использовать быстрое развертывание и средство сжатия кода одновременно. Используйте быстрое развертывание для конфигураций отладки и средство сжатия кода для конфигураций выпуска.
zh_hans: 建议不要同时使用快速部署和代码 Shrinker。请对调试配置使用快速部署，对发布配置使用代码 Shrinker。

# XA0121
source: Assembly '{0}' is using '[assembly: {1}]', which is no longer supported. Use a newer version of this NuGet package or notify the library author.
cs: Sestavení {0} používá atribut [assembly: {1}], který se už nepodporuje. Použijte novější verzi tohoto balíčku NuGet, nebo to oznamte autorovi knihovny.
de: Die Assembly "{0}" verwendet das Attribut "[assembly: {1}]", dieses wird nicht mehr unterstützt. Verwenden Sie eine neuere Version dieses NuGet-Pakets, oder benachrichtigen Sie den Bibliotheksautor.
es: El ensamblado "{0}" usa "[assembly: {1}]", que ya no se admite. Utilice una versión más reciente de este paquete NuGet o informe al autor de la biblioteca.
it: L'assembly '{0}' usa '[assembly: {1}]', che non è più supportato. Usare una versione più recente di questo pacchetto NuGet o inviare una notifica all'autore della libreria.
ja: アセンブリ '{0}' は、今はサポートされていない '[assembly: {1}]' を使用しています。この NuGet パッケージの新しいバージョンを使用するか、ライブラリの作成者に連絡してください。
ko: '{0}' 어셈블리가 더 이상 지원되지 않는 '[assembly: {1}]'을(를) 사용하고 있습니다. 이 NuGet 패키지의 최신 버전을 사용하거나 라이브러리 작성자에게 알리세요.
pl: Zestaw „{0}” korzysta z atrybutu „[assembly: {1}]”, który nie jest już obsługiwany. Użyj nowszej wersji tego pakietu NuGet lub powiadom autora biblioteki.
pt_br: O assembly '{0}' está usando '[assembly: {1}]', que não tem mais suporte. Use uma versão mais recente deste pacote NuGet ou notifique o autor da biblioteca.
ru: Сборка "{0}" использует "[assembly: {1}]", которая больше не поддерживается. Используйте более новую версию этого пакета NuGet или уведомите автора библиотеки.
zh_hans: 程序集“{0}”使用不再受支持的“[assembly: {1}]”。请使用此 NuGet 包的较新版本或通知库作者。

# XA0122
source: Assembly '{0}' is using a deprecated attribute '[assembly: {1}]'. Use a newer version of this NuGet package or notify the library author.
cs: Sestavení {0} používá zastaralý atribut [assembly: {1}]. Použijte novější verzi tohoto balíčku NuGet, nebo to oznamte autorovi knihovny.
de: Die Assembly "{0}" verwendet ein veraltetes Attribut "[assembly: {1}]". Verwenden Sie eine neuere Version dieses NuGet-Pakets, oder benachrichtigen Sie den Bibliotheksautor.
es: El ensamblado "{0}" usa un atributo "[assembly: {1}]" en desuso. Utilice una versión más reciente de este paquete NuGet o informe al autor de la biblioteca.
it: L'assembly '{0}' usa un attributo deprecato '[assembly: {1}]'. Usare una versione più recente di questo pacchetto NuGet o inviare una notifica all'autore della libreria.
ja: アセンブリ '{0}' は、非推奨の属性 '[assembly: {1}]' を使用しています。この NuGet パッケージの新しいバージョンを使用するか、ライブラリの作成者に連絡してください。
ko: '{0}' 어셈블리가 사용되지 않는 특성 '[assembly: {1}]'을(를) 사용하고 있습니다. 이 NuGet 패키지의 최신 버전을 사용하거나 라이브러리 작성자에게 알리세요.
pl: Zestaw „{0}” korzysta z przestarzałego atrybutu „[assembly: {1}]”. Użyj nowszej wersji tego pakietu NuGet lub powiadom autora biblioteki.
pt_br: O assembly '{0}' está usando um atributo preterido '[assembly: {1}]'. Use uma versão mais recente deste pacote NuGet ou notifique o autor da biblioteca.
ru: Сборка "{0}" использует устаревший атрибут "[assembly: {1}]". Используйте более новую версию этого пакета NuGet или уведомите автора библиотеки.
zh_hans: 程序集“{0}”使用已弃用的属性“[assembly: {1}]”。请使用此 NuGet 包的较新版本或通知库作者。

# XA0123
source: Removing {0} from {1}. Lint {2} does not support this check.
cs: Odebírá se {0} z {1}. Lint {2} tuto kontrolu nepodporuje.
de: "{0}" wird aus "{1}" entfernt. Diese Überprüfung wird von Lint "{2}" nicht unterstützt.
es: Quitando {0} de {1}. Lint {2} no admite esta comprobación.
it: Rimozione di {0} da {1}. Lint {2} non supporta questa verifica.
ja: {1} から {0} を削除しています。lint {2} は、このチェックをサポートしていません。
ko: {1}에서 {0}을(를) 제거하는 중입니다. Lint {2}은(는) 이 검사를 지원하지 않습니다.
pl: Usuwanie kontroli {0} z właściwości {1}. Program Lint {2} nie obsługuje tej kontroli.
pt_br: Removendo {0} de {1}. O lint {2} não dá suporte a essa verificação.
ru: Идет удаление {0} из {1}. Lint {2} не поддерживает эту проверку.
zh_hans: 正在从 {1} 中删除 {0}。lint {2} 不支持此检查。

# XA1000
source: There was a problem parsing {0}. This is likely due to incomplete or invalid XML. Exception: {1}
cs: Při parsování {0} došlo k problému. Pravděpodobnou příčinou je neúplný nebo neplatný kód XML. Výjimka: {1}
de: Problem beim Analysieren von "{0}". Dies ist wahrscheinlich auf eine unvollständige oder ungültige XML-Datei zurückzuführen. Ausnahme: {1}
es: Hubo un problema al analizar {0}. Probablemente se deba a un elemento XML incompleto o no válido. Excepción: {1}
it: Si è verificato un problema durante l'analisi di {0}, probabilmente a causa di codice XML incompleto o non valido. Eccezione: {1}
ja: {0} の解析で問題が発生しました。不完全または無効な XML が原因である可能性があります。例外: {1}
ko: {0}을(를) 구문 분석하는 중 문제가 발생했습니다. XML이 불완전하거나 잘못된 것 같습니다. 예외: {1}
pl: Wystąpił problem podczas analizowania pliku {0}. Prawdopodobnie jest to spowodowane niekompletnym lub nieprawidłowym kodem XML. Wyjątek: {1}
pt_br: Ocorreu um problema ao analisar {0}. Isso provavelmente se deve a XML incompleto ou inválido. Exceção: {1}
ru: Возникла проблема при синтаксическом анализе {0}. Возможная причина: неполный или недопустимый код XML. Исключение: {1}
zh_hans: 分析 {0} 时出现问题。这可能是由于 XML 不完整或无效。异常: {1}

# XA1001
source: AndroidResgen: Warning while updating resource XML '{0}': {1}
cs: AndroidResgen: Upozornění při aktualizaci prostředku XML {0}: {1}
de: AndroidResgen: Warnung beim Aktualisieren der Ressourcen-XML-Datei "{0}": {1}
es: AndroidResgen: advertencia al actualizar el XML de recursos "{0}": {1}
it: AndroidResgen: avviso durante l'aggiornamento del codice XML '{0}' della risorsa: {1}
ja: AndroidResgen: リソース XML '{0}' の更新中に警告が発生しました: {1}
ko: AndroidResgen: 리소스 XML '{0}'을(를) 업데이트하는 동안 경고가 발생했습니다. {1}
pl: AndroidResgen: ostrzeżenie podczas aktualizacji kodu XML zasobu „{0}”: {1}
pt_br: AndroidResgen: aviso ao atualizar o recurso XML '{0}': {1}
ru: AndroidResgen: предупреждение при обновлении XML-файла ресурсов "{0}". {1}
zh_hans: AndroidResgen: 更新资源 XML“{0}”时出现警告: {1}

# XA1002
source: The closest match found for '{0}' is '{1}', but the capitalization does not match. Please correct the capitalization.
cs: Nejbližší shoda, která se pro {0} našla, je {1}, ale neodpovídají velká a malá písmena. Opravte je, prosím.
de: Die nächste Übereinstimmung für "{0}" ist "{1}", aber die Groß-/Kleinschreibung stimmt nicht überein. Korrigieren Sie die Groß-/Kleinschreibung.
es: La coincidencia más cercana que se encontró para "{0}" es "{1}", pero el uso de mayúsculas no coincide. Corríjalo.
it: La corrispondenza più vicina trovata per '{0}' è '{1}', ma l'uso di maiuscole/minuscole non corrisponde. Correggere l'uso di maiuscole/minuscole.
ja: '{0}' に最も近いのは '{1}' ですが、大文字と小文字が一致しません。大文字と小文字の区別を訂正してください。
ko: '{0}'에 대해 찾은 가장 가깝게 일치하는 항목은 '{1}'(이)지만, 대문자 표시가 일치하지 않습니다. 대문자 표시를 수정하세요.
pl: Najbliższy znaleziony odpowiednik dla typu „{0}” to „{1}”, ale nie zgadza się wielkość liter. Popraw wielkość liter.
pt_br: A correspondência mais próxima encontrada para '{0}' é '{1}', mas não há correspondência entre maiúsculas e minúsculas. Corrija o uso de maiúsculas e minúsculas.
ru: Для "{0}" найдено ближайшее соответствие "{1}", однако регистр символов не совпадает. Необходимо исправить его.
zh_hans: 找到的最接近“{0}”的匹配项是“{1}”，但其大小写不匹配。请更正大小写。

# XA1005
source: Attempting basic type name matching for element with ID '{0}' and type '{1}'
cs: Pro element s ID {0} a typem {1} probíhá pokus o základní porovnání názvu typu.
de: Es wird versucht, einen Basistypnamen für das Element mit der ID {0} und dem Typ "{1}" abzugleichen.
es: Se está intentando realizar una coincidencia de nombres de tipo básico para el elemento con el identificador "{0}" y el tipo "{1}".
it: Tentativo di abbinamento di base dei nomi di tipo per l'elemento con ID '{0}' e tipo '{1}'
ja: ID '{0}'、型 '{1}' の要素に対して、基本型の名前の一致を試行しています
ko: ID가 '{0}'이고 형식이 '{1}'인 요소의 기본 형식 이름 일치를 시도하는 중
pl: Podjęto próbę dopasowania nazwy typu podstawowego dla elementu o identyfikatorze „{0}” i typie „{1}”
pt_br: Tentando correspondência de nome de tipo básico para o elemento com a ID '{0}' e o tipo '{1}'
ru: Попытка сопоставления имени базового типа для элемента с идентификатором "{0}" и типом "{1}".
zh_hans: 正在尝试对 ID 为“{0}”、类型为“{1}”的元素执行基本类型名称匹配

# XA1005_Instructions
source: If basic type name matching fails, please add a `xamarin:managedType` attribute to the element to specify the fully qualified managed type name of the element.
cs: Pokud základní porovnání názvu typu neproběhne úspěšně, přidejte prosím k elementu atribut xamarin:managedType, aby se zadal plně kvalifikovaný název spravovaného typu daného elementu.
de: Wenn der Abgleich des Basistypnamens nicht erfolgreich ist, fügen Sie dem Element ein xamarin:managedType-Attribut hinzu, um den vollqualifizierten Namen des verwalteten Typs für das Element anzugeben.
es: Si se produce un error en la coincidencia de nombres de tipo básico, agregue un atributo "xamarin:managedType" al elemento para especificar su nombre de tipo administrado completo correspondiente.
it: Se l'abbinamento di base dei nomi di tipo non riesce, aggiungere un attributo `xamarin:managedType` all'elemento per specificare il nome completo del tipo gestito dell'elemento.
ja: 基本型の名前の一致に失敗した場合は、`xamarin:managedType` 属性を要素に追加して、要素のマネージ型の完全修飾名を指定してください。
ko: 기본 형식 이름 일치에 실패하면 요소에 'xamarin:managedType' 특성을 추가하여 요소의 정규화된 관리형 형식 이름을 지정하세요.
pl: Jeśli dopasowanie nazwy typu podstawowego nie powiedzie się, dodaj atrybut „xamarin:managedType” do elementu, aby określić w pełni kwalifikowaną nazwę typu zarządzanego elementu.
pt_br: Se a correspondência de nome de tipo básico falhar, adicione um atributo `xamarin:managedType` ao elemento para especificar o nome do tipo gerenciado totalmente qualificado do elemento.
ru: Если сопоставление имени базового типа не удается выполнить, добавьте к элементу атрибут "xamarin:managedType", чтобы указать полное имя управляемого типа элемента.
zh_hans: 如果基本类型名称匹配失败，请向该元素添加 `xamarin:managedType` 属性，以指定该元素的完全限定托管类型名称。
