Repository: dotnet/android
Catalog: src/Xamarin.Android.Build.Tasks/Properties/xlf/Resources.*.xlf
Languages: cs, de, es, it, ja, ko, pl, pt_br, ru, zh_hans

# XA1006
source: The TargetFrameworkVersion (Android API level {0}) is higher than the targetSdkVersion ({1}). Please increase the `android:targetSdkVersion` in the `AndroidManifest.xml` so that the API levels match.
cs: TargetFrameworkVersion (úroveň rozhraní Android API {0}) je vyšší než targetSdkVersion ({1}). Navyšte prosím android:targetSdkVersion v souboru AndroidManifest.xml tak, aby si úrovně rozhraní API odpovídaly.
de: Die TargetFrameworkVersion (Android-API-Ebene {0}) ist höher als die targetSdkVersion ({1}). Erhöhen Sie "android:targetSdkVersion" in "AndroidManifest.xml", sodass die API-Ebenen übereinstimmen.
es: El valor de TargetFrameworkVersion (nivel de API {0} de Android) es mayor que el de targetSdkVersion ({1}). Aumente el valor de "android:targetSdkVersion" en "AndroidManifest.xml" para que los niveles de API coincidan.
it: Il valore di TargetFrameworkVersion (livello API Android {0}) è maggiore di quello di targetSdkVersion ({1}). Aumentare il valore di `android:targetSdkVersion` in `AndroidManifest.xml` in modo che i livelli API corrispondano.
ja: TargetFrameworkVersion (Android API レベル {0}) が targetSdkVersion ({1}) より大きくなっています。API レベルが一致するように、'AndroidManifest.xml' の 'android:targetSdkVersion' を大きくしてください。
ko: TargetFrameworkVersion(Android API 레벨 {0})이 targetSdkVersion({1})보다 높습니다. API 레벨이 일치하도록 'AndroidManifest.xml'에서 'android:targetSdkVersion'을 높이세요.
pl: Wartość atrybutu TargetFrameworkVersion (poziom interfejsu API systemu Android {0}) jest większa niż wartość atrybutu targetSdkVersion ({1}). Zwiększ wartość atrybutu „android:targetSdkVersion” w pliku „AndroidManifest.xml”, aby poziomy interfejsów API były zgodne.
pt_br: A TargetFrameworkVersion (nível da API do Android {0}) é maior que a targetSdkVersion ({1}). Aumente `android:targetSdkVersion` em `AndroidManifest.xml` para que os níveis de API correspondam.
ru: Версия TargetFrameworkVersion (уровень API Android {0}) больше версии targetSdkVersion ({1}). Увеличьте версию "android:targetSdkVersion" в файле "AndroidManifest.xml", чтобы уровни API совпадали.
zh_hans: TargetFrameworkVersion (Android API 级别 {0})高于 targetSdkVersion ({1})。请在 `AndroidManifest.xml` 中增加 `android:targetSdkVersion`，使 API 级别匹配。

# XA1007
source: The minSdkVersion ({0}) is greater than the targetSdkVersion. Please change the value such that the minSdkVersion is less than or equal to the targetSdkVersion ({1}).
cs: Verze minSdkVersion ({0}) je větší než targetSdkVersion. Změňte prosím hodnotu tak, aby verze minSdkVersion byla nižší nebo stejná jako targetSdkVersion ({1}).
de: Die minSdkVersion ({0}) ist größer als die targetSdkVersion. Ändern Sie den Wert so ab, dass der minSdkVersion-Wert kleiner ist als der targetSdkVersion-Wert ({1}) oder diesem entspricht.
es: El valor de minSdkVersion ({0}) es mayor que el de targetSdkVersion. Cambie el valor de forma que minSdkVersion sea menor o igual que targetSdkVersion ({1}).
it: Il valore di minSdkVersion ({0}) è maggiore di quello di targetSdkVersion. Modificare il valore in modo che quello di minSdkVersion sia minore o uguale a quello di targetSdkVersion ({1}).
ja: minSdkVersion ({0}) が targetSdkVersion より大きくなっています。minSdkVersion が targetSdkVersion ({1}) 以下になるよう値を変更してください。
ko: minSdkVersion({0})이 targetSdkVersion보다 큽니다. minSdkVersion이 targetSdkVersion({1})보다 작거나 같도록 값을 변경하세요.
pl: Wartość atrybutu minSdkVersion ({0}) jest większa niż wartość atrybutu minSdkVersion. Zmień wartość atrybutu minSdkVersion w taki sposób, aby była mniejsza lub równa wartości atrybutu targetSdkVersion ({1}).
pt_br: A minSdkVersion ({0}) é maior que a targetSdkVersion. Altere o valor de modo que a minSdkVersion seja inferior ou igual à targetSdkVersion ({1}).
ru: Версия minSdkVersion ({0}) больше версии targetSdkVersion. Измените значение таким образом, чтобы версия minSdkVersion была меньше или равна версии targetSdkVersion ({1}).
zh_hans: minSdkVersion ({0}) 大于 targetSdkVersion。请更改该值，使 minSdkVersion 小于或等于 targetSdkVersion ({1})。

# XA1008
source: The TargetFrameworkVersion (Android API level {0}) is lower than the targetSdkVersion ({1}). Please increase the `$(TargetFrameworkVersion)` or decrease the `android:targetSdkVersion` in the `AndroidManifest.xml` so that the API levels match.
cs: TargetFrameworkVersion (úroveň rozhraní Android API {0}) je nižší než targetSdkVersion ({1}). Navyšte prosím $(TargetFrameworkVersion) nebo snižte android:targetSdkVersion v souboru AndroidManifest.xml tak, aby si úrovně rozhraní API odpovídaly.
de: Die TargetFrameworkVersion (Android-API-Ebene {0}) ist niedriger als die targetSdkVersion ({1}). Erhöhen Sie "$(TargetFrameworkVersion)", oder verringern Sie den Wert für "android:targetSdkVersion" in "AndroidManifest.xml", sodass die API-Ebenen übereinstimmen.
es: El valor de TargetFrameworkVersion (nivel de API {0} de Android) es menor que el de targetSdkVersion ({1}). Aumente el valor de "$(TargetFrameworkVersion)" o reduzca el de "android:targetSdkVersion" en "AndroidManifest.xml" para que los niveles de API coincidan.
it: Il valore di TargetFrameworkVersion (livello API Android {0}) è minore di quello di targetSdkVersion ({1}). Aumentare il valore di `$(TargetFrameworkVersion)` o diminuire quello di `android:targetSdkVersion` in `AndroidManifest.xml` in modo che i livelli API corrispondano.
ja: TargetFrameworkVersion (Android API レベル {0}) が targetSdkVersion ({1}) より小さくなっています。API レベルが一致するように、'AndroidManifest.xml' の '$(TargetFrameworkVersion)' を大きくするか、'android:targetSdkVersion' を小さくしてください。
ko: TargetFrameworkVersion(Android API 레벨 {0})이 targetSdkVersion({1})보다 낮습니다. API 레벨이 일치하도록 'AndroidManifest.xml'에서 '$(TargetFrameworkVersion)'을(를) 높이거나 'android:targetSdkVersion'을 낮추세요.
pl: Wartość atrybutu TargetFrameworkVersion (poziom interfejsu API systemu Android {0}) jest mniejsza niż wartość atrybutu targetSdkVersion ({1}). Zwiększ wartość atrybutu „$(TargetFrameworkVersion)” lub zmniejsz wartość atrybutu „android:targetSdkVersion” w pliku „AndroidManifest.xml”, aby poziomy interfejsów API były zgodne.
pt_br: A TargetFrameworkVersion (nível de API do Android {0}) é menor que a targetSdkVersion ({1}). Aumente `$(TargetFrameworkVersion)` ou diminua `android:targetSdkVersion` em `AndroidManifest.xml` para que os níveis de API correspondam.
ru: Версия TargetFrameworkVersion (уровень API Android {0}) меньше версии targetSdkVersion ({1}). Увеличьте версию "$(TargetFrameworkVersion)" или уменьшите "android:targetSdkVersion" в файле "AndroidManifest.xml", чтобы уровни API совпадали.
zh_hans: `TargetFrameworkVersion (Android API 级别 {0})低于 targetSdkVersion ({1})。请在 `AndroidManifest.xml` 上增加 $(TargetFrameworkVersion)` 或减少 `android:targetSdkVersion`，使 API 级别匹配。

# XA1010
source: Invalid `$(AndroidManifestPlaceholders)` value for Android manifest placeholders. Please use `key1=value1;key2=value2` format. The specified value was: `{0}`
cs: Neplatná hodnota $(AndroidManifestPlaceholders) pro zástupné symboly manifestu pro Android. Použijte prosím formát klíč1=hodnota1;klíč2=hodnota2. Zadaná hodnota: {0}
de: Ungültiger $(AndroidManifestPlaceholders)-Wert für Android-Manifestplatzhalter. Verwenden Sie das Format "Schlüssel1=Wert1;Schlüssel2=Wert2". Der angegebene Wert lautete "{0}".
es: Valor de "$(AndroidManifestPlaceholders)" no válido para los marcadores de posición del manifiesto de Android. Use el formato "clave1=valor1;clave2=valor2". El valor especificado era "{0}".
it: Il valore di `$(AndroidManifestPlaceholders)` non è valido per i segnaposto di manifesti Android. Usare il formato `key1=value1;key2=value2`. Il valore specificato è: `{0}`
ja: Android マニフェストのプレースホルダーの `$(AndroidManifestPlaceholders)` 値が無効です。`key1=value1;key2=value2` の形式を使用してください。指定された値: `{0}`
ko: Android 매니페스트 자리 표시자에 대한 '$(AndroidManifestPlaceholders)' 값이 잘못되었습니다. 'key1=value1;key2=value2' 형식을 사용하세요. 지정된 값은 '{0}'입니다.
pl: Nieprawidłowa wartość „$(AndroidManifestPlaceholders)” dla symboli zastępczych manifestu systemu Android. Użyj formatu „klucz1=wartość1; klucz2=wartość2”. Podana wartość: „{0}”
pt_br: Valor de `$(AndroidManifestPlaceholders)` inválido para os espaços reservados do manifesto do Android. Use o formato `key1=value1;key2=value2`. O valor especificado era: `{0}`
ru: Недопустимое значение "$(AndroidManifestPlaceholders)" для заполнителей манифеста Android. Используйте формат "ключ1=значение1;ключ2=значение2". Указано значение: "{0}".
zh_hans: Android 清单占位符的 `$(AndroidManifestPlaceholders)` 值无效。请使用 `key1=value1;key2=value2` 格式。指定的值为: `{0}`

# XA1011
source: Using ProGuard with the D8 DEX compiler is no longer supported. Please set the code shrinker to 'r8' in the Visual Studio project property pages or edit the project file in a text editor and set the 'AndroidLinkTool' MSBuild property to 'r8'.
cs: Používání ProGuard s kompilátorem D8 DEX se už nepodporuje. Nastavte prosím na stránkách vlastností projektu sady Visual Studio nástroj pro zmenšování kódu na r8, nebo upravte soubor projektu v textovém editoru a nastavte vlastnost MSBuildu AndroidLinkTool na r8.
de: Die Verwendung von ProGuard mit dem D8 DEX-Compiler wird nicht mehr unterstützt. Legen Sie den Codeshrinker in den Visual Studio-Projekteigenschaftenseiten auf "R8" fest, oder bearbeiten Sie die Projektdatei in einem Text-Editor, und legen Sie die MSBuild-Eigenschaft "AndroidLinkTool" auf "R8" fest.
es: Ya no se admite el uso de ProGuard con el compilador D8 DEX. Establezca el reductor de código en "r8" en las páginas de propiedades del proyecto de Visual Studio o edite el archivo de proyecto en un editor de texto y establezca la propiedad "AndroidLinkTool" de MSBuild en "r8".
it: L'uso di ProGuard con il compilatore DEX D8 non è più supportato. Impostare il code shrinker su `r8` nelle pagine delle proprietà del progetto di Visual Studio o modificare il file di progetto in un editor di testo e impostare la proprietà `AndroidLinkTool` di MSBuild su `r8`.
ja: D8 DEX コンパイラで ProGuard を使用することはサポートされなくなりました。Visual Studio プロジェクトのプロパティ ページでコード shrinker を 'r8' に設定するか、テキスト エディターでプロジェクト ファイルを編集して MSBuild の 'AndroidLinkTool' プロパティを 'r8' に設定してください。
ko: ProGuard는 더 이상 D8 DEX 컴파일러와 함께 사용할 수 없습니다. Visual Studio 프로젝트 속성 페이지에서 코드 Shrinker를 `r8`로 설정하거나 텍스트 편집기에서 프로젝트 파일을 편집하고 `AndroidLinkTool` MSBuild 속성을 `r8`로 설정하세요.
pl: Używanie narzędzia ProGuard z kompilatorem DEX D8 nie jest już obsługiwane. Ustaw narzędzie do zmniejszania objętości kodu na „r8” na stronach właściwości projektu w programie Visual Studio lub poddaj edycji plik projektu za pomocą edytora tekstu i ustaw właściwość programu MSBuild o nazwie „AndroidLinkTool” na wartość „r8”.
pt_br: Não há mais suporte para o uso do ProGuard com o compilador DEX D8. Defina o encolhimento do código para `r8` nas páginas de propriedades do projeto do Visual Studio ou edite o arquivo de projeto em um editor de texto e defina a propriedade `AndroidLinkTool` do MSBuild como `r8`.
ru: Использование ProGuard с компилятором D8 DEX больше не поддерживается. Установите средство сжатия кода "r8" на страницах свойств проекта в Visual Studio или измените файл проекта в текстовом редакторе, установив значение "r8" для свойства MSBuild "AndroidLinkTool".
zh_hans: 不再支持将 ProGuard 与 D8 DEX 编译器一起使用。请在 Visual Studio 项目属性页中将代码收缩工具设置为 "r8"，或在文本编辑器中编辑项目文件，将 "AndroidLinkTool" MSBuild 属性设置为 "r8"。

# XA1012
source: Included layout root element override ID '{0}' is not valid.
cs: Zahrnuté ID přepisu kořenového prvku rozložení {0} není platné.
de: Die enthaltene Überschreibungs-ID "{0}" des enthaltenen Layoutstammelements ist ungültig.
es: El identificador de reemplazo del elemento raíz del diseño "{0}" que se ha incluido no es válido.
it: L'ID '{0}' di override dell'elemento radice del layout incluso non è valido.
ja: 含まれているレイアウトのルート要素のオーバーライド ID '{0}' が有効ではありません。
ko: 포함된 레이아웃 루트 요소 재정의 ID '{0}'이(가) 잘못되었습니다.
pl: Dołączony identyfikator przesłonięcia „{0}” elementu głównego układu jest nieprawidłowy.
pt_br: A ID de substituição do elemento raiz do layout incluída '{0}' não é válida.
ru: Включенный идентификатор переопределения корневого элемента макета "{0}" является недопустимым.
zh_hans: 包含的布局根元素替代 ID“{0}”无效。

# XA1013
source: Failed to parse ID of node '{0}' in the layout file '{1}'.
cs: Nepodařilo se analyzovat ID uzlu {0} v souboru rozložení {1}.
de: Fehler beim Analysieren der ID des Knotens "{0}" in der Layoutdatei "{1}".
es: No se pudo analizar el identificador del nodo "{0}" en el archivo de diseño "{1}".
it: Non è stato possibile analizzare l'ID del nodo '{0}' nel file di layout '{1}'.
ja: レイアウト ファイル '{1}' のノード '{0}' の ID を解析できませんでした。
ko: '{1}' 레이아웃 파일에서 '{0}' 노드의 ID를 구문 분석하지 못했습니다.
pl: Nie można przeanalizować identyfikatora węzła „{0}” w pliku układu „{1}”.
pt_br: Falha ao analisar a ID do nó '{0}' no arquivo de layout '{1}'.
ru: Не удалось проанализировать идентификатор узла "{0}" в файле макета "{1}".
zh_hans: 未能分析布局文件“{1}”中节点“{0}”的 ID。

# XA1014
source: JAR library references with identical file names but different contents were found: {0}. Please remove any conflicting libraries from EmbeddedJar, InputJar and AndroidJavaLibrary.
cs: Knihovna JAR se odkazuje na totožné názvy souborů, ale našel se jiný obsah: {0}. Odeberte prosím konfliktní knihovny z EmbeddedJar, InputJar a AndroidJavaLibrary.
de: Es wurden JAR-Bibliotheksverweise mit identischen Dateinamen, aber unterschiedlichen Inhalten gefunden: {0}. Entfernen Sie alle widersprüchlichen Bibliotheken aus EmbeddedJar, InputJar und AndroidJavaLibrary.
es: Se han encontrado referencias de biblioteca JAR con nombres de archivo idénticos pero contenido distinto: {0}. Quite las bibliotecas en conflicto de EmbeddedJar, InputJar y AndroidJavaLibrary.
it: Sono stati trovati riferimenti a librerie JAR con nomi file identici e contenuto diverso: {0}. Rimuovere le eventuali librerie in conflitto da EmbeddedJar, InputJar e AndroidJavaLibrary.
ja: ファイル名が同じですが内容が異なる JAR ライブラリ参照 {0} が見つかりました。競合しているライブラリを EmbeddedJar、InputJar、AndroidJavaLibrary からすべて削除してください。
ko: 파일 이름은 같지만 콘텐츠가 다른 JAR 라이브러리 참조를 찾았습니다. {0}. EmbeddedJar, InputJar 및 AndroidJavaLibrary에서 충돌하는 라이브러리를 제거하세요.
pl: Znaleziono odwołania do bibliotek JAR z identycznymi nazwami plików, ale różną zawartością: {0}. Usuń wszystkie biblioteki powodujące konflikt z elementów EmbeddedJar, InputJar i AndroidJavaLibrary.
pt_br: Foram encontradas referências de biblioteca JAR com nomes de arquivo idênticos, mas conteúdos diferentes: {0}. Remova todas as bibliotecas conflitantes de EmbeddedJar, InputJar e AndroidJavaLibrary.
ru: Обнаружены ссылки на библиотеки JAR с одинаковыми именами файлов, но разным содержимым: {0}. Удалите конфликтующие библиотеки из EmbeddedJar, InputJar и AndroidJavaLibrary.
zh_hans: 发现具有相同文件名内容不同的 JAR 库参考: {0}。请从 EmbeddedJar、InputJar 和 AndroidJavaLibrary 删除任何冲突的库。

# XA1015
source: More than one Android Wear project is specified as the paired project. It can be at most one.
cs: Jako spárovaný projekt je zadán více než jeden projekt Android Wear. Může být maximálně jeden.
de: Es ist mehr als ein Android Wear-Projekt als gekoppeltes Projekt angegeben. Es darf höchstens Projekt angegeben werden.
es: Se ha especificado más de un proyecto de Android Wear como proyecto emparejado. Debe ser uno como máximo.
it: Come progetto associato è stato specificato più di un progetto Android Wear. È possibile specificarne al massimo uno.
ja: 複数の Android Wear プロジェクトが、ペアリングされたプロジェクトとして指定されています。最大 1 つ指定できます。
ko: 두 개 이상의 Android Wear 프로젝트가 페어링된 프로젝트로 지정되었습니다. 최대 한 개를 사용할 수 있습니다.
pl: Jako projekt sparowany określono więcej niż jeden projekt systemu Android Wear. Może być najwyżej jeden taki projekt.
pt_br: Mais de um projeto do Android Wear está especificado como o projeto emparelhado. Ele pode ter no máximo um.
ru: В качестве связанного проекта указано несколько проектов Android Wear. Такой проект может быть только один.
zh_hans: 已将多个 Android Wear 项目指定为配对的项目。最多只能有一个。

# XA1016
source: Target Wear application's project '{0}' does not specify required 'AndroidManifest' project property.
cs: Projekt {0} cílové aplikace Wear nespecifikuje požadovanou vlastnost projektu AndroidManifest.
de: Das Projekt "{0}" der Wear-Zielanwendung gibt nicht die erforderliche Projekteigenschaft "AndroidManifest" an.
es: El proyecto de la aplicación Wear de destino "{0}" no especifica la propiedad del proyecto "AndroidManifest" requerida.
it: Il progetto '{0}' dell'applicazione Wear di destinazione non specifica la proprietà di progetto obbligatoria 'AndroidManifest'.
ja: Target Wear アプリケーションのプロジェクト '{0}' は、必須の 'AndroidManifest' プロジェクト プロパティを指定しません。
ko: 대상 Wear 애플리케이션의 프로젝트 '{0}'이(가) 필요한 'AndroidManifest' 프로젝트 속성을 지정하지 않습니다.
pl: Projekt aplikacji docelowej systemu Wear „{0}” nie określa wymaganej właściwości projektu „AndroidManifest”.
pt_br: O projeto '{0}' do aplicativo do Wear do destino não especifica a propriedade do projeto 'AndroidManifest' necessária.
ru: В проекте целевого приложения Wear "{0}" не указано обязательное свойство проекта "AndroidManifest".
zh_hans: 目标 Wear 应用程序的项目“{0}”未指定所需的 "AndroidManifest" 项目属性。

# XA1017
source: Target Wear application's AndroidManifest.xml does not specify required 'package' attribute.
cs: Soubor AndroidManifest.xml cílové aplikace Wear nespecifikuje požadovaný atribut package.
de: Die Datei "AndroidManifest.xml" der Wear-Zielanwendung gibt nicht das erforderliche Attribut "package" an.
es: El archivo AndroidManifest.xml de la aplicación Wear de destino no especifica el atributo "package" requerido.
it: Il file AndroidManifest.xml dell'applicazione Wear di destinazione non specifica l'attributo obbligatorio 'package'.
ja: Target Wear アプリケーションの AndroidManifest.xml は、必須の 'package' 属性を指定しません。
ko: 대상 Wear 애플리케이션의 AndroidManifest.xml이 필요한 'package' 특성을 지정하지 않습니다.
pl: Plik AndroidManifest.xml aplikacji docelowej systemu Wear nie określa wymaganego atrybutu „package”.
pt_br: O AndroidManifest.xml do aplicativo do Wear de destino não especifica o atributo 'package' necessário.
ru: В файле AndroidManifest.xml целевого приложения Wear не указан обязательный атрибут "package".
zh_hans: 目标 Wear 应用程序的 AndroidManifest.xml 未指定所需的 "package" 特性。

# XA1018
source: Specified AndroidManifest file does not exist: {0}.
cs: Zadaný soubor AndroidManifest neexistuje: {0}
de: Die angegebene AndroidManifest-Datei ist nicht vorhanden: {0}
es: El archivo AndroidManifest especificado no existe: {0}.
it: Il file AndroidManifest specificato non esiste: {0}.
ja: 指定された AndroidManifest ファイル ({0}) は存在しません。
ko: 지정한 AndroidManifest 파일이 없습니다. {0}
pl: Określony plik AndroidManifest nie istnieje: {0}.
pt_br: O arquivo AndroidManifest especificado não existe: {0}.
ru: Указанный файл AndroidManifest не существует: {0}.
zh_hans: 指定的 AndroidManifest 文件不存在: {0}。

# XA1019
source: `LibraryProjectProperties` file `{0}` is located in a parent directory of the bindings project's intermediate output directory. Please adjust the path to use the original `project.properties` file directly from the Android library project directory.
cs: Soubor LibraryProjectProperties {0} se nachází v adresáři, který je nadřazený přechodnému výstupnímu adresáři vazebního projektu. Upravte prosím cestu tak, aby se používal původní soubor project.properties přímo z adresáře projektu knihovny Androidu.
de: Die LibraryProjectProperties-Datei "{0}" befindet sich in einem übergeordneten Verzeichnis des Zwischenausgabeverzeichnisses für das Bindungsprojekt. Passen Sie den Pfad so an, dass die ursprüngliche Datei "project.properties" direkt aus dem Android-Bibliotheksprojektverzeichnis verwendet wird.
es: El archivo "LibraryProjectProperties" en "{0}" se encuentra en un directorio principal del directorio de salida intermedio del proyecto de enlaces. Ajuste la ruta de acceso para usar el archivo "project.properties" original directamente desde el directorio del proyecto de la biblioteca de Android.
it: Il file `{0}` di `LibraryProjectProperties` si trova in una directory padre della directory di output intermedia del progetto di binding. Modificare il percorso in modo da usare il file `project.properties` originale della directory del progetto della libreria Android.
ja: 'LibraryProjectProperties' ファイル '{0}' は、バインド プロジェクトの中間出力ディレクトリの親ディレクトリにあります。元の 'project.properties' ファイルを Android ライブラリ プロジェクト ディレクトリから直接使用するには、パスを調整してください。
ko: `LibraryProjectProperties` 파일 `{0}`이(가) 바인딩 프로젝트의 중간 출력 디렉터리의 부모 디렉터리에 있습니다. 경로를 조정하여 Android 라이브러리 프로젝트 디렉터리에서 바로 원본 `project.properties` 파일을 사용하세요.
pl: Plik „LibraryProjectProperties” „{0}” znajduje się w katalogu nadrzędnym pośredniego katalogu wyjściowego projektu powiązań. Dostosuj ścieżkę tak, aby użyć oryginalnego pliku „project.properties” bezpośrednio z katalogu projektu biblioteki systemu Android.
pt_br: O arquivo `LibraryProjectProperties` `{0}` está localizado em um diretório pai do diretório de saída intermediário do projeto de associações. Ajuste o caminho para usar o arquivo original `project.properties` diretamente no diretório do projeto de biblioteca do Android.
ru: Файл "LibraryProjectProperties" "{0}" находится в родительском каталоге промежуточного выходного каталога проекта привязок. Измените путь, чтобы использовать исходный файл "project.properties" непосредственно из каталога проекта библиотеки Android.
zh_hans: "LibraryProjectProperties" 文件“{0}”位于绑定项目的中间输出目录的父目录中。请调整路径，以直接从 Android 库项目目录使用原始 "project.properties" 文件。
